name: "init"
op {
  output: "conv_w"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 1
    ints: 1
    ints: 2
    ints: 2
  }
  arg {
    name: "values"
    floats: 1.0
    floats: 1.0
    floats: 1.0
    floats: 1.0
  }
}
op {
  output: "conv_b"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 1
  }
  arg {
    name: "values"
    floats: 2.0
  }
}
op {
  output: "fc_w"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 4
    ints: 3
  }
  arg {
    name: "values"
    floats: 1.0
    floats: 2.0
    floats: 3.0
    floats: 4.0
    floats: 5.0
    floats: 6.0
    floats: 7.0
    floats: 8.0
    floats: 9.0
    floats: 10.0
    floats: 11.0
    floats: 12.0
  }
}
op {
  output: "fc_b"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 4
  }
  arg {
    name: "values"
    floats: 0.1
    floats: 0.2
    floats: 0.3
    floats: 0.4
  }
}
external_output: "conv_w"
external_output: "conv_b"
external_output: "fc_w"
external_output: "fc_b"