name: "init"
op {
  output: "weights"
  type: "Int8GivenTensorFill"
  arg {
    name: "shape"
    ints: 4
    ints: 3
  }
  arg {
    name: "values"
    s: "\x0\x1\x2\x3\x4\x5\x6\x7\x8\x9\xa\xb"
  }
  arg {
    name: "Y_scale"
    f: 1
  }
  arg {
    name: "Y_zero_point"
    i: 0
  }
}
op {
  output: "bias"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 4
  }
  arg {
    name: "values"
    floats: 0
    floats: 1
    floats: 2
    floats: 3
  }
}
