name: "fused_rowwise_quantized_sparse_lengths_sum_init_net_test"
op {
  output: "data"
  type: "GivenTensorByteStringToUInt8Fill"
  arg {
    name: "shape"
    ints: 3
    ints: 10
  }
  arg {
    name: "values"
    strings: "\000\377\152\232\115\072\000\000\200\077\000\377\050\132\215\073\063\063\023\100\000\377\314\063\232\073\000\000\220\100"
  }
}
