name: "fused_rowwise_quantized_sparse_lengths_weighted_sum_init_net_test"
op {
  output: "data"
  type: "Int8GivenTensorFill"
  arg {
    name: "shape"
    ints: 3
    ints: 9
  }
  arg {
    name: "values"
    s: "\377\001\000\200\274\200\200\200\103\000\001\000\200\273\200\200\176\302\377\121\120\320\275\200\200\200\103"
  }
  arg {
    name: "Y_zero_point"
    i: 0
  }
  arg {
    name: "Y_scale"
    f: 0.0
  }
}
op {
  output: "weights"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 8
  }
  arg {
    name: "values"
    floats: 3.0
    floats: 1.0
    floats: 0.0
    floats: 0.0
    floats: 0.0
    floats: 0.0
    floats: 2.0
    floats: -0.5
  }
}
