name: "conv_test"
op {
  input: "gpu_0/data_0"
  input: "rhs"
  output: "out"
  type: "Int8SumRelu"
  arg {
    name: "Y_scale"
    f: 1
  }
  arg {
    name: "Y_zero_point"
    i: 0
  }
}
external_output: "out"

