name: "conv_test"
op {
  input: "gpu_0/data_0"
  input: "conv_w"
  input: "conv_b"
  output: "conv_out"
  type: "Conv"
  arg {
    name: "kernel"
    i: 2
  }
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "group"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "dilations"
    ints: 2
    ints: 2
  }
}
external_output: "conv_out"
