name: "rowwise_quantized_sparse_lengths_weighted_sum_init_net_test"
op {
  output: "data"
  type: "GivenTensorByteStringToUInt8Fill"
  arg {
    name: "shape"
    ints: 3
    ints: 1
  }
  arg {
    name: "values"
    strings: "\000\000\000"
  }
}
op {
  output: "scale_bias"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 3
    ints: 2
  }
  arg {
    name: "values"
    floats: 1.0
    floats: 2.0
    floats: 1.0
    floats: -0.5
    floats: 1.0
    floats: 13.0
  }
}
op {
  output: "weights"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 8
  }
  arg {
    name: "values"
    floats: 3.0
    floats: 1.0
    floats: 0.0
    floats: 0.0
    floats: 0.0
    floats: 0.0
    floats: 2.0
    floats: -0.5
  }
}
