name: "rowwise_quantized_sparse_lengths_sum_init_net_test"
op {
  output: "data"
  type: "Int8GivenTensorFill"
  arg {
    name: "shape"
    ints: 3
    ints: 2
  }
  arg {
    name: "values"
    s: "\000\377\000\377\000\377"
  }
  arg {
    name: "Y_zero_point"
    i: 0
  }
  arg {
    name: "Y_scale"
    f: 0.0
  }
}
op {
  output: "scales_bias"
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 3
    ints: 2
  }
  arg {
    name: "values"
    floats: 0.00078431389
    floats: 1.0
    floats: 0.0043137260
    floats: 2.3
    floats: 0.0047058817
    floats: 4.5
  }
}
