ir_version: 5
domain: "onnx"
# ONNX TensorProto.DataType:
#    UNDEFINED = 0;
#    FLOAT = 1;
#    UINT8 = 2;
#    INT8 = 3;
#    UINT16 = 4;
#    INT16 = 5;
#    INT32 = 6;
#    INT64 = 7;
#    STRING = 8;
#    BOOL = 9;
#    FLOAT16 = 10;
#    DOUBLE = 11;
#    UINT32 = 12;
#    UINT64 = 13;
#    COMPLEX64 = 14;
#    COMPLEX128 = 15;
graph {
   initializer {
       dims: 1
       data_type: 7
       name: "k"
       int64_data: 2
   }
  input {
    name: "scores"
    type {
      tensor_type {
        elem_type: 1
        shape {
         dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
   node {
       input: "input"
       output: "scores"
       name: "argmin"
       op_type: "ArgMin"
       attribute {
        name: "axis"
        i: 2
        type: INT
      }
      attribute {
        name: "keepdims"
        i: 2
        type: INT
      }
   }

output {
    name: "scores"
    type {
      tensor_type {
        elem_type: 6
        shape {
         dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
