ir_version: 5
producer_name: "onnx-audio-spectrogram"
graph {
  node {
    input: "input"
    output: "spectrogram"
    name: "audio_spectrogram"
    op_type: "AudioSpectrogram"
    attribute {
      name: "magnitude_squared"
      i: 1
      type: INT
    }
    attribute {
      name: "stride"
      i: 320
      type: INT
    }
    attribute {
      name: "window_size"
      i: 640
      type: INT
    }
  }
  node {
    input: "spectrogram"
    input: "spectrogram_ref"
    output: "spectrogram_err"
    name: "error"
    op_type: "Sub"
  }
  name: "audio_spectrogram_test"
  initializer {
    dims: 1
    dims: 960
    data_type: 1
    float_data: 1.6243454217910767
    float_data: -0.6117563843727112
    float_data: -0.5281717777252197
    float_data: -1.072968602180481
    float_data: 0.8654076457023621
    float_data: -2.3015387058258057
    float_data: 1.744811773300171
    float_data: -0.7612069249153137
    float_data: 0.31903910636901855
    float_data: -0.24937038123607635
    float_data: 1.4621078968048096
    float_data: -2.060140609741211
    float_data: -0.3224171996116638
    float_data: -0.38405436277389526
    float_data: 1.1337693929672241
    float_data: -1.0998913049697876
    float_data: -0.1724282056093216
    float_data: -0.8778584003448486
    float_data: 0.042213745415210724
    float_data: 0.5828152298927307
    float_data: -1.1006191968917847
    float_data: 1.144723653793335
    float_data: 0.9015907049179077
    float_data: 0.5024943351745605
    float_data: 0.9008559584617615
    float_data: -0.6837278604507446
    float_data: -0.12289022654294968
    float_data: -0.9357694387435913
    float_data: -0.26788806915283203
    float_data: 0.5303554534912109
    float_data: -0.6916607618331909
    float_data: -0.3967535197734833
    float_data: -0.6871727108955383
    float_data: -0.8452056646347046
    float_data: -0.6712461113929749
    float_data: -0.01266459934413433
    float_data: -1.1173104047775269
    float_data: 0.2344156950712204
    float_data: 1.6598021984100342
    float_data: 0.7420441508293152
    float_data: -0.19183555245399475
    float_data: -0.887628972530365
    float_data: -0.7471582889556885
    float_data: 1.6924545764923096
    float_data: 0.050807755440473557
    float_data: -0.6369956731796265
    float_data: 0.19091548025608063
    float_data: 2.100255250930786
    float_data: 0.12015895545482635
    float_data: 0.6172031164169312
    float_data: 0.30017033219337463
    float_data: -0.3522498607635498
    float_data: -1.142518162727356
    float_data: -0.3493427336215973
    float_data: -0.20889423787593842
    float_data: 0.5866231918334961
    float_data: 0.838983416557312
    float_data: 0.9311020970344543
    float_data: 0.2855873107910156
    float_data: 0.8851411938667297
    float_data: -0.7543979287147522
    float_data: 1.2528681755065918
    float_data: 0.5129297971725464
    float_data: -0.2980928421020508
    float_data: 0.4885181486606598
    float_data: -0.07557171583175659
    float_data: 1.1316293478012085
    float_data: 1.5198168754577637
    float_data: 2.185575485229492
    float_data: -1.396496295928955
    float_data: -1.444113850593567
    float_data: -0.5044658780097961
    float_data: 0.1600370705127716
    float_data: 0.8761689066886902
    float_data: 0.31563493609428406
    float_data: -2.0222012996673584
    float_data: -0.30620402097702026
    float_data: 0.8279746174812317
    float_data: 0.23009473085403442
    float_data: 0.7620111703872681
    float_data: -0.22232814133167267
    float_data: -0.20075806975364685
    float_data: 0.18656139075756073
    float_data: 0.4100516438484192
    float_data: 0.19829972088336945
    float_data: 0.11900864541530609
    float_data: -0.6706622838973999
    float_data: 0.3775637745857239
    float_data: 0.12182126939296722
    float_data: 1.129483938217163
    float_data: 1.1989178657531738
    float_data: 0.1851564198732376
    float_data: -0.37528494000434875
    float_data: -0.6387304067611694
    float_data: 0.4234943687915802
    float_data: 0.07734006643295288
    float_data: -0.3438536822795868
    float_data: 0.04359685629606247
    float_data: -0.6200008392333984
    float_data: 0.698032021522522
    float_data: -0.447128564119339
    float_data: 1.2245076894760132
    float_data: 0.40349164605140686
    float_data: 0.5935785174369812
    float_data: -1.094911813735962
    float_data: 0.16938243806362152
    float_data: 0.7405564785003662
    float_data: -0.953700602054596
    float_data: -0.26621851325035095
    float_data: 0.03261454775929451
    float_data: -1.3731173276901245
    float_data: 0.3151593804359436
    float_data: 0.8461606502532959
    float_data: -0.8595159649848938
    float_data: 0.3505459725856781
    float_data: -1.3122833967208862
    float_data: -0.03869551047682762
    float_data: -1.6157723665237427
    float_data: 1.121417760848999
    float_data: 0.40890052914619446
    float_data: -0.02461695671081543
    float_data: -0.775161623954773
    float_data: 1.2737559080123901
    float_data: 1.9671016931533813
    float_data: -1.8579819202423096
    float_data: 1.2361639738082886
    float_data: 1.6276507377624512
    float_data: 0.3380116820335388
    float_data: -1.1992679834365845
    float_data: 0.8633453249931335
    float_data: -0.1809203028678894
    float_data: -0.6039206385612488
    float_data: -1.230058193206787
    float_data: 0.5505374670028687
    float_data: 0.79280686378479
    float_data: -0.6235307455062866
    float_data: 0.5205763578414917
    float_data: -1.1443413496017456
    float_data: 0.801861047744751
    float_data: 0.04656729847192764
    float_data: -0.18656976521015167
    float_data: -0.10174587368965149
    float_data: 0.8688861727714539
    float_data: 0.7504116296768188
    float_data: 0.5294653177261353
    float_data: 0.13770121335983276
    float_data: 0.07782112807035446
    float_data: 0.6183802485466003
    float_data: 0.2324945628643036
    float_data: 0.682551383972168
    float_data: -0.3101167678833008
    float_data: -2.434837818145752
    float_data: 1.0388245582580566
    float_data: 2.1869795322418213
    float_data: 0.44136443734169006
    float_data: -0.10015523433685303
    float_data: -0.13644474744796753
    float_data: -0.11905419081449509
    float_data: 0.01740940846502781
    float_data: -1.1220186948776245
    float_data: -0.5170944333076477
    float_data: -0.997026801109314
    float_data: 0.2487991601228714
    float_data: -0.29664114117622375
    float_data: 0.49521133303642273
    float_data: -0.17470316588878632
    float_data: 0.9863351583480835
    float_data: 0.2135339081287384
    float_data: 2.190699815750122
    float_data: -1.8963608741760254
    float_data: -0.6469166874885559
    float_data: 0.901486873626709
    float_data: 2.5283257961273193
    float_data: -0.24863477051258087
    float_data: 0.043668992817401886
    float_data: -0.2263142466545105
    float_data: 1.3314571380615234
    float_data: -0.28730785846710205
    float_data: 0.6800698637962341
    float_data: -0.31980159878730774
    float_data: -1.2725588083267212
    float_data: 0.3135477304458618
    float_data: 0.5031847953796387
    float_data: 1.293225884437561
    float_data: -0.11044702678918839
    float_data: -0.6173620820045471
    float_data: 0.5627610683441162
    float_data: 0.24073709547519684
    float_data: 0.2806650698184967
    float_data: -0.07311270385980606
    float_data: 1.1603385210037231
    float_data: 0.36949270963668823
    float_data: 1.9046586751937866
    float_data: 1.1110566854476929
    float_data: 0.6590498089790344
    float_data: -1.6274383068084717
    float_data: 0.6023193001747131
    float_data: 0.4202822148799896
    float_data: 0.8109516501426697
    float_data: 1.044442057609558
    float_data: -0.4008781909942627
    float_data: 0.8240056037902832
    float_data: -0.5623054504394531
    float_data: 1.9548780918121338
    float_data: -1.33195161819458
    float_data: -1.7606885433197021
    float_data: -1.6507213115692139
    float_data: -0.8905555605888367
    float_data: -1.1191153526306152
    float_data: 1.9560788869857788
    float_data: -0.32649949193000793
    float_data: -1.342675805091858
    float_data: 1.1143829822540283
    float_data: -0.5865239500999451
    float_data: -1.2368533611297607
    float_data: 0.8758389353752136
    float_data: 0.6233621835708618
    float_data: -0.4349566698074341
    float_data: 1.407539963722229
    float_data: 0.12910157442092896
    float_data: 1.6169495582580566
    float_data: 0.5027408599853516
    float_data: 1.5588055849075317
    float_data: 0.10940269380807877
    float_data: -1.2197444438934326
    float_data: 2.449368715286255
    float_data: -0.5457741618156433
    float_data: -0.19883786141872406
    float_data: -0.7003985047340393
    float_data: -0.20339444279670715
    float_data: 0.24266944825649261
    float_data: 0.2018301784992218
    float_data: 0.6610202789306641
    float_data: 1.7921582460403442
    float_data: -0.12046457082033157
    float_data: -1.2331206798553467
    float_data: -1.182318091392517
    float_data: -0.665754497051239
    float_data: -1.6741957664489746
    float_data: 0.8250298500061035
    float_data: -0.4982135593891144
    float_data: -0.3109849691390991
    float_data: -0.0018914828542619944
    float_data: -1.3966203927993774
    float_data: -0.8613163828849792
    float_data: 0.6747115254402161
    float_data: 0.6185391545295715
    float_data: -0.4431719183921814
    float_data: 1.810534954071045
    float_data: -1.3057268857955933
    float_data: -0.3449872136116028
    float_data: -0.23083974421024323
    float_data: -2.7930850982666016
    float_data: 1.9375288486480713
    float_data: 0.3663320243358612
    float_data: -1.0445894002914429
    float_data: 2.051173448562622
    float_data: 0.5856620073318481
    float_data: 0.429526150226593
    float_data: -0.6069983839988708
    float_data: 0.1062227264046669
    float_data: -1.5256803035736084
    float_data: 0.7950261235237122
    float_data: -0.3744383156299591
    float_data: 0.134048193693161
    float_data: 1.2020548582077026
    float_data: 0.2847481071949005
    float_data: 0.2624674439430237
    float_data: 0.27649930119514465
    float_data: -0.733271598815918
    float_data: 0.8360047340393066
    float_data: 1.5433591604232788
    float_data: 0.7588056325912476
    float_data: 0.8849087953567505
    float_data: -0.8772815465927124
    float_data: -0.86778724193573
    float_data: -1.4408760070800781
    float_data: 1.232253074645996
    float_data: -0.25417986512184143
    float_data: 1.3998439311981201
    float_data: -0.7819116711616516
    float_data: -0.4375089704990387
    float_data: 0.095425084233284
    float_data: 0.9214500784873962
    float_data: 0.06075019761919975
    float_data: 0.2111247479915619
    float_data: 0.01652756705880165
    float_data: 0.1771877259016037
    float_data: -1.1164699792861938
    float_data: 0.08092710375785828
    float_data: -0.18657898902893066
    float_data: -0.05682447925209999
    float_data: 0.49233654141426086
    float_data: -0.680678129196167
    float_data: -0.0845080241560936
    float_data: -0.2973618805408478
    float_data: 0.4173020124435425
    float_data: 0.784770667552948
    float_data: -0.9554252624511719
    float_data: 0.585910439491272
    float_data: 2.0657832622528076
    float_data: -1.4711569547653198
    float_data: -0.8301718831062317
    float_data: -0.8805776238441467
    float_data: -0.2790977358818054
    float_data: 1.6228491067886353
    float_data: 0.013352676294744015
    float_data: -0.6946936249732971
    float_data: 0.6218035221099854
    float_data: -0.5998045206069946
    float_data: 1.1234121322631836
    float_data: 0.3052670359611511
    float_data: 1.3887794017791748
    float_data: -0.6613442301750183
    float_data: 3.0308570861816406
    float_data: 0.8245846033096313
    float_data: 0.6545801758766174
    float_data: -0.05118844658136368
    float_data: -0.7255971431732178
    float_data: -0.8677687048912048
    float_data: -0.13597732782363892
    float_data: -0.7972697615623474
    float_data: 0.28267571330070496
    float_data: -0.8260974287986755
    float_data: 0.6210827231407166
    float_data: 0.9561216831207275
    float_data: -0.705840528011322
    float_data: 1.1926860809326172
    float_data: -0.2379419356584549
    float_data: 1.1552878618240356
    float_data: 0.4381663501262665
    float_data: 1.122328281402588
    float_data: -0.9970197677612305
    float_data: -0.10679398477077484
    float_data: 1.4514292478561401
    float_data: -0.6180368661880493
    float_data: -2.037201166152954
    float_data: -1.9425891637802124
    float_data: -2.5064406394958496
    float_data: -2.114163875579834
    float_data: -0.41163915395736694
    float_data: 1.278528094291687
    float_data: -0.4422292709350586
    float_data: 0.32352736592292786
    float_data: -0.10999149084091187
    float_data: 0.008548945188522339
    float_data: -0.1681988388299942
    float_data: -0.17418034374713898
    float_data: 0.46116408705711365
    float_data: -1.1759827136993408
    float_data: 1.0101271867752075
    float_data: 0.9200179576873779
    float_data: -0.19505734741687775
    float_data: 0.805393397808075
    float_data: -0.7013444304466248
    float_data: -0.5372230410575867
    float_data: 0.15626384317874908
    float_data: -0.19022102653980255
    float_data: -0.4487380385398865
    float_data: -0.6724480390548706
    float_data: -0.5574946999549866
    float_data: 0.9391687512397766
    float_data: -1.9433233737945557
    float_data: 0.35249435901641846
    float_data: -0.23643694818019867
    float_data: 0.7278134822845459
    float_data: 0.5150735974311829
    float_data: -2.78253436088562
    float_data: 0.5846465826034546
    float_data: 0.3242742419242859
    float_data: 0.021862836554646492
    float_data: -0.46867382526397705
    float_data: 0.8532811999320984
    float_data: -0.4130293130874634
    float_data: 1.8347176313400269
    float_data: 0.5643828511238098
    float_data: 2.1378281116485596
    float_data: -0.7855340242385864
    float_data: -1.7559256553649902
    float_data: 0.7147895693778992
    float_data: 0.8527040481567383
    float_data: 0.035360097885131836
    float_data: -1.5387932062149048
    float_data: -0.44789519906044006
    float_data: 0.6179855465888977
    float_data: -0.18417632579803467
    float_data: -0.11598518490791321
    float_data: -0.17545896768569946
    float_data: -0.9339146614074707
    float_data: -0.5330203175544739
    float_data: -1.4265553951263428
    float_data: 1.7679599523544312
    float_data: -0.47537288069725037
    float_data: 0.47761017084121704
    float_data: -1.0218859910964966
    float_data: 0.7945282459259033
    float_data: -1.8731609582901
    float_data: 0.9206151366233826
    float_data: -0.035367924720048904
    float_data: 2.110605001449585
    float_data: -1.3065340518951416
    float_data: 0.07638048380613327
    float_data: 0.3672318160533905
    float_data: 1.2328991889953613
    float_data: -0.4228569567203522
    float_data: 0.08646440505981445
    float_data: -2.1424667835235596
    float_data: -0.8301688432693481
    float_data: 0.45161595940589905
    float_data: 1.1041743755340576
    float_data: -0.28173625469207764
    float_data: 2.0563554763793945
    float_data: 1.7602492570877075
    float_data: -0.060652490705251694
    float_data: -2.4135029315948486
    float_data: -1.7775664329528809
    float_data: -0.7778588533401489
    float_data: 1.1158411502838135
    float_data: 0.3102722764015198
    float_data: -2.094247817993164
    float_data: -0.2287658303976059
    float_data: 1.6133613586425781
    float_data: -0.37480467557907104
    float_data: -0.7499696016311646
    float_data: 2.054624080657959
    float_data: 0.05340953543782234
    float_data: -0.47915709018707275
    float_data: 0.3501671552658081
    float_data: 0.017164725810289383
    float_data: -0.4291422665119171
    float_data: 1.20845627784729
    float_data: 1.1157017946243286
    float_data: 0.8408615589141846
    float_data: -0.10288722068071365
    float_data: 1.1469004154205322
    float_data: -0.04970258101820946
    float_data: 0.4666432738304138
    float_data: 1.033686876296997
    float_data: 0.8088443875312805
    float_data: 1.7897546291351318
    float_data: 0.4512840211391449
    float_data: -1.684059977531433
    float_data: -1.160170078277588
    float_data: 1.3501068353652954
    float_data: -0.33128318190574646
    float_data: 0.38653913140296936
    float_data: -0.8514556288719177
    float_data: 1.0008814334869385
    float_data: -0.3848322629928589
    float_data: 1.4581081867218018
    float_data: -0.5322340130805969
    float_data: 1.1181334257125854
    float_data: 0.6743960976600647
    float_data: -0.7223919034004211
    float_data: 1.0989962816238403
    float_data: -0.9016345143318176
    float_data: -0.8224672079086304
    float_data: 0.721711277961731
    float_data: -0.6253420114517212
    float_data: -0.5938430428504944
    float_data: -0.3439007103443146
    float_data: -1.0001691579818726
    float_data: 1.0449943542480469
    float_data: 0.6085147261619568
    float_data: -0.06932869553565979
    float_data: -0.10839206725358963
    float_data: 0.4501555263996124
    float_data: 1.7653350830078125
    float_data: 0.870969831943512
    float_data: -0.5084571242332458
    float_data: 0.7774192094802856
    float_data: -0.11877117305994034
    float_data: -0.19899818301200867
    float_data: 1.8664714097976685
    float_data: -0.41893789172172546
    float_data: -0.47918492555618286
    float_data: -1.9521052837371826
    float_data: -1.4023290872573853
    float_data: 0.4511229395866394
    float_data: -0.6949208974838257
    float_data: 0.5154138207435608
    float_data: -1.1148710250854492
    float_data: -0.767309844493866
    float_data: 0.6745706796646118
    float_data: 1.4608924388885498
    float_data: 0.5924727916717529
    float_data: 1.1978307962417603
    float_data: 1.7045941352844238
    float_data: 1.0400891304016113
    float_data: -0.918440043926239
    float_data: -0.10534471273422241
    float_data: 0.630195677280426
    float_data: -0.41484689712524414
    float_data: 0.45194604992866516
    float_data: -1.5791562795639038
    float_data: -0.8286280035972595
    float_data: 0.5288797616958618
    float_data: -2.237086534500122
    float_data: -1.1077125072479248
    float_data: -0.017718316987156868
    float_data: -1.7193944454193115
    float_data: 0.057120997458696365
    float_data: -0.7995474934577942
    float_data: -0.29159459471702576
    float_data: -0.2589828670024872
    float_data: 0.18929319083690643
    float_data: -0.5637887120246887
    float_data: 0.08968640863895416
    float_data: -0.6011567711830139
    float_data: 0.5560734868049622
    float_data: 1.693809151649475
    float_data: 0.19686977565288544
    float_data: 0.16986925899982452
    float_data: -1.1640080213546753
    float_data: 0.6933662295341492
    float_data: -0.7580673098564148
    float_data: -0.808847188949585
    float_data: 0.5574394464492798
    float_data: 0.1810387372970581
    float_data: 1.1071754693984985
    float_data: 1.442876935005188
    float_data: -0.5396815538406372
    float_data: 0.12837699055671692
    float_data: 1.7604151964187622
    float_data: 0.9665392637252808
    float_data: 0.713049054145813
    float_data: 1.3062061071395874
    float_data: -0.6046029925346375
    float_data: 0.6365833878517151
    float_data: 1.4092533588409424
    float_data: 1.6209123134613037
    float_data: -0.8061848282814026
    float_data: -0.25167420506477356
    float_data: 0.3827151656150818
    float_data: -0.2889973521232605
    float_data: -0.39181622862815857
    float_data: 0.6840013265609741
    float_data: -0.3534099757671356
    float_data: -1.7879128456115723
    float_data: 0.36184731125831604
    float_data: -0.4244927763938904
    float_data: -0.7315309643745422
    float_data: -1.5657382011413574
    float_data: 1.0138224363327026
    float_data: -2.2271125316619873
    float_data: -1.6993335485458374
    float_data: -0.27584606409072876
    float_data: 1.228955626487732
    float_data: 1.3097058534622192
    float_data: -1.1549826860427856
    float_data: -0.1776321977376938
    float_data: -1.5104563236236572
    float_data: 1.011207103729248
    float_data: -1.4765626192092896
    float_data: -0.1431957483291626
    float_data: 1.0329837799072266
    float_data: -0.222414031624794
    float_data: 1.4701603651046753
    float_data: -0.8700082302093506
    float_data: 0.3691904842853546
    float_data: 0.8532822132110596
    float_data: -0.13971173763275146
    float_data: 1.3863142728805542
    float_data: 0.5481295585632324
    float_data: -1.6374496221542358
    float_data: 3.9586026668548584
    float_data: 0.6486436724662781
    float_data: 0.10734329372644424
    float_data: -1.3988127708435059
    float_data: 0.08176781982183456
    float_data: -0.4599428176879883
    float_data: 0.6443536877632141
    float_data: 0.37167030572891235
    float_data: 1.8530094623565674
    float_data: 0.1422513723373413
    float_data: 0.5135054588317871
    float_data: 0.3724568486213684
    float_data: -0.1484898030757904
    float_data: -0.1834001988172531
    float_data: 1.101000189781189
    float_data: 0.7800271511077881
    float_data: -0.6294416189193726
    float_data: -1.1134361028671265
    float_data: -0.06741002202033997
    float_data: 1.1614400148391724
    float_data: -0.027529386803507805
    float_data: 1.7464350461959839
    float_data: -0.775070309638977
    float_data: 0.1416405439376831
    float_data: -2.516303777694702
    float_data: -0.5956678986549377
    float_data: -0.309121310710907
    float_data: 0.5109377503395081
    float_data: 1.7106618881225586
    float_data: 0.034943588078022
    float_data: 1.4539176225662231
    float_data: 0.661681056022644
    float_data: 0.9863522052764893
    float_data: -0.4661548435688019
    float_data: 1.3849912881851196
    float_data: -1.0729643106460571
    float_data: 0.4951586127281189
    float_data: -0.9520621299743652
    float_data: -0.5181455612182617
    float_data: -1.4614036083221436
    float_data: -0.5163478851318359
    float_data: 0.3511168956756592
    float_data: -0.06877046078443527
    float_data: -1.3477649688720703
    float_data: 1.4707398414611816
    float_data: 0.3372209370136261
    float_data: 1.0080654621124268
    float_data: 0.7852269411087036
    float_data: -0.6648677587509155
    float_data: -1.9450469017028809
    float_data: -0.9154243469238281
    float_data: 1.2251558303833008
    float_data: -1.0535460710525513
    float_data: 0.8160436749458313
    float_data: -0.6124069690704346
    float_data: 0.3931092321872711
    float_data: -1.8239198923110962
    float_data: 1.1670751571655273
    float_data: -0.03966870158910751
    float_data: 0.8858258128166199
    float_data: 0.18986165523529053
    float_data: 0.7980638146400452
    float_data: -0.10193204134702682
    float_data: 0.7433565258979797
    float_data: -1.5095726251602173
    float_data: -1.0807106494903564
    float_data: 0.7254739999771118
    float_data: -0.03917825594544411
    float_data: -0.2287541776895523
    float_data: -0.17961229383945465
    float_data: 0.5017251372337341
    float_data: -0.5933437347412109
    float_data: 0.5103076100349426
    float_data: -0.9157918691635132
    float_data: -0.4072520434856415
    float_data: 0.9849516749382019
    float_data: 1.071252465248108
    float_data: -1.0971543788909912
    float_data: 0.838634729385376
    float_data: -1.0391823053359985
    float_data: 0.7330232262611389
    float_data: -1.8988120555877686
    float_data: -1.1171107292175293
    float_data: -0.5089722871780396
    float_data: -0.1664859503507614
    float_data: 1.4236143827438354
    float_data: 0.9039991497993469
    float_data: 1.5754679441452026
    float_data: 1.2066079378128052
    float_data: -0.2828635573387146
    float_data: -0.2663268744945526
    float_data: 1.0689716339111328
    float_data: 0.040371429175138474
    float_data: -0.15699367225170135
    float_data: -1.335202693939209
    float_data: -0.10646012425422668
    float_data: -2.7909963130950928
    float_data: -0.45611754059791565
    float_data: -0.9798902273178101
    float_data: 0.6925743222236633
    float_data: -0.4786723554134369
    float_data: -0.32905155420303345
    float_data: 1.3471055030822754
    float_data: -1.049067735671997
    float_data: 0.3166588842868805
    float_data: -1.8952668905258179
    float_data: 0.08972911536693573
    float_data: 0.4102657437324524
    float_data: 0.859870970249176
    float_data: -0.8986831903457642
    float_data: 0.31965693831443787
    float_data: 0.3181541860103607
    float_data: -0.019231634214520454
    float_data: 0.15001627802848816
    float_data: 0.46353432536125183
    float_data: 0.3978804349899292
    float_data: -0.9960108995437622
    float_data: -1.1958614587783813
    float_data: 2.5059802532196045
    float_data: 1.9197922945022583
    float_data: -1.3916938304901123
    float_data: 0.45021775364875793
    float_data: 0.6274370551109314
    float_data: 0.7513372302055359
    float_data: 0.14039543271064758
    float_data: -0.9268719553947449
    float_data: -0.18242040276527405
    float_data: -0.4911251366138458
    float_data: 0.13437311351299286
    float_data: -0.2683713138103485
    float_data: -0.1316756308078766
    float_data: 1.0185524225234985
    float_data: 1.230558156967163
    float_data: -1.181103229522705
    float_data: -0.45993009209632874
    float_data: -0.7907999753952026
    float_data: 1.223722219467163
    float_data: -0.05936790257692337
    float_data: 1.4489893913269043
    float_data: -0.47758084535598755
    float_data: 0.025999994948506355
    float_data: -1.3486964702606201
    float_data: 1.3025355339050293
    float_data: -0.3626120984554291
    float_data: -1.4851564168930054
    float_data: -0.5924612879753113
    float_data: -2.304908037185669
    float_data: -0.03181717172265053
    float_data: 0.11248774081468582
    float_data: 0.2880781590938568
    float_data: 1.498108148574829
    float_data: -0.3009761571884155
    float_data: 0.8074558973312378
    float_data: 0.3122386932373047
    float_data: -0.19332164525985718
    float_data: -2.0768020153045654
    float_data: 0.9475011825561523
    float_data: -0.5039739608764648
    float_data: 0.01795589178800583
    float_data: -1.2704607248306274
    float_data: 0.2829955220222473
    float_data: 0.10803081840276718
    float_data: 0.029417619109153748
    float_data: -0.13479313254356384
    float_data: 1.0492182970046997
    float_data: 0.9662208557128906
    float_data: 0.725916862487793
    float_data: 3.3210787773132324
    float_data: -0.6002253293991089
    float_data: -0.379517525434494
    float_data: -1.0148036479949951
    float_data: 0.435986191034317
    float_data: -0.6874873638153076
    float_data: -2.69836163520813
    float_data: -1.2133381366729736
    float_data: 0.07225190103054047
    float_data: 1.0097873210906982
    float_data: -1.5569415092468262
    float_data: -0.612442135810852
    float_data: -0.13935180008411407
    float_data: -0.7285374999046326
    float_data: 0.5311638116836548
    float_data: 0.004000842105597258
    float_data: 0.32126590609550476
    float_data: -0.7252148985862732
    float_data: 1.5365363359451294
    float_data: -0.0003750087635125965
    float_data: 1.293549656867981
    float_data: -0.43899765610694885
    float_data: 0.5900394916534424
    float_data: -0.6793837547302246
    float_data: -0.9509092569351196
    float_data: -0.7043503522872925
    float_data: -0.04586668685078621
    float_data: -0.21873345971107483
    float_data: 1.5392069816589355
    float_data: -1.148704171180725
    float_data: -1.0903383493423462
    float_data: 1.700188159942627
    float_data: 0.6087836623191833
    float_data: -1.881410837173462
    float_data: 0.4972690939903259
    float_data: 0.23733270168304443
    float_data: -2.144443988800049
    float_data: -0.36956241726875305
    float_data: -0.017454952001571655
    float_data: 0.7314025163650513
    float_data: 0.9544956684112549
    float_data: 0.09574677050113678
    float_data: 1.0334508419036865
    float_data: -0.14627327024936676
    float_data: -0.8574967980384827
    float_data: -0.9341818690299988
    float_data: 0.542645275592804
    float_data: -1.9581691026687622
    float_data: 0.6778075695037842
    float_data: -1.1065731048583984
    float_data: -0.3592240810394287
    float_data: 0.5053818821907043
    float_data: 1.2179409265518188
    float_data: -1.940680980682373
    float_data: -0.8061782121658325
    float_data: 0.049061693251132965
    float_data: -0.596086323261261
    float_data: 0.8616231083869934
    float_data: -2.086390495300293
    float_data: 0.3618016541004181
    float_data: 0.42592018842697144
    float_data: 0.04908039793372154
    float_data: 1.1022367477416992
    float_data: -1.229574203491211
    float_data: 1.1086167097091675
    float_data: -0.7029203772544861
    float_data: 0.7255505323410034
    float_data: -0.3242042064666748
    float_data: 0.8143431544303894
    float_data: 0.7804699540138245
    float_data: -1.4640536308288574
    float_data: -0.15449120104312897
    float_data: -0.09243232011795044
    float_data: -0.23787526786327362
    float_data: -0.755662739276886
    float_data: 1.8514379262924194
    float_data: 0.20909667015075684
    float_data: 1.555016040802002
    float_data: -0.5691486597061157
    float_data: -1.06179678440094
    float_data: 0.13224777579307556
    float_data: -0.5632365942001343
    float_data: 2.390146017074585
    float_data: 0.2454228550195694
    float_data: 1.1525990962982178
    float_data: -0.22423577308654785
    float_data: -0.32606130838394165
    float_data: -0.030911417677998543
    float_data: 0.355717271566391
    float_data: 0.8495868444442749
    float_data: -0.12215401232242584
    float_data: -0.6808515787124634
    float_data: -1.0678765773773193
    float_data: -0.07667936384677887
    float_data: 0.5729627013206482
    float_data: 0.4579470753669739
    float_data: -0.017817549407482147
    float_data: -0.600138783454895
    float_data: 0.14676526188850403
    float_data: 0.5718048810958862
    float_data: -0.036817654967308044
    float_data: 0.11236848682165146
    float_data: -0.15050432085990906
    float_data: 0.9154992699623108
    float_data: -0.4382002651691437
    float_data: 0.18553562462329865
    float_data: 0.3944280445575714
    float_data: 0.7255225777626038
    float_data: 1.4958847761154175
    float_data: 0.675453782081604
    float_data: 0.5992132425308228
    float_data: -1.470237135887146
    float_data: 0.6064039468765259
    float_data: 2.293717622756958
    float_data: -0.8300110101699829
    float_data: -1.0195198059082031
    float_data: -0.2146538496017456
    float_data: 1.0212481021881104
    float_data: 0.5247504711151123
    float_data: -0.4771242141723633
    float_data: -0.03599018231034279
    float_data: 1.0370389223098755
    float_data: 0.6726197600364685
    float_data: 2.4288768768310547
    float_data: 1.005686640739441
    float_data: 0.3535672128200531
    float_data: 0.6147263050079346
    float_data: -0.3489841818809509
    float_data: -0.9777730107307434
    float_data: 0.1719571352005005
    float_data: 0.49056103825569153
    float_data: -1.3952829837799072
    float_data: -0.5223564505577087
    float_data: -0.3692559003829956
    float_data: 0.2656424045562744
    float_data: -0.260466068983078
    float_data: 0.4450967013835907
    float_data: 0.09811224788427353
    float_data: 1.0603275299072266
    float_data: -1.7111676931381226
    float_data: 1.657124638557434
    float_data: 1.4176740646362305
    float_data: 0.05031708627939224
    float_data: 0.650323212146759
    float_data: 0.6065484285354614
    float_data: -0.7372896075248718
    float_data: 0.1646650731563568
    float_data: 0.7781741619110107
    float_data: 0.30981674790382385
    float_data: 1.0513207912445068
    float_data: 0.09499610960483551
    float_data: 0.08075098693370819
    float_data: -0.7678037285804749
    float_data: -0.3645380437374115
    float_data: -0.45971769094467163
    float_data: 1.7054835557937622
    float_data: 0.24050554633140564
    float_data: -0.9994264841079712
    float_data: 0.39859840273857117
    float_data: -0.19200369715690613
    float_data: -3.0537643432617188
    float_data: 0.4798523783683777
    float_data: -1.5526987314224243
    float_data: 0.5784644484519958
    float_data: -0.9612635970115662
    float_data: -1.4583244323730469
    float_data: 0.494341641664505
    float_data: -1.4941937923431396
    float_data: -0.44669920206069946
    float_data: 0.20437739789485931
    float_data: 0.612232506275177
    float_data: 0.7448845505714417
    float_data: -0.0362812876701355
    float_data: -0.8323953747749329
    float_data: 1.923815369606018
    float_data: -0.6059813499450684
    float_data: 1.8035889863967896
    float_data: -0.45252496004104614
    float_data: 1.161285638809204
    float_data: 1.0699654817581177
    float_data: -1.0455342531204224
    float_data: 0.35528451204299927
    float_data: 0.7553920149803162
    float_data: 0.7009820938110352
    float_data: -0.19893744587898254
    float_data: 0.3019600510597229
    float_data: -0.394689679145813
    float_data: -1.1718133687973022
    float_data: 0.984012246131897
    float_data: -0.5596814155578613
    float_data: 1.3797582387924194
    float_data: 0.6024509072303772
    float_data: -0.8926466703414917
    float_data: -0.16119831800460815
    float_data: -0.2863849103450775
    float_data: -0.8708876371383667
    float_data: 0.5014296174049377
    float_data: -0.47861406207084656
    float_data: 1.6316914558410645
    float_data: 0.8608912229537964
    float_data: -0.880189061164856
    float_data: -0.019000520929694176
    float_data: -0.22676019370555878
    float_data: -1.5645078420639038
    float_data: 0.9312556982040405
    float_data: 0.9498088359832764
    float_data: 0.9255012273788452
    float_data: -0.4569878578186035
    float_data: 1.068985939025879
    float_data: -0.20975293219089508
    float_data: 0.935147762298584
    float_data: 1.8125277757644653
    float_data: 0.14010988175868988
    float_data: -1.4191488027572632
    float_data: -0.31690120697021484
    float_data: 0.6409858465194702
    float_data: 1.219874382019043
    float_data: -1.1337920427322388
    float_data: -0.19054830074310303
    float_data: 0.2333391308784485
    float_data: 0.4349983334541321
    float_data: 0.9104235768318176
    float_data: -0.9484396576881409
    float_data: -0.42347830533981323
    float_data: 1.0079665184020996
    float_data: 0.392334908246994
    float_data: 0.44838064908981323
    float_data: 1.1253235340118408
    name: "input"
  }
  initializer {
    dims: 2
    dims: 513
    data_type: 1
    float_data: 228.12217712402344
    float_data: 98.74253845214844
    float_data: 43.9660758972168
    float_data: 131.36288452148438
    float_data: 123.28512573242188
    float_data: 66.76091766357422
    float_data: 83.51780700683594
    float_data: 256.563232421875
    float_data: 389.5627746582031
    float_data: 233.09637451171875
    float_data: 46.915916442871094
    float_data: 22.182668685913086
    float_data: 53.282527923583984
    float_data: 80.7946548461914
    float_data: 75.9373550415039
    float_data: 105.70638275146484
    float_data: 158.71401977539062
    float_data: 120.67053985595703
    float_data: 123.67533111572266
    float_data: 240.12034606933594
    float_data: 413.99432373046875
    float_data: 378.8135986328125
    float_data: 134.98756408691406
    float_data: 391.6688232421875
    float_data: 829.0283203125
    float_data: 476.7172546386719
    float_data: 31.41482925415039
    float_data: 47.71803665161133
    float_data: 93.85150146484375
    float_data: 43.901710510253906
    float_data: 112.205810546875
    float_data: 118.55303955078125
    float_data: 82.35372924804688
    float_data: 308.5594787597656
    float_data: 498.3323059082031
    float_data: 404.61065673828125
    float_data: 163.5823211669922
    float_data: 65.3780288696289
    float_data: 337.9584655761719
    float_data: 664.321044921875
    float_data: 574.3831176757812
    float_data: 265.3609313964844
    float_data: 83.3087387084961
    float_data: 0.44479605555534363
    float_data: 174.7661590576172
    float_data: 639.4141235351562
    float_data: 662.5100708007812
    float_data: 216.06398010253906
    float_data: 27.876285552978516
    float_data: 42.07247543334961
    float_data: 302.295654296875
    float_data: 627.1822509765625
    float_data: 737.6956787109375
    float_data: 697.14306640625
    float_data: 306.76177978515625
    float_data: 4.936967372894287
    float_data: 97.6834487915039
    float_data: 225.42800903320312
    float_data: 341.9017639160156
    float_data: 371.8906555175781
    float_data: 261.89056396484375
    float_data: 165.277099609375
    float_data: 155.17164611816406
    float_data: 281.9003601074219
    float_data: 616.0946655273438
    float_data: 858.8711547851562
    float_data: 653.3173828125
    float_data: 330.6766662597656
    float_data: 217.00653076171875
    float_data: 206.5823211669922
    float_data: 181.348388671875
    float_data: 185.349365234375
    float_data: 273.4098815917969
    float_data: 352.19378662109375
    float_data: 340.5096130371094
    float_data: 246.72320556640625
    float_data: 113.5112533569336
    float_data: 13.054924964904785
    float_data: 28.713830947875977
    float_data: 153.71527099609375
    float_data: 275.6476745605469
    float_data: 221.55262756347656
    float_data: 69.02622985839844
    float_data: 21.14299964904785
    float_data: 152.11036682128906
    float_data: 408.83740234375
    float_data: 540.620849609375
    float_data: 452.5021057128906
    float_data: 244.62440490722656
    float_data: 65.21076965332031
    float_data: 7.030208587646484
    float_data: 107.57604217529297
    float_data: 412.63299560546875
    float_data: 591.8163452148438
    float_data: 293.312255859375
    float_data: 27.784076690673828
    float_data: 2.710466146469116
    float_data: 6.033628463745117
    float_data: 0.766595184803009
    float_data: 1.1432546377182007
    float_data: 32.993202209472656
    float_data: 166.45950317382812
    float_data: 336.29608154296875
    float_data: 423.6654968261719
    float_data: 348.9083557128906
    float_data: 195.43553161621094
    float_data: 358.5988464355469
    float_data: 701.6820068359375
    float_data: 728.436279296875
    float_data: 496.0850830078125
    float_data: 139.49366760253906
    float_data: 14.932474136352539
    float_data: 232.1593017578125
    float_data: 153.1789093017578
    float_data: 8.17006778717041
    float_data: 279.74163818359375
    float_data: 448.0658874511719
    float_data: 439.5281066894531
    float_data: 477.130859375
    float_data: 517.884765625
    float_data: 482.0737609863281
    float_data: 413.1641540527344
    float_data: 297.9853210449219
    float_data: 178.26258850097656
    float_data: 133.04351806640625
    float_data: 134.39015197753906
    float_data: 133.78756713867188
    float_data: 144.43675231933594
    float_data: 238.07196044921875
    float_data: 337.8219909667969
    float_data: 238.78213500976562
    float_data: 143.42958068847656
    float_data: 289.6211853027344
    float_data: 395.28106689453125
    float_data: 186.20858764648438
    float_data: 22.889732360839844
    float_data: 146.83921813964844
    float_data: 236.75393676757812
    float_data: 292.3660583496094
    float_data: 389.3636779785156
    float_data: 445.03509521484375
    float_data: 360.1713562011719
    float_data: 182.66615295410156
    float_data: 63.542476654052734
    float_data: 74.43680572509766
    float_data: 131.496337890625
    float_data: 225.74607849121094
    float_data: 424.2431945800781
    float_data: 558.9996948242188
    float_data: 441.3138122558594
    float_data: 192.72988891601562
    float_data: 39.96232223510742
    float_data: 50.794803619384766
    float_data: 249.43785095214844
    float_data: 475.124755859375
    float_data: 408.4870300292969
    float_data: 156.56838989257812
    float_data: 8.056432723999023
    float_data: 28.754838943481445
    float_data: 97.70096588134766
    float_data: 199.69625854492188
    float_data: 406.694091796875
    float_data: 781.356689453125
    float_data: 942.9173583984375
    float_data: 424.2950744628906
    float_data: 7.987887382507324
    float_data: 245.92356872558594
    float_data: 265.8584289550781
    float_data: 42.70096969604492
    float_data: 8.624307632446289
    float_data: 25.313655853271484
    float_data: 50.48338317871094
    float_data: 147.01055908203125
    float_data: 153.13697814941406
    float_data: 71.19857025146484
    float_data: 180.55325317382812
    float_data: 450.3936462402344
    float_data: 496.7793273925781
    float_data: 675.53271484375
    float_data: 926.1714477539062
    float_data: 556.3390502929688
    float_data: 165.72586059570312
    float_data: 92.067138671875
    float_data: 57.23976516723633
    float_data: 4.901918888092041
    float_data: 54.476768493652344
    float_data: 213.77830505371094
    float_data: 167.5142059326172
    float_data: 15.570980072021484
    float_data: 83.34889221191406
    float_data: 327.8160400390625
    float_data: 402.3284606933594
    float_data: 268.04925537109375
    float_data: 150.41943359375
    float_data: 103.29478454589844
    float_data: 73.35572814941406
    float_data: 97.85369873046875
    float_data: 167.63259887695312
    float_data: 157.7257537841797
    float_data: 245.5872802734375
    float_data: 580.4822387695312
    float_data: 763.4104614257812
    float_data: 494.11993408203125
    float_data: 182.61732482910156
    float_data: 82.89795684814453
    float_data: 6.7782135009765625
    float_data: 134.00038146972656
    float_data: 596.63720703125
    float_data: 869.5111083984375
    float_data: 599.8818969726562
    float_data: 199.43603515625
    float_data: 39.532413482666016
    float_data: 109.29383850097656
    float_data: 155.14288330078125
    float_data: 104.18006896972656
    float_data: 121.71762084960938
    float_data: 81.47053527832031
    float_data: 161.5874481201172
    float_data: 439.9573059082031
    float_data: 632.6967163085938
    float_data: 872.4172973632812
    float_data: 956.202880859375
    float_data: 562.015625
    float_data: 144.8708038330078
    float_data: 18.526960372924805
    float_data: 186.12600708007812
    float_data: 362.4660949707031
    float_data: 127.59780883789062
    float_data: 92.00678253173828
    float_data: 400.71356201171875
    float_data: 388.3240966796875
    float_data: 140.88035583496094
    float_data: 40.40855407714844
    float_data: 75.61663055419922
    float_data: 165.1356201171875
    float_data: 288.9697265625
    float_data: 282.8144836425781
    float_data: 187.228271484375
    float_data: 129.34451293945312
    float_data: 127.55338287353516
    float_data: 143.11734008789062
    float_data: 114.60187530517578
    float_data: 24.829439163208008
    float_data: 38.48536682128906
    float_data: 130.3576202392578
    float_data: 180.9893035888672
    float_data: 226.839111328125
    float_data: 170.43067932128906
    float_data: 32.8005485534668
    float_data: 80.591064453125
    float_data: 226.7704315185547
    float_data: 171.56561279296875
    float_data: 40.04621887207031
    float_data: 3.1011087894439697
    float_data: 2.770641565322876
    float_data: 8.596858978271484
    float_data: 74.97547912597656
    float_data: 357.1989440917969
    float_data: 529.771240234375
    float_data: 286.7103271484375
    float_data: 96.34632110595703
    float_data: 116.23672485351562
    float_data: 85.62574005126953
    float_data: 79.64370727539062
    float_data: 186.7071533203125
    float_data: 265.500732421875
    float_data: 263.6443176269531
    float_data: 205.1275177001953
    float_data: 67.6155014038086
    float_data: 25.665149688720703
    float_data: 264.46875
    float_data: 512.22265625
    float_data: 427.9509582519531
    float_data: 223.27708435058594
    float_data: 485.627197265625
    float_data: 770.3558349609375
    float_data: 352.42474365234375
    float_data: 10.173479080200195
    float_data: 174.1124725341797
    float_data: 277.0405578613281
    float_data: 282.2008361816406
    float_data: 212.70074462890625
    float_data: 209.07351684570312
    float_data: 245.86224365234375
    float_data: 210.62942504882812
    float_data: 199.3154754638672
    float_data: 180.26502990722656
    float_data: 59.768619537353516
    float_data: 58.109336853027344
    float_data: 136.82980346679688
    float_data: 63.503841400146484
    float_data: 61.22495651245117
    float_data: 70.170166015625
    float_data: 82.88612365722656
    float_data: 209.01834106445312
    float_data: 172.41632080078125
    float_data: 52.26995086669922
    float_data: 16.144882202148438
    float_data: 10.631113052368164
    float_data: 84.71729278564453
    float_data: 149.47283935546875
    float_data: 134.4976806640625
    float_data: 158.64761352539062
    float_data: 327.2347412109375
    float_data: 543.3087768554688
    float_data: 491.9231262207031
    float_data: 292.64776611328125
    float_data: 87.52135467529297
    float_data: 35.56456756591797
    float_data: 407.90911865234375
    float_data: 405.3804931640625
    float_data: 46.597774505615234
    float_data: 58.03566360473633
    float_data: 117.06646728515625
    float_data: 147.73638916015625
    float_data: 165.09890747070312
    float_data: 107.97329711914062
    float_data: 182.51272583007812
    float_data: 607.5589599609375
    float_data: 1079.434326171875
    float_data: 964.6256103515625
    float_data: 429.6517333984375
    float_data: 89.86583709716797
    float_data: 16.69977569580078
    float_data: 49.27396774291992
    float_data: 107.42539978027344
    float_data: 32.82302474975586
    float_data: 125.02877807617188
    float_data: 530.6941528320312
    float_data: 633.1612548828125
    float_data: 323.92266845703125
    float_data: 71.21684265136719
    float_data: 85.79896545410156
    float_data: 169.22866821289062
    float_data: 104.54692077636719
    float_data: 31.23023796081543
    float_data: 68.108154296875
    float_data: 153.19017028808594
    float_data: 175.03363037109375
    float_data: 123.28983306884766
    float_data: 21.435691833496094
    float_data: 40.73525619506836
    float_data: 262.7544860839844
    float_data: 369.1979064941406
    float_data: 167.29188537597656
    float_data: 28.86431121826172
    float_data: 275.48046875
    float_data: 416.7221984863281
    float_data: 228.75277709960938
    float_data: 151.90541076660156
    float_data: 258.3518981933594
    float_data: 353.6648254394531
    float_data: 308.9364318847656
    float_data: 402.2857666015625
    float_data: 685.1155395507812
    float_data: 749.1245727539062
    float_data: 674.37158203125
    float_data: 690.6472778320312
    float_data: 683.1240234375
    float_data: 477.55096435546875
    float_data: 218.49449157714844
    float_data: 95.61853790283203
    float_data: 73.80201721191406
    float_data: 97.92669677734375
    float_data: 143.3872833251953
    float_data: 88.68669128417969
    float_data: 29.40987205505371
    float_data: 240.5066680908203
    float_data: 335.0789489746094
    float_data: 108.99958038330078
    float_data: 220.4580535888672
    float_data: 662.6838989257812
    float_data: 872.3662109375
    float_data: 769.8610229492188
    float_data: 449.16864013671875
    float_data: 139.3592529296875
    float_data: 118.11588287353516
    float_data: 134.83567810058594
    float_data: 26.682737350463867
    float_data: 4.068309307098389
    float_data: 27.678686141967773
    float_data: 58.78117370605469
    float_data: 32.056678771972656
    float_data: 19.452213287353516
    float_data: 101.2599868774414
    float_data: 210.40737915039062
    float_data: 295.67218017578125
    float_data: 192.7914581298828
    float_data: 29.15861701965332
    float_data: 13.302973747253418
    float_data: 47.38011932373047
    float_data: 232.73129272460938
    float_data: 697.5474243164062
    float_data: 802.1223754882812
    float_data: 318.7947082519531
    float_data: 16.134069442749023
    float_data: 278.74285888671875
    float_data: 494.4566345214844
    float_data: 336.0831298828125
    float_data: 358.6041564941406
    float_data: 691.2091674804688
    float_data: 768.1175537109375
    float_data: 541.0699462890625
    float_data: 333.28900146484375
    float_data: 210.05609130859375
    float_data: 142.66346740722656
    float_data: 106.12708282470703
    float_data: 57.82343673706055
    float_data: 18.641372680664062
    float_data: 4.664466381072998
    float_data: 18.333980560302734
    float_data: 32.97307205200195
    float_data: 163.3223876953125
    float_data: 350.1302490234375
    float_data: 333.0862121582031
    float_data: 271.56121826171875
    float_data: 320.11431884765625
    float_data: 413.04681396484375
    float_data: 372.0442199707031
    float_data: 201.66766357421875
    float_data: 100.17244720458984
    float_data: 102.89250183105469
    float_data: 136.4676971435547
    float_data: 175.2777862548828
    float_data: 247.982666015625
    float_data: 154.75563049316406
    float_data: 5.959268093109131
    float_data: 89.51602172851562
    float_data: 177.07456970214844
    float_data: 184.62437438964844
    float_data: 309.1590270996094
    float_data: 524.8485717773438
    float_data: 555.4755249023438
    float_data: 488.2162780761719
    float_data: 457.5521240234375
    float_data: 286.65667724609375
    float_data: 62.70054244995117
    float_data: 104.54173278808594
    float_data: 270.21563720703125
    float_data: 160.6713104248047
    float_data: 21.65363121032715
