ir_version: 5
producer_name: "onnx-audio-spectrogram"
graph {
  node {
    input: "input"
    output: "spectrogram"
    name: "audio_spectrogram"
    op_type: "AudioSpectrogram"
    attribute {
      name: "magnitude_squared"
      i: 1
      type: INT
    }
    attribute {
      name: "stride"
      i: 256
      type: INT
    }
    attribute {
      name: "window_size"
      i: 512
      type: INT
    }
  }
  node {
    input: "spectrogram"
    input: "spectrogram_ref"
    output: "spectrogram_err"
    name: "error"
    op_type: "Sub"
  }
  name: "audio_spectrogram_test"
  initializer {
    dims: 1
    dims: 512
    data_type: 1
    float_data: 1.6243454217910767
    float_data: -0.6117563843727112
    float_data: -0.5281717777252197
    float_data: -1.072968602180481
    float_data: 0.8654076457023621
    float_data: -2.3015387058258057
    float_data: 1.744811773300171
    float_data: -0.7612069249153137
    float_data: 0.31903910636901855
    float_data: -0.24937038123607635
    float_data: 1.4621078968048096
    float_data: -2.060140609741211
    float_data: -0.3224171996116638
    float_data: -0.38405436277389526
    float_data: 1.1337693929672241
    float_data: -1.0998913049697876
    float_data: -0.1724282056093216
    float_data: -0.8778584003448486
    float_data: 0.042213745415210724
    float_data: 0.5828152298927307
    float_data: -1.1006191968917847
    float_data: 1.144723653793335
    float_data: 0.9015907049179077
    float_data: 0.5024943351745605
    float_data: 0.9008559584617615
    float_data: -0.6837278604507446
    float_data: -0.12289022654294968
    float_data: -0.9357694387435913
    float_data: -0.26788806915283203
    float_data: 0.5303554534912109
    float_data: -0.6916607618331909
    float_data: -0.3967535197734833
    float_data: -0.6871727108955383
    float_data: -0.8452056646347046
    float_data: -0.6712461113929749
    float_data: -0.01266459934413433
    float_data: -1.1173104047775269
    float_data: 0.2344156950712204
    float_data: 1.6598021984100342
    float_data: 0.7420441508293152
    float_data: -0.19183555245399475
    float_data: -0.887628972530365
    float_data: -0.7471582889556885
    float_data: 1.6924545764923096
    float_data: 0.050807755440473557
    float_data: -0.6369956731796265
    float_data: 0.19091548025608063
    float_data: 2.100255250930786
    float_data: 0.12015895545482635
    float_data: 0.6172031164169312
    float_data: 0.30017033219337463
    float_data: -0.3522498607635498
    float_data: -1.142518162727356
    float_data: -0.3493427336215973
    float_data: -0.20889423787593842
    float_data: 0.5866231918334961
    float_data: 0.838983416557312
    float_data: 0.9311020970344543
    float_data: 0.2855873107910156
    float_data: 0.8851411938667297
    float_data: -0.7543979287147522
    float_data: 1.2528681755065918
    float_data: 0.5129297971725464
    float_data: -0.2980928421020508
    float_data: 0.4885181486606598
    float_data: -0.07557171583175659
    float_data: 1.1316293478012085
    float_data: 1.5198168754577637
    float_data: 2.185575485229492
    float_data: -1.396496295928955
    float_data: -1.444113850593567
    float_data: -0.5044658780097961
    float_data: 0.1600370705127716
    float_data: 0.8761689066886902
    float_data: 0.31563493609428406
    float_data: -2.0222012996673584
    float_data: -0.30620402097702026
    float_data: 0.8279746174812317
    float_data: 0.23009473085403442
    float_data: 0.7620111703872681
    float_data: -0.22232814133167267
    float_data: -0.20075806975364685
    float_data: 0.18656139075756073
    float_data: 0.4100516438484192
    float_data: 0.19829972088336945
    float_data: 0.11900864541530609
    float_data: -0.6706622838973999
    float_data: 0.3775637745857239
    float_data: 0.12182126939296722
    float_data: 1.129483938217163
    float_data: 1.1989178657531738
    float_data: 0.1851564198732376
    float_data: -0.37528494000434875
    float_data: -0.6387304067611694
    float_data: 0.4234943687915802
    float_data: 0.07734006643295288
    float_data: -0.3438536822795868
    float_data: 0.04359685629606247
    float_data: -0.6200008392333984
    float_data: 0.698032021522522
    float_data: -0.447128564119339
    float_data: 1.2245076894760132
    float_data: 0.40349164605140686
    float_data: 0.5935785174369812
    float_data: -1.094911813735962
    float_data: 0.16938243806362152
    float_data: 0.7405564785003662
    float_data: -0.953700602054596
    float_data: -0.26621851325035095
    float_data: 0.03261454775929451
    float_data: -1.3731173276901245
    float_data: 0.3151593804359436
    float_data: 0.8461606502532959
    float_data: -0.8595159649848938
    float_data: 0.3505459725856781
    float_data: -1.3122833967208862
    float_data: -0.03869551047682762
    float_data: -1.6157723665237427
    float_data: 1.121417760848999
    float_data: 0.40890052914619446
    float_data: -0.02461695671081543
    float_data: -0.775161623954773
    float_data: 1.2737559080123901
    float_data: 1.9671016931533813
    float_data: -1.8579819202423096
    float_data: 1.2361639738082886
    float_data: 1.6276507377624512
    float_data: 0.3380116820335388
    float_data: -1.1992679834365845
    float_data: 0.8633453249931335
    float_data: -0.1809203028678894
    float_data: -0.6039206385612488
    float_data: -1.230058193206787
    float_data: 0.5505374670028687
    float_data: 0.79280686378479
    float_data: -0.6235307455062866
    float_data: 0.5205763578414917
    float_data: -1.1443413496017456
    float_data: 0.801861047744751
    float_data: 0.04656729847192764
    float_data: -0.18656976521015167
    float_data: -0.10174587368965149
    float_data: 0.8688861727714539
    float_data: 0.7504116296768188
    float_data: 0.5294653177261353
    float_data: 0.13770121335983276
    float_data: 0.07782112807035446
    float_data: 0.6183802485466003
    float_data: 0.2324945628643036
    float_data: 0.682551383972168
    float_data: -0.3101167678833008
    float_data: -2.434837818145752
    float_data: 1.0388245582580566
    float_data: 2.1869795322418213
    float_data: 0.44136443734169006
    float_data: -0.10015523433685303
    float_data: -0.13644474744796753
    float_data: -0.11905419081449509
    float_data: 0.01740940846502781
    float_data: -1.1220186948776245
    float_data: -0.5170944333076477
    float_data: -0.997026801109314
    float_data: 0.2487991601228714
    float_data: -0.29664114117622375
    float_data: 0.49521133303642273
    float_data: -0.17470316588878632
    float_data: 0.9863351583480835
    float_data: 0.2135339081287384
    float_data: 2.190699815750122
    float_data: -1.8963608741760254
    float_data: -0.6469166874885559
    float_data: 0.901486873626709
    float_data: 2.5283257961273193
    float_data: -0.24863477051258087
    float_data: 0.043668992817401886
    float_data: -0.2263142466545105
    float_data: 1.3314571380615234
    float_data: -0.28730785846710205
    float_data: 0.6800698637962341
    float_data: -0.31980159878730774
    float_data: -1.2725588083267212
    float_data: 0.3135477304458618
    float_data: 0.5031847953796387
    float_data: 1.293225884437561
    float_data: -0.11044702678918839
    float_data: -0.6173620820045471
    float_data: 0.5627610683441162
    float_data: 0.24073709547519684
    float_data: 0.2806650698184967
    float_data: -0.07311270385980606
    float_data: 1.1603385210037231
    float_data: 0.36949270963668823
    float_data: 1.9046586751937866
    float_data: 1.1110566854476929
    float_data: 0.6590498089790344
    float_data: -1.6274383068084717
    float_data: 0.6023193001747131
    float_data: 0.4202822148799896
    float_data: 0.8109516501426697
    float_data: 1.044442057609558
    float_data: -0.4008781909942627
    float_data: 0.8240056037902832
    float_data: -0.5623054504394531
    float_data: 1.9548780918121338
    float_data: -1.33195161819458
    float_data: -1.7606885433197021
    float_data: -1.6507213115692139
    float_data: -0.8905555605888367
    float_data: -1.1191153526306152
    float_data: 1.9560788869857788
    float_data: -0.32649949193000793
    float_data: -1.342675805091858
    float_data: 1.1143829822540283
    float_data: -0.5865239500999451
    float_data: -1.2368533611297607
    float_data: 0.8758389353752136
    float_data: 0.6233621835708618
    float_data: -0.4349566698074341
    float_data: 1.407539963722229
    float_data: 0.12910157442092896
    float_data: 1.6169495582580566
    float_data: 0.5027408599853516
    float_data: 1.5588055849075317
    float_data: 0.10940269380807877
    float_data: -1.2197444438934326
    float_data: 2.449368715286255
    float_data: -0.5457741618156433
    float_data: -0.19883786141872406
    float_data: -0.7003985047340393
    float_data: -0.20339444279670715
    float_data: 0.24266944825649261
    float_data: 0.2018301784992218
    float_data: 0.6610202789306641
    float_data: 1.7921582460403442
    float_data: -0.12046457082033157
    float_data: -1.2331206798553467
    float_data: -1.182318091392517
    float_data: -0.665754497051239
    float_data: -1.6741957664489746
    float_data: 0.8250298500061035
    float_data: -0.4982135593891144
    float_data: -0.3109849691390991
    float_data: -0.0018914828542619944
    float_data: -1.3966203927993774
    float_data: -0.8613163828849792
    float_data: 0.6747115254402161
    float_data: 0.6185391545295715
    float_data: -0.4431719183921814
    float_data: 1.810534954071045
    float_data: -1.3057268857955933
    float_data: -0.3449872136116028
    float_data: -0.23083974421024323
    float_data: -2.7930850982666016
    float_data: 1.9375288486480713
    float_data: 0.3663320243358612
    float_data: -1.0445894002914429
    float_data: 2.051173448562622
    float_data: 0.5856620073318481
    float_data: 0.429526150226593
    float_data: -0.6069983839988708
    float_data: 0.1062227264046669
    float_data: -1.5256803035736084
    float_data: 0.7950261235237122
    float_data: -0.3744383156299591
    float_data: 0.134048193693161
    float_data: 1.2020548582077026
    float_data: 0.2847481071949005
    float_data: 0.2624674439430237
    float_data: 0.27649930119514465
    float_data: -0.733271598815918
    float_data: 0.8360047340393066
    float_data: 1.5433591604232788
    float_data: 0.7588056325912476
    float_data: 0.8849087953567505
    float_data: -0.8772815465927124
    float_data: -0.86778724193573
    float_data: -1.4408760070800781
    float_data: 1.232253074645996
    float_data: -0.25417986512184143
    float_data: 1.3998439311981201
    float_data: -0.7819116711616516
    float_data: -0.4375089704990387
    float_data: 0.095425084233284
    float_data: 0.9214500784873962
    float_data: 0.06075019761919975
    float_data: 0.2111247479915619
    float_data: 0.01652756705880165
    float_data: 0.1771877259016037
    float_data: -1.1164699792861938
    float_data: 0.08092710375785828
    float_data: -0.18657898902893066
    float_data: -0.05682447925209999
    float_data: 0.49233654141426086
    float_data: -0.680678129196167
    float_data: -0.0845080241560936
    float_data: -0.2973618805408478
    float_data: 0.4173020124435425
    float_data: 0.784770667552948
    float_data: -0.9554252624511719
    float_data: 0.585910439491272
    float_data: 2.0657832622528076
    float_data: -1.4711569547653198
    float_data: -0.8301718831062317
    float_data: -0.8805776238441467
    float_data: -0.2790977358818054
    float_data: 1.6228491067886353
    float_data: 0.013352676294744015
    float_data: -0.6946936249732971
    float_data: 0.6218035221099854
    float_data: -0.5998045206069946
    float_data: 1.1234121322631836
    float_data: 0.3052670359611511
    float_data: 1.3887794017791748
    float_data: -0.6613442301750183
    float_data: 3.0308570861816406
    float_data: 0.8245846033096313
    float_data: 0.6545801758766174
    float_data: -0.05118844658136368
    float_data: -0.7255971431732178
    float_data: -0.8677687048912048
    float_data: -0.13597732782363892
    float_data: -0.7972697615623474
    float_data: 0.28267571330070496
    float_data: -0.8260974287986755
    float_data: 0.6210827231407166
    float_data: 0.9561216831207275
    float_data: -0.705840528011322
    float_data: 1.1926860809326172
    float_data: -0.2379419356584549
    float_data: 1.1552878618240356
    float_data: 0.4381663501262665
    float_data: 1.122328281402588
    float_data: -0.9970197677612305
    float_data: -0.10679398477077484
    float_data: 1.4514292478561401
    float_data: -0.6180368661880493
    float_data: -2.037201166152954
    float_data: -1.9425891637802124
    float_data: -2.5064406394958496
    float_data: -2.114163875579834
    float_data: -0.41163915395736694
    float_data: 1.278528094291687
    float_data: -0.4422292709350586
    float_data: 0.32352736592292786
    float_data: -0.10999149084091187
    float_data: 0.008548945188522339
    float_data: -0.1681988388299942
    float_data: -0.17418034374713898
    float_data: 0.46116408705711365
    float_data: -1.1759827136993408
    float_data: 1.0101271867752075
    float_data: 0.9200179576873779
    float_data: -0.19505734741687775
    float_data: 0.805393397808075
    float_data: -0.7013444304466248
    float_data: -0.5372230410575867
    float_data: 0.15626384317874908
    float_data: -0.19022102653980255
    float_data: -0.4487380385398865
    float_data: -0.6724480390548706
    float_data: -0.5574946999549866
    float_data: 0.9391687512397766
    float_data: -1.9433233737945557
    float_data: 0.35249435901641846
    float_data: -0.23643694818019867
    float_data: 0.7278134822845459
    float_data: 0.5150735974311829
    float_data: -2.78253436088562
    float_data: 0.5846465826034546
    float_data: 0.3242742419242859
    float_data: 0.021862836554646492
    float_data: -0.46867382526397705
    float_data: 0.8532811999320984
    float_data: -0.4130293130874634
    float_data: 1.8347176313400269
    float_data: 0.5643828511238098
    float_data: 2.1378281116485596
    float_data: -0.7855340242385864
    float_data: -1.7559256553649902
    float_data: 0.7147895693778992
    float_data: 0.8527040481567383
    float_data: 0.035360097885131836
    float_data: -1.5387932062149048
    float_data: -0.44789519906044006
    float_data: 0.6179855465888977
    float_data: -0.18417632579803467
    float_data: -0.11598518490791321
    float_data: -0.17545896768569946
    float_data: -0.9339146614074707
    float_data: -0.5330203175544739
    float_data: -1.4265553951263428
    float_data: 1.7679599523544312
    float_data: -0.47537288069725037
    float_data: 0.47761017084121704
    float_data: -1.0218859910964966
    float_data: 0.7945282459259033
    float_data: -1.8731609582901
    float_data: 0.9206151366233826
    float_data: -0.035367924720048904
    float_data: 2.110605001449585
    float_data: -1.3065340518951416
    float_data: 0.07638048380613327
    float_data: 0.3672318160533905
    float_data: 1.2328991889953613
    float_data: -0.4228569567203522
    float_data: 0.08646440505981445
    float_data: -2.1424667835235596
    float_data: -0.8301688432693481
    float_data: 0.45161595940589905
    float_data: 1.1041743755340576
    float_data: -0.28173625469207764
    float_data: 2.0563554763793945
    float_data: 1.7602492570877075
    float_data: -0.060652490705251694
    float_data: -2.4135029315948486
    float_data: -1.7775664329528809
    float_data: -0.7778588533401489
    float_data: 1.1158411502838135
    float_data: 0.3102722764015198
    float_data: -2.094247817993164
    float_data: -0.2287658303976059
    float_data: 1.6133613586425781
    float_data: -0.37480467557907104
    float_data: -0.7499696016311646
    float_data: 2.054624080657959
    float_data: 0.05340953543782234
    float_data: -0.47915709018707275
    float_data: 0.3501671552658081
    float_data: 0.017164725810289383
    float_data: -0.4291422665119171
    float_data: 1.20845627784729
    float_data: 1.1157017946243286
    float_data: 0.8408615589141846
    float_data: -0.10288722068071365
    float_data: 1.1469004154205322
    float_data: -0.04970258101820946
    float_data: 0.4666432738304138
    float_data: 1.033686876296997
    float_data: 0.8088443875312805
    float_data: 1.7897546291351318
    float_data: 0.4512840211391449
    float_data: -1.684059977531433
    float_data: -1.160170078277588
    float_data: 1.3501068353652954
    float_data: -0.33128318190574646
    float_data: 0.38653913140296936
    float_data: -0.8514556288719177
    float_data: 1.0008814334869385
    float_data: -0.3848322629928589
    float_data: 1.4581081867218018
    float_data: -0.5322340130805969
    float_data: 1.1181334257125854
    float_data: 0.6743960976600647
    float_data: -0.7223919034004211
    float_data: 1.0989962816238403
    float_data: -0.9016345143318176
    float_data: -0.8224672079086304
    float_data: 0.721711277961731
    float_data: -0.6253420114517212
    float_data: -0.5938430428504944
    float_data: -0.3439007103443146
    float_data: -1.0001691579818726
    float_data: 1.0449943542480469
    float_data: 0.6085147261619568
    float_data: -0.06932869553565979
    float_data: -0.10839206725358963
    float_data: 0.4501555263996124
    float_data: 1.7653350830078125
    float_data: 0.870969831943512
    float_data: -0.5084571242332458
    float_data: 0.7774192094802856
    float_data: -0.11877117305994034
    float_data: -0.19899818301200867
    float_data: 1.8664714097976685
    float_data: -0.41893789172172546
    float_data: -0.47918492555618286
    float_data: -1.9521052837371826
    float_data: -1.4023290872573853
    float_data: 0.4511229395866394
    float_data: -0.6949208974838257
    float_data: 0.5154138207435608
    float_data: -1.1148710250854492
    float_data: -0.767309844493866
    float_data: 0.6745706796646118
    float_data: 1.4608924388885498
    float_data: 0.5924727916717529
    float_data: 1.1978307962417603
    float_data: 1.7045941352844238
    float_data: 1.0400891304016113
    float_data: -0.918440043926239
    float_data: -0.10534471273422241
    float_data: 0.630195677280426
    float_data: -0.41484689712524414
    float_data: 0.45194604992866516
    float_data: -1.5791562795639038
    float_data: -0.8286280035972595
    float_data: 0.5288797616958618
    float_data: -2.237086534500122
    float_data: -1.1077125072479248
    float_data: -0.017718316987156868
    float_data: -1.7193944454193115
    float_data: 0.057120997458696365
    float_data: -0.7995474934577942
    float_data: -0.29159459471702576
    float_data: -0.2589828670024872
    float_data: 0.18929319083690643
    float_data: -0.5637887120246887
    float_data: 0.08968640863895416
    float_data: -0.6011567711830139
    float_data: 0.5560734868049622
    float_data: 1.693809151649475
    float_data: 0.19686977565288544
    name: "input"
  }
  initializer {
    dims: 1
    dims: 257
    data_type: 1
    float_data: 216.9405517578125
    float_data: 150.92893981933594
    float_data: 68.08991241455078
    float_data: 17.004974365234375
    float_data: 229.1488494873047
    float_data: 122.7855453491211
    float_data: 26.673877716064453
    float_data: 3.887535333633423
    float_data: 77.4755630493164
    float_data: 93.26400756835938
    float_data: 163.00900268554688
    float_data: 416.36285400390625
    float_data: 500.6540832519531
    float_data: 142.0408172607422
    float_data: 71.36026763916016
    float_data: 146.30349731445312
    float_data: 243.25253295898438
    float_data: 264.4737243652344
    float_data: 56.20262908935547
    float_data: 199.9287567138672
    float_data: 609.3236083984375
    float_data: 127.78565216064453
    float_data: 232.6325225830078
    float_data: 392.739013671875
    float_data: 34.332618713378906
    float_data: 231.28384399414062
    float_data: 181.44161987304688
    float_data: 228.1024169921875
    float_data: 65.17854309082031
    float_data: 67.26629638671875
    float_data: 107.43711853027344
    float_data: 187.52685546875
    float_data: 519.1817016601562
    float_data: 332.35357666015625
    float_data: 102.46783447265625
    float_data: 233.64181518554688
    float_data: 228.6509246826172
    float_data: 180.51254272460938
    float_data: 102.75252532958984
    float_data: 75.13753509521484
    float_data: 165.08456420898438
    float_data: 32.927642822265625
    float_data: 81.80889892578125
    float_data: 355.4009094238281
    float_data: 217.0304718017578
    float_data: 69.43521881103516
    float_data: 431.5605163574219
    float_data: 303.6896057128906
    float_data: 3.982919454574585
    float_data: 3.4906725883483887
    float_data: 44.92619323730469
    float_data: 240.88865661621094
    float_data: 147.5855255126953
    float_data: 139.01431274414062
    float_data: 648.5787963867188
    float_data: 215.00132751464844
    float_data: 137.98533630371094
    float_data: 119.65279388427734
    float_data: 321.7087097167969
    float_data: 267.0819396972656
    float_data: 227.19696044921875
    float_data: 296.5286560058594
    float_data: 208.40243530273438
    float_data: 206.06251525878906
    float_data: 331.5135803222656
    float_data: 328.91107177734375
    float_data: 275.90142822265625
    float_data: 210.3733673095703
    float_data: 191.2421417236328
    float_data: 284.7600402832031
    float_data: 322.2375793457031
    float_data: 244.47817993164062
    float_data: 92.14523315429688
    float_data: 62.36587142944336
    float_data: 235.27830505371094
    float_data: 84.77204895019531
    float_data: 31.27320098876953
    float_data: 241.11492919921875
    float_data: 152.12937927246094
    float_data: 23.308231353759766
    float_data: 136.8359375
    float_data: 510.24554443359375
    float_data: 412.5824279785156
    float_data: 194.96060180664062
    float_data: 92.21240234375
    float_data: 40.27096939086914
    float_data: 158.60015869140625
    float_data: 2.453888416290283
    float_data: 177.09532165527344
    float_data: 199.0953369140625
    float_data: 601.6641235351562
    float_data: 109.93153381347656
    float_data: 28.36252784729004
    float_data: 169.15786743164062
    float_data: 32.045753479003906
    float_data: 282.84771728515625
    float_data: 304.3147888183594
    float_data: 161.78359985351562
    float_data: 160.32484436035156
    float_data: 14.91842269897461
    float_data: 228.71060180664062
    float_data: 529.718505859375
    float_data: 144.5240936279297
    float_data: 268.4670715332031
    float_data: 721.0082397460938
    float_data: 152.4595947265625
    float_data: 62.319801330566406
    float_data: 221.52392578125
    float_data: 223.266845703125
    float_data: 209.67991638183594
    float_data: 223.490966796875
    float_data: 375.0740661621094
    float_data: 14.122733116149902
    float_data: 157.51075744628906
    float_data: 71.7162094116211
    float_data: 185.41641235351562
    float_data: 7.289463520050049
    float_data: 29.128925323486328
    float_data: 103.06844329833984
    float_data: 92.98191833496094
    float_data: 69.7093505859375
    float_data: 79.24146270751953
    float_data: 80.38925170898438
    float_data: 132.8865509033203
    float_data: 143.84259033203125
    float_data: 185.76287841796875
    float_data: 57.44217300415039
    float_data: 0.3951222002506256
    float_data: 64.85957336425781
    float_data: 262.3708190917969
    float_data: 4.692627429962158
    float_data: 12.739707946777344
    float_data: 143.30467224121094
    float_data: 357.8536376953125
    float_data: 59.54217529296875
    float_data: 259.1596374511719
    float_data: 190.64942932128906
    float_data: 138.36195373535156
    float_data: 241.8423614501953
    float_data: 133.95899963378906
    float_data: 200.9916534423828
    float_data: 34.10988235473633
    float_data: 113.39234924316406
    float_data: 186.01644897460938
    float_data: 132.219482421875
    float_data: 143.1027069091797
    float_data: 17.11060905456543
    float_data: 127.22785949707031
    float_data: 123.45588684082031
    float_data: 48.1810417175293
    float_data: 136.65902709960938
    float_data: 157.34730529785156
    float_data: 540.5284423828125
    float_data: 357.491455078125
    float_data: 114.96788787841797
    float_data: 204.5527801513672
    float_data: 32.0096321105957
    float_data: 27.087480545043945
    float_data: 11.923590660095215
    float_data: 377.7068176269531
    float_data: 679.4248657226562
    float_data: 196.44912719726562
    float_data: 82.84346771240234
    float_data: 133.92137145996094
    float_data: 375.1866149902344
    float_data: 144.0300750732422
    float_data: 16.902271270751953
    float_data: 49.74052810668945
    float_data: 30.098949432373047
    float_data: 60.87722396850586
    float_data: 59.165283203125
    float_data: 154.15280151367188
    float_data: 216.61105346679688
    float_data: 308.0362243652344
    float_data: 367.56268310546875
    float_data: 241.995849609375
    float_data: 503.8575134277344
    float_data: 739.2466430664062
    float_data: 656.70458984375
    float_data: 535.3212890625
    float_data: 256.59228515625
    float_data: 121.01737976074219
    float_data: 128.25360107421875
    float_data: 162.23789978027344
    float_data: 277.9340515136719
    float_data: 408.25018310546875
    float_data: 524.0986328125
    float_data: 516.6817626953125
    float_data: 224.50808715820312
    float_data: 54.670772552490234
    float_data: 43.430747985839844
    float_data: 63.921241760253906
    float_data: 43.9678840637207
    float_data: 77.98683166503906
    float_data: 65.81015014648438
    float_data: 12.936454772949219
    float_data: 350.5655822753906
    float_data: 246.66189575195312
    float_data: 162.1449432373047
    float_data: 488.70751953125
    float_data: 480.81512451171875
    float_data: 184.67408752441406
    float_data: 61.82373809814453
    float_data: 25.593647003173828
    float_data: 14.421189308166504
    float_data: 31.787473678588867
    float_data: 226.05235290527344
    float_data: 353.261962890625
    float_data: 220.60336303710938
    float_data: 234.1128387451172
    float_data: 62.68830490112305
    float_data: 169.721923828125
    float_data: 225.36651611328125
    float_data: 40.2728157043457
    float_data: 139.328369140625
    float_data: 327.7012939453125
    float_data: 608.7570190429688
    float_data: 386.90020751953125
    float_data: 198.34368896484375
    float_data: 216.4627227783203
    float_data: 95.61553955078125
    float_data: 26.7247371673584
    float_data: 20.664024353027344
    float_data: 86.70184326171875
    float_data: 59.45317077636719
    float_data: 18.30875587463379
    float_data: 78.87641143798828
    float_data: 258.6450500488281
    float_data: 146.5713653564453
    float_data: 34.87805938720703
    float_data: 272.0374450683594
    float_data: 92.52733612060547
    float_data: 85.82618713378906
    float_data: 74.04532623291016
    float_data: 184.05239868164062
    float_data: 701.5420532226562
    float_data: 788.626708984375
    float_data: 208.558349609375
    float_data: 119.39005279541016
    float_data: 309.4764709472656
    float_data: 110.837158203125
    float_data: 35.16786575317383
    float_data: 75.6294937133789
    float_data: 325.7320556640625
    float_data: 224.17941284179688
    float_data: 197.52281188964844
    float_data: 509.7374267578125
    float_data: 451.81787109375
    float_data: 689.88037109375
    float_data: 261.878173828125
    float_data: 88.53608703613281
    float_data: 71.13768768310547
    float_data: 145.6337432861328
    float_data: 371.8714294433594
    float_data: 9.832662582397461
    float_data: 137.4047393798828
    float_data: 0.08179374039173126
    name: "spectrogram_ref"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "spectrogram_ref"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 257
          }
        }
      }
    }
  }
  output {
    name: "spectrogram_err"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 257
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
