ir_version: 4
producer_name: "test4glow"
opset_import { 
  version: 10
}

# ONNX TensorProto.DataType:
#    UNDEFINED = 0;
#    FLOAT = 1;
#    UINT8 = 2;
#    INT8 = 3;
#    UINT16 = 4;
#    INT16 = 5;
#    INT32 = 6;
#    INT64 = 7;
#    STRING = 8;
#    BOOL = 9;
#    FLOAT16 = 10;
#    DOUBLE = 11;
#    UINT32 = 12;
#    UINT64 = 13;
#    COMPLEX64 = 14;
#    COMPLEX128 = 15;

graph {
  name: "test-model"
  node {
    input: "data"
    output: "toBool"
    name: "toBool"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "toBool"
  }
}
