ir_version: 3
producer_name: "onnx-deconv"
graph {
  initializer {
    dims: 2
    data_type: 1
    float_data: [1.1, 2.2]
    name: "B"
  }
  node {
    input: "X"
    input: "W"
    input: "B"
    output: "Y"
    op_type: "ConvTranspose"
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  name: "deconv-model"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}