ir_version: 7
producer_name: "conv_node"
graph {
  node {
    input: "x"
    input: "W"
    output: "result"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 2
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 0
      ints: 1
      ints: 0
      ints: 1
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 2
      ints: 1
      type: INTS
    }
  }
  name: "conv_node"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "result"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
