ir_version: 6
producer_name: "conv1D-onnx-example"
graph {
  node {
    input: "x"
    input: "w"
    output: "y"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      type: INTS
    }
  }
  name: "conv1D-node"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "w"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 11
}
