ir_version: 5
domain: "onnx"
#    UINT8 = 2;
#    INT8 = 3;
#    UINT16 = 4;
#    INT16 = 5;
#    INT32 = 6;
#    INT64 = 7;
#    STRING = 8;
#    BOOL = 9;
#    FLOAT16 = 10;
#    DOUBLE = 11;
#    UINT32 = 12;
#    UINT64 = 13;
#    COMPLEX64 = 14;
#    COMPLEX128 = 15;
graph {
   initializer {
       dims: 1
       data_type: 6
       name: "axis"
       int32_data: 0
   }
  input {
    name: "lengths"
    type {
      tensor_type {
        elem_type: 6
        shape {
         dim {
            dim_value: 10
          }
        }
      }
    }
  }
  input {
    name: "axis"
    type: {
      tensor_type {
        elem_type: 6
        shape {
         dim {
            dim_value: 1
          }
        }
      }
    }
  }
  node {
    input: "lengths"
    input: "axis"
    output: "sum"
    name: "cumsum"
    op_type: "CumSum"
    attribute {
      name: "reverse"
      i: 1
      type: INT
    }
  }
output {
    name: "sum"
    type {
      tensor_type {
        elem_type: 6
        shape {
         dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
