ir_version: 5
domain: "onnx"
# ONNX TensorProto.DataType:
#    UNDEFINED = 0;
#    FLOAT = 1;
#    UINT8 = 2;
#    INT8 = 3;
#    UINT16 = 4;
#    INT16 = 5;
#    INT32 = 6;
#    INT64 = 7;
#    STRING = 8;
#    BOOL = 9;
#    FLOAT16 = 10;
#    DOUBLE = 11;
#    UINT32 = 12;
#    UINT64 = 13;
#    COMPLEX64 = 14;
#    COMPLEX128 = 15;
graph {
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
         dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
         dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
   node {
       input: "X"
       input: "Y"
       output: "Out"
       name: "EqualNode"
       op_type: "CmpEQ"
       domain: ""
   }

output {
    name: "Out"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
