ir_version: 6
producer_name: "Expand-onnx-example"
graph {
  node {
    output: "w"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        int64_data: 3
        int64_data: 4
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "x"
    input: "w"
    output: "y"
    op_type: "Expand"
  }
  name: "Expand-node"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 11
}
