ir_version: 3
producer_name: "FCTransposed"
graph {
  node {
    input: "data"
    input: "W"
    input: "B"
    output: "result"
    name: "FCTransposed"
    op_type: "FCTransposed"
  }
  initializer {
    dims: 3
    dims: 4
    data_type: 1
    float_data: 1.0
    float_data: 4.0
    float_data: 7.0
    float_data: 10.0
    float_data: 2.0
    float_data: 5.0
    float_data: 8.0
    float_data: 11.0
    float_data: 3.0
    float_data: 6.0
    float_data: 9.0
    float_data: 12.0
    name: "W"
  }
  initializer {
    dims: 4
    data_type: 1
    float_data: 0.1
    float_data: 0.2
    float_data: 0.3
    float_data: 0.4
    name: "B"
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "result"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 4
}
