ir_version: 7
producer_name: "onnx-flatten"
graph {
  node {
    input: "data"
    output: "output"
    op_type: "Flatten"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
  }
  name: "flatten_graph"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 24
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 12
}

