ir_version: 5
producer_name: "onnx-flip"
graph {
  node {
    input: "X"
    output: "Y"
    name: "flip"
    op_type: "Flip"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Y"
    input: "Y_ref"
    output: "Y_err"
    name: "error"
    op_type: "Sub"
  }
  name: "flip_test"
  initializer {
    dims: 2
    dims: 3
    dims: 4
    data_type: 1
    float_data: 1.0
    float_data: 2.0
    float_data: 3.0
    float_data: 4.0
    float_data: 5.0
    float_data: 6.0
    float_data: 7.0
    float_data: 8.0
    float_data: 9.0
    float_data: 10.0
    float_data: 11.0
    float_data: 12.0
    float_data: 13.0
    float_data: 14.0
    float_data: 15.0
    float_data: 16.0
    float_data: 17.0
    float_data: 18.0
    float_data: 19.0
    float_data: 20.0
    float_data: 21.0
    float_data: 22.0
    float_data: 23.0
    float_data: 24.0
    name: "X"
  }
  initializer {
    dims: 2
    dims: 3
    dims: 4
    data_type: 1
    float_data: 9.0
    float_data: 10.0
    float_data: 11.0
    float_data: 12.0
    float_data: 5.0
    float_data: 6.0
    float_data: 7.0
    float_data: 8.0
    float_data: 1.0
    float_data: 2.0
    float_data: 3.0
    float_data: 4.0
    float_data: 21.0
    float_data: 22.0
    float_data: 23.0
    float_data: 24.0
    float_data: 17.0
    float_data: 18.0
    float_data: 19.0
    float_data: 20.0
    float_data: 13.0
    float_data: 14.0
    float_data: 15.0
    float_data: 16.0
    name: "Y_ref"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }

  input {
    name: "Y_ref"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y_err"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
