ir_version: 3
producer_name: "glow-test"
graph {
  node {
    input: "x"
    output: "y"
    name: "LeakyRelu"
    op_type: "LeakyRelu"
  }
  name: "test_leaky_relu"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
