ir_version: 7
producer_name: "Not_Example"
graph {
  node {
    input: "X"
    output: "Y"
    name: "NotOp"
    op_type: "Not"
  }
  name: "Not operation"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 1
}
