ir_version: 5
producer_name: "onnx-lstm"
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: ""
    input: "initial_h"
    input: "initial_c"
    input: ""
    output: "Y"
    output: "Y_h"
    output: "Y_c"
    name: "lstm"
    op_type: "LSTM"
    attribute {
      name: "direction"
      s: "bidirectional"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 4
      type: INT
    }
    attribute {
      name: "input_forget"
      i: 0
      type: INT
    }
  }
  node {
    input: "Y"
    input: "Y_ref"
    output: "Y_err"
    name: "error"
    op_type: "Sub"
  }
  name: "lstm_test"
  initializer {
    dims: 2
    dims: 5
    dims: 3
    data_type: 1
    float_data: 1.6243454217910767
    float_data: -0.6117563843727112
    float_data: -0.5281717777252197
    float_data: -1.072968602180481
    float_data: 0.8654076457023621
    float_data: -2.3015387058258057
    float_data: 1.744811773300171
    float_data: -0.7612069249153137
    float_data: 0.31903910636901855
    float_data: -0.24937038123607635
    float_data: 1.4621078968048096
    float_data: -2.060140609741211
    float_data: -0.3224171996116638
    float_data: -0.38405436277389526
    float_data: 1.1337693929672241
    float_data: -1.0998913049697876
    float_data: -0.1724282056093216
    float_data: -0.8778584003448486
    float_data: 0.042213745415210724
    float_data: 0.5828152298927307
    float_data: -1.1006191968917847
    float_data: 1.144723653793335
    float_data: 0.9015907049179077
    float_data: 0.5024943351745605
    float_data: 0.9008559584617615
    float_data: -0.6837278604507446
    float_data: -0.12289022654294968
    float_data: -0.9357694387435913
    float_data: -0.26788806915283203
    float_data: 0.5303554534912109
    name: "X"
  }
  initializer {
    dims: 2
    dims: 16
    dims: 3
    data_type: 1
    float_data: -0.6916607618331909
    float_data: -0.3967535197734833
    float_data: -0.6871727108955383
    float_data: -0.8452056646347046
    float_data: -0.6712461113929749
    float_data: -0.01266459934413433
    float_data: -1.1173104047775269
    float_data: 0.2344156950712204
    float_data: 1.6598021984100342
    float_data: 0.7420441508293152
    float_data: -0.19183555245399475
    float_data: -0.887628972530365
    float_data: -0.7471582889556885
    float_data: 1.6924545764923096
    float_data: 0.050807755440473557
    float_data: -0.6369956731796265
    float_data: 0.19091548025608063
    float_data: 2.100255250930786
    float_data: 0.12015895545482635
    float_data: 0.6172031164169312
    float_data: 0.30017033219337463
    float_data: -0.3522498607635498
    float_data: -1.142518162727356
    float_data: -0.3493427336215973
    float_data: -0.20889423787593842
    float_data: 0.5866231918334961
    float_data: 0.838983416557312
    float_data: 0.9311020970344543
    float_data: 0.2855873107910156
    float_data: 0.8851411938667297
    float_data: -0.7543979287147522
    float_data: 1.2528681755065918
    float_data: 0.5129297971725464
    float_data: -0.2980928421020508
    float_data: 0.4885181486606598
    float_data: -0.07557171583175659
    float_data: 1.1316293478012085
    float_data: 1.5198168754577637
    float_data: 2.185575485229492
    float_data: -1.396496295928955
    float_data: -1.444113850593567
    float_data: -0.5044658780097961
    float_data: 0.1600370705127716
    float_data: 0.8761689066886902
    float_data: 0.31563493609428406
    float_data: -2.0222012996673584
    float_data: -0.30620402097702026
    float_data: 0.8279746174812317
    float_data: 0.23009473085403442
    float_data: 0.7620111703872681
    float_data: -0.22232814133167267
    float_data: -0.20075806975364685
    float_data: 0.18656139075756073
    float_data: 0.4100516438484192
    float_data: 0.19829972088336945
    float_data: 0.11900864541530609
    float_data: -0.6706622838973999
    float_data: 0.3775637745857239
    float_data: 0.12182126939296722
    float_data: 1.129483938217163
    float_data: 1.1989178657531738
    float_data: 0.1851564198732376
    float_data: -0.37528494000434875
    float_data: -0.6387304067611694
    float_data: 0.4234943687915802
    float_data: 0.07734006643295288
    float_data: -0.3438536822795868
    float_data: 0.04359685629606247
    float_data: -0.6200008392333984
    float_data: 0.698032021522522
    float_data: -0.447128564119339
    float_data: 1.2245076894760132
    float_data: 0.40349164605140686
    float_data: 0.5935785174369812
    float_data: -1.094911813735962
    float_data: 0.16938243806362152
    float_data: 0.7405564785003662
    float_data: -0.953700602054596
    float_data: -0.26621851325035095
    float_data: 0.03261454775929451
    float_data: -1.3731173276901245
    float_data: 0.3151593804359436
    float_data: 0.8461606502532959
    float_data: -0.8595159649848938
    float_data: 0.3505459725856781
    float_data: -1.3122833967208862
    float_data: -0.03869551047682762
    float_data: -1.6157723665237427
    float_data: 1.121417760848999
    float_data: 0.40890052914619446
    float_data: -0.02461695671081543
    float_data: -0.775161623954773
    float_data: 1.2737559080123901
    float_data: 1.9671016931533813
    float_data: -1.8579819202423096
    float_data: 1.2361639738082886
    name: "W"
  }
  initializer {
    dims: 2
    dims: 16
    dims: 4
    data_type: 1
    float_data: 1.6276507377624512
    float_data: 0.3380116820335388
    float_data: -1.1992679834365845
    float_data: 0.8633453249931335
    float_data: -0.1809203028678894
    float_data: -0.6039206385612488
    float_data: -1.230058193206787
    float_data: 0.5505374670028687
    float_data: 0.79280686378479
    float_data: -0.6235307455062866
    float_data: 0.5205763578414917
    float_data: -1.1443413496017456
    float_data: 0.801861047744751
    float_data: 0.04656729847192764
    float_data: -0.18656976521015167
    float_data: -0.10174587368965149
    float_data: 0.8688861727714539
    float_data: 0.7504116296768188
    float_data: 0.5294653177261353
    float_data: 0.13770121335983276
    float_data: 0.07782112807035446
    float_data: 0.6183802485466003
    float_data: 0.2324945628643036
    float_data: 0.682551383972168
    float_data: -0.3101167678833008
    float_data: -2.434837818145752
    float_data: 1.0388245582580566
    float_data: 2.1869795322418213
    float_data: 0.44136443734169006
    float_data: -0.10015523433685303
    float_data: -0.13644474744796753
    float_data: -0.11905419081449509
    float_data: 0.01740940846502781
    float_data: -1.1220186948776245
    float_data: -0.5170944333076477
    float_data: -0.997026801109314
    float_data: 0.2487991601228714
    float_data: -0.29664114117622375
    float_data: 0.49521133303642273
    float_data: -0.17470316588878632
    float_data: 0.9863351583480835
    float_data: 0.2135339081287384
    float_data: 2.190699815750122
    float_data: -1.8963608741760254
    float_data: -0.6469166874885559
    float_data: 0.901486873626709
    float_data: 2.5283257961273193
    float_data: -0.24863477051258087
    float_data: 0.043668992817401886
    float_data: -0.2263142466545105
    float_data: 1.3314571380615234
    float_data: -0.28730785846710205
    float_data: 0.6800698637962341
    float_data: -0.31980159878730774
    float_data: -1.2725588083267212
    float_data: 0.3135477304458618
    float_data: 0.5031847953796387
    float_data: 1.293225884437561
    float_data: -0.11044702678918839
    float_data: -0.6173620820045471
    float_data: 0.5627610683441162
    float_data: 0.24073709547519684
    float_data: 0.2806650698184967
    float_data: -0.07311270385980606
    float_data: 1.1603385210037231
    float_data: 0.36949270963668823
    float_data: 1.9046586751937866
    float_data: 1.1110566854476929
    float_data: 0.6590498089790344
    float_data: -1.6274383068084717
    float_data: 0.6023193001747131
    float_data: 0.4202822148799896
    float_data: 0.8109516501426697
    float_data: 1.044442057609558
    float_data: -0.4008781909942627
    float_data: 0.8240056037902832
    float_data: -0.5623054504394531
    float_data: 1.9548780918121338
    float_data: -1.33195161819458
    float_data: -1.7606885433197021
    float_data: -1.6507213115692139
    float_data: -0.8905555605888367
    float_data: -1.1191153526306152
    float_data: 1.9560788869857788
    float_data: -0.32649949193000793
    float_data: -1.342675805091858
    float_data: 1.1143829822540283
    float_data: -0.5865239500999451
    float_data: -1.2368533611297607
    float_data: 0.8758389353752136
    float_data: 0.6233621835708618
    float_data: -0.4349566698074341
    float_data: 1.407539963722229
    float_data: 0.12910157442092896
    float_data: 1.6169495582580566
    float_data: 0.5027408599853516
    float_data: 1.5588055849075317
    float_data: 0.10940269380807877
    float_data: -1.2197444438934326
    float_data: 2.449368715286255
    float_data: -0.5457741618156433
    float_data: -0.19883786141872406
    float_data: -0.7003985047340393
    float_data: -0.20339444279670715
    float_data: 0.24266944825649261
    float_data: 0.2018301784992218
    float_data: 0.6610202789306641
    float_data: 1.7921582460403442
    float_data: -0.12046457082033157
    float_data: -1.2331206798553467
    float_data: -1.182318091392517
    float_data: -0.665754497051239
    float_data: -1.6741957664489746
    float_data: 0.8250298500061035
    float_data: -0.4982135593891144
    float_data: -0.3109849691390991
    float_data: -0.0018914828542619944
    float_data: -1.3966203927993774
    float_data: -0.8613163828849792
    float_data: 0.6747115254402161
    float_data: 0.6185391545295715
    float_data: -0.4431719183921814
    float_data: 1.810534954071045
    float_data: -1.3057268857955933
    float_data: -0.3449872136116028
    float_data: -0.23083974421024323
    float_data: -2.7930850982666016
    float_data: 1.9375288486480713
    name: "R"
  }
  initializer {
    dims: 2
    dims: 32
    data_type: 1
    float_data: 0.3663320243358612
    float_data: -1.0445894002914429
    float_data: 2.051173448562622
    float_data: 0.5856620073318481
    float_data: 0.429526150226593
    float_data: -0.6069983839988708
    float_data: 0.1062227264046669
    float_data: -1.5256803035736084
    float_data: 0.7950261235237122
    float_data: -0.3744383156299591
    float_data: 0.134048193693161
    float_data: 1.2020548582077026
    float_data: 0.2847481071949005
    float_data: 0.2624674439430237
    float_data: 0.27649930119514465
    float_data: -0.733271598815918
    float_data: 0.8360047340393066
    float_data: 1.5433591604232788
    float_data: 0.7588056325912476
    float_data: 0.8849087953567505
    float_data: -0.8772815465927124
    float_data: -0.86778724193573
    float_data: -1.4408760070800781
    float_data: 1.232253074645996
    float_data: -0.25417986512184143
    float_data: 1.3998439311981201
    float_data: -0.7819116711616516
    float_data: -0.4375089704990387
    float_data: 0.095425084233284
    float_data: 0.9214500784873962
    float_data: 0.06075019761919975
    float_data: 0.2111247479915619
    float_data: 0.01652756705880165
    float_data: 0.1771877259016037
    float_data: -1.1164699792861938
    float_data: 0.08092710375785828
    float_data: -0.18657898902893066
    float_data: -0.05682447925209999
    float_data: 0.49233654141426086
    float_data: -0.680678129196167
    float_data: -0.0845080241560936
    float_data: -0.2973618805408478
    float_data: 0.4173020124435425
    float_data: 0.784770667552948
    float_data: -0.9554252624511719
    float_data: 0.585910439491272
    float_data: 2.0657832622528076
    float_data: -1.4711569547653198
    float_data: -0.8301718831062317
    float_data: -0.8805776238441467
    float_data: -0.2790977358818054
    float_data: 1.6228491067886353
    float_data: 0.013352676294744015
    float_data: -0.6946936249732971
    float_data: 0.6218035221099854
    float_data: -0.5998045206069946
    float_data: 1.1234121322631836
    float_data: 0.3052670359611511
    float_data: 1.3887794017791748
    float_data: -0.6613442301750183
    float_data: 3.0308570861816406
    float_data: 0.8245846033096313
    float_data: 0.6545801758766174
    float_data: -0.05118844658136368
    name: "B"
  }
  initializer {
    dims: 2
    dims: 5
    dims: 4
    data_type: 1
    float_data: -0.7255971431732178
    float_data: -0.8677687048912048
    float_data: -0.13597732782363892
    float_data: -0.7972697615623474
    float_data: 0.28267571330070496
    float_data: -0.8260974287986755
    float_data: 0.6210827231407166
    float_data: 0.9561216831207275
    float_data: -0.705840528011322
    float_data: 1.1926860809326172
    float_data: -0.2379419356584549
    float_data: 1.1552878618240356
    float_data: 0.4381663501262665
    float_data: 1.122328281402588
    float_data: -0.9970197677612305
    float_data: -0.10679398477077484
    float_data: 1.4514292478561401
    float_data: -0.6180368661880493
    float_data: -2.037201166152954
    float_data: -1.9425891637802124
    float_data: -2.5064406394958496
    float_data: -2.114163875579834
    float_data: -0.41163915395736694
    float_data: 1.278528094291687
    float_data: -0.4422292709350586
    float_data: 0.32352736592292786
    float_data: -0.10999149084091187
    float_data: 0.008548945188522339
    float_data: -0.1681988388299942
    float_data: -0.17418034374713898
    float_data: 0.46116408705711365
    float_data: -1.1759827136993408
    float_data: 1.0101271867752075
    float_data: 0.9200179576873779
    float_data: -0.19505734741687775
    float_data: 0.805393397808075
    float_data: -0.7013444304466248
    float_data: -0.5372230410575867
    float_data: 0.15626384317874908
    float_data: -0.19022102653980255
    name: "initial_h"
  }
  initializer {
    dims: 2
    dims: 5
    dims: 4
    data_type: 1
    float_data: -0.4487380385398865
    float_data: -0.6724480390548706
    float_data: -0.5574946999549866
    float_data: 0.9391687512397766
    float_data: -1.9433233737945557
    float_data: 0.35249435901641846
    float_data: -0.23643694818019867
    float_data: 0.7278134822845459
    float_data: 0.5150735974311829
    float_data: -2.78253436088562
    float_data: 0.5846465826034546
    float_data: 0.3242742419242859
    float_data: 0.021862836554646492
    float_data: -0.46867382526397705
    float_data: 0.8532811999320984
    float_data: -0.4130293130874634
    float_data: 1.8347176313400269
    float_data: 0.5643828511238098
    float_data: 2.1378281116485596
    float_data: -0.7855340242385864
    float_data: -1.7559256553649902
    float_data: 0.7147895693778992
    float_data: 0.8527040481567383
    float_data: 0.035360097885131836
    float_data: -1.5387932062149048
    float_data: -0.44789519906044006
    float_data: 0.6179855465888977
    float_data: -0.18417632579803467
    float_data: -0.11598518490791321
    float_data: -0.17545896768569946
    float_data: -0.9339146614074707
    float_data: -0.5330203175544739
    float_data: -1.4265553951263428
    float_data: 1.7679599523544312
    float_data: -0.47537288069725037
    float_data: 0.47761017084121704
    float_data: -1.0218859910964966
    float_data: 0.7945282459259033
    float_data: -1.8731609582901
    float_data: 0.9206151366233826
    name: "initial_c"
  }
  initializer {
    dims: 2
    dims: 2
    dims: 5
    dims: 4
    data_type: 1
    float_data: -0.004032406024634838
    float_data: -0.004462004639208317
    float_data: -0.11961524933576584
    float_data: -0.24488280713558197
    float_data: -0.7739036679267883
    float_data: 0.0038530235178768635
    float_data: -0.5268939733505249
    float_data: 0.11705601960420609
    float_data: 0.029958104714751244
    float_data: -0.340408056974411
    float_data: 0.011654520407319069
    float_data: -0.1988580971956253
    float_data: -0.7096371650695801
    float_data: 0.002710475353524089
    float_data: 0.0027021574787795544
    float_data: -0.22992612421512604
    float_data: 0.1948436051607132
    float_data: 0.23224633932113647
    float_data: 0.0013459676411002874
    float_data: 0.4876309633255005
    float_data: -0.14344684779644012
    float_data: 0.06210453808307648
    float_data: 0.744733989238739
    float_data: 0.15252138674259186
    float_data: -0.18279105424880981
    float_data: -0.021294880658388138
    float_data: 0.5454503297805786
    float_data: -0.004351779818534851
    float_data: 0.23740188777446747
    float_data: -0.035537537187337875
    float_data: 0.03293892741203308
    float_data: 0.09300301969051361
    float_data: -0.3197038173675537
    float_data: 0.22859133780002594
    float_data: -0.22090184688568115
    float_data: 0.006025888025760651
    float_data: 0.013019595295190811
    float_data: 0.04256730526685715
    float_data: -0.24416765570640564
    float_data: 0.17333006858825684
    float_data: -0.3833770155906677
    float_data: 0.029960526153445244
    float_data: -0.026150351390242577
    float_data: 0.14755044877529144
    float_data: -0.3461287319660187
    float_data: 0.015776503831148148
    float_data: 0.002974175615236163
    float_data: -0.1785404086112976
    float_data: 0.3363659083843231
    float_data: -0.20950248837471008
    float_data: 0.3258989155292511
    float_data: -0.11810128390789032
    float_data: -0.021570634096860886
    float_data: 0.03261823207139969
    float_data: -0.027086878195405006
    float_data: -0.4444737434387207
    float_data: 0.4044571816921234
    float_data: 0.6170535683631897
    float_data: 0.19347822666168213
    float_data: 0.44024890661239624
    float_data: -0.8476369380950928
    float_data: 0.8057203888893127
    float_data: 0.6255403757095337
    float_data: 4.2606592614902183e-05
    float_data: -0.5677104592323303
    float_data: -0.07071330398321152
    float_data: 0.5493011474609375
    float_data: -0.01966593973338604
    float_data: 0.06701567023992538
    float_data: -0.09959989041090012
    float_data: -0.1481088399887085
    float_data: -0.3607737421989441
    float_data: -0.3277128040790558
    float_data: 0.006580004934221506
    float_data: 0.13670679926872253
    float_data: 0.5570814609527588
    float_data: -0.01634780503809452
    float_data: 0.49886056780815125
    float_data: -0.716121256351471
    float_data: -0.03986666351556778
    name: "Y_ref"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "initial_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "Y_ref"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y_err"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
