ir_version: 5
producer_name: "onnx-mfcc"
graph {
  node {
    input: "spectrogram"
    output: "coefficients"
    name: "mfcc"
    op_type: "MFCC"
    attribute {
      name: "dct_coefficient_count"
      i: 10
      type: INT
    }
    attribute {
      name: "filterbank_channel_count"
      i: 40
      type: INT
    }
    attribute {
      name: "lower_frequency_limit"
      f: 20.0
      type: FLOAT
    }
    attribute {
      name: "sample_rate"
      f: 16000.0
      type: FLOAT
    }
    attribute {
      name: "upper_frequency_limit"
      f: 4000.0
      type: FLOAT
    }
  }
  node {
    input: "coefficients"
    input: "coefficients_ref"
    output: "coefficients_err"
    name: "error"
    op_type: "Sub"
  }
  name: "mfcc_test"
  initializer {
    dims: 2
    dims: 257
    data_type: 1
    float_data: 216.9405517578125
    float_data: 150.92893981933594
    float_data: 68.08991241455078
    float_data: 17.004974365234375
    float_data: 229.1488494873047
    float_data: 122.7855453491211
    float_data: 26.673877716064453
    float_data: 3.887535333633423
    float_data: 77.4755630493164
    float_data: 93.26400756835938
    float_data: 163.00900268554688
    float_data: 416.36285400390625
    float_data: 500.6540832519531
    float_data: 142.0408172607422
    float_data: 71.36026763916016
    float_data: 146.30349731445312
    float_data: 243.25253295898438
    float_data: 264.4737243652344
    float_data: 56.20262908935547
    float_data: 199.9287567138672
    float_data: 609.3236083984375
    float_data: 127.78565216064453
    float_data: 232.6325225830078
    float_data: 392.739013671875
    float_data: 34.332618713378906
    float_data: 231.28384399414062
    float_data: 181.44161987304688
    float_data: 228.1024169921875
    float_data: 65.17854309082031
    float_data: 67.26629638671875
    float_data: 107.43711853027344
    float_data: 187.52685546875
    float_data: 519.1817016601562
    float_data: 332.35357666015625
    float_data: 102.46783447265625
    float_data: 233.64181518554688
    float_data: 228.6509246826172
    float_data: 180.51254272460938
    float_data: 102.75252532958984
    float_data: 75.13753509521484
    float_data: 165.08456420898438
    float_data: 32.927642822265625
    float_data: 81.80889892578125
    float_data: 355.4009094238281
    float_data: 217.0304718017578
    float_data: 69.43521881103516
    float_data: 431.5605163574219
    float_data: 303.6896057128906
    float_data: 3.982919454574585
    float_data: 3.4906725883483887
    float_data: 44.92619323730469
    float_data: 240.88865661621094
    float_data: 147.5855255126953
    float_data: 139.01431274414062
    float_data: 648.5787963867188
    float_data: 215.00132751464844
    float_data: 137.98533630371094
    float_data: 119.65279388427734
    float_data: 321.7087097167969
    float_data: 267.0819396972656
    float_data: 227.19696044921875
    float_data: 296.5286560058594
    float_data: 208.40243530273438
    float_data: 206.06251525878906
    float_data: 331.5135803222656
    float_data: 328.91107177734375
    float_data: 275.90142822265625
    float_data: 210.3733673095703
    float_data: 191.2421417236328
    float_data: 284.7600402832031
    float_data: 322.2375793457031
    float_data: 244.47817993164062
    float_data: 92.14523315429688
    float_data: 62.36587142944336
    float_data: 235.27830505371094
    float_data: 84.77204895019531
    float_data: 31.27320098876953
    float_data: 241.11492919921875
    float_data: 152.12937927246094
    float_data: 23.308231353759766
    float_data: 136.8359375
    float_data: 510.24554443359375
    float_data: 412.5824279785156
    float_data: 194.96060180664062
    float_data: 92.21240234375
    float_data: 40.27096939086914
    float_data: 158.60015869140625
    float_data: 2.453888416290283
    float_data: 177.09532165527344
    float_data: 199.0953369140625
    float_data: 601.6641235351562
    float_data: 109.93153381347656
    float_data: 28.36252784729004
    float_data: 169.15786743164062
    float_data: 32.045753479003906
    float_data: 282.84771728515625
    float_data: 304.3147888183594
    float_data: 161.78359985351562
    float_data: 160.32484436035156
    float_data: 14.91842269897461
    float_data: 228.71060180664062
    float_data: 529.718505859375
    float_data: 144.5240936279297
    float_data: 268.4670715332031
    float_data: 721.0082397460938
    float_data: 152.4595947265625
    float_data: 62.319801330566406
    float_data: 221.52392578125
    float_data: 223.266845703125
    float_data: 209.67991638183594
    float_data: 223.490966796875
    float_data: 375.0740661621094
    float_data: 14.122733116149902
    float_data: 157.51075744628906
    float_data: 71.7162094116211
    float_data: 185.41641235351562
    float_data: 7.289463520050049
    float_data: 29.128925323486328
    float_data: 103.06844329833984
    float_data: 92.98191833496094
    float_data: 69.7093505859375
    float_data: 79.24146270751953
    float_data: 80.38925170898438
    float_data: 132.8865509033203
    float_data: 143.84259033203125
    float_data: 185.76287841796875
    float_data: 57.44217300415039
    float_data: 0.3951222002506256
    float_data: 64.85957336425781
    float_data: 262.3708190917969
    float_data: 4.692627429962158
    float_data: 12.739707946777344
    float_data: 143.30467224121094
    float_data: 357.8536376953125
    float_data: 59.54217529296875
    float_data: 259.1596374511719
    float_data: 190.64942932128906
    float_data: 138.36195373535156
    float_data: 241.8423614501953
    float_data: 133.95899963378906
    float_data: 200.9916534423828
    float_data: 34.10988235473633
    float_data: 113.39234924316406
    float_data: 186.01644897460938
    float_data: 132.219482421875
    float_data: 143.1027069091797
    float_data: 17.11060905456543
    float_data: 127.22785949707031
    float_data: 123.45588684082031
    float_data: 48.1810417175293
    float_data: 136.65902709960938
    float_data: 157.34730529785156
    float_data: 540.5284423828125
    float_data: 357.491455078125
    float_data: 114.96788787841797
    float_data: 204.5527801513672
    float_data: 32.0096321105957
    float_data: 27.087480545043945
    float_data: 11.923590660095215
    float_data: 377.7068176269531
    float_data: 679.4248657226562
    float_data: 196.44912719726562
    float_data: 82.84346771240234
    float_data: 133.92137145996094
    float_data: 375.1866149902344
    float_data: 144.0300750732422
    float_data: 16.902271270751953
    float_data: 49.74052810668945
    float_data: 30.098949432373047
    float_data: 60.87722396850586
    float_data: 59.165283203125
    float_data: 154.15280151367188
    float_data: 216.61105346679688
    float_data: 308.0362243652344
    float_data: 367.56268310546875
    float_data: 241.995849609375
    float_data: 503.8575134277344
    float_data: 739.2466430664062
    float_data: 656.70458984375
    float_data: 535.3212890625
    float_data: 256.59228515625
    float_data: 121.01737976074219
    float_data: 128.25360107421875
    float_data: 162.23789978027344
    float_data: 277.9340515136719
    float_data: 408.25018310546875
    float_data: 524.0986328125
    float_data: 516.6817626953125
    float_data: 224.50808715820312
    float_data: 54.670772552490234
    float_data: 43.430747985839844
    float_data: 63.921241760253906
    float_data: 43.9678840637207
    float_data: 77.98683166503906
    float_data: 65.81015014648438
    float_data: 12.936454772949219
    float_data: 350.5655822753906
    float_data: 246.66189575195312
    float_data: 162.1449432373047
    float_data: 488.70751953125
    float_data: 480.81512451171875
    float_data: 184.67408752441406
    float_data: 61.82373809814453
    float_data: 25.593647003173828
    float_data: 14.421189308166504
    float_data: 31.787473678588867
    float_data: 226.05235290527344
    float_data: 353.261962890625
    float_data: 220.60336303710938
    float_data: 234.1128387451172
    float_data: 62.68830490112305
    float_data: 169.721923828125
    float_data: 225.36651611328125
    float_data: 40.2728157043457
    float_data: 139.328369140625
    float_data: 327.7012939453125
    float_data: 608.7570190429688
    float_data: 386.90020751953125
    float_data: 198.34368896484375
    float_data: 216.4627227783203
    float_data: 95.61553955078125
    float_data: 26.7247371673584
    float_data: 20.664024353027344
    float_data: 86.70184326171875
    float_data: 59.45317077636719
    float_data: 18.30875587463379
    float_data: 78.87641143798828
    float_data: 258.6450500488281
    float_data: 146.5713653564453
    float_data: 34.87805938720703
    float_data: 272.0374450683594
    float_data: 92.52733612060547
    float_data: 85.82618713378906
    float_data: 74.04532623291016
    float_data: 184.05239868164062
    float_data: 701.5420532226562
    float_data: 788.626708984375
    float_data: 208.558349609375
    float_data: 119.39005279541016
    float_data: 309.4764709472656
    float_data: 110.837158203125
    float_data: 35.16786575317383
    float_data: 75.6294937133789
    float_data: 325.7320556640625
    float_data: 224.17941284179688
    float_data: 197.52281188964844
    float_data: 509.7374267578125
    float_data: 451.81787109375
    float_data: 689.88037109375
    float_data: 261.878173828125
    float_data: 88.53608703613281
    float_data: 71.13768768310547
    float_data: 145.6337432861328
    float_data: 371.8714294433594
    float_data: 9.832662582397461
    float_data: 137.4047393798828
    float_data: 0.08179374039173126
    float_data: 112.02169799804688
    float_data: 104.26641845703125
    float_data: 7.627922534942627
    float_data: 127.4329833984375
    float_data: 229.0190887451172
    float_data: 31.29575538635254
    float_data: 29.8749942779541
    float_data: 182.99307250976562
    float_data: 237.6324005126953
    float_data: 221.13291931152344
    float_data: 532.0468139648438
    float_data: 504.21661376953125
    float_data: 825.3091430664062
    float_data: 649.26025390625
    float_data: 191.04258728027344
    float_data: 162.0322723388672
    float_data: 291.3745422363281
    float_data: 218.7796630859375
    float_data: 115.15653991699219
    float_data: 235.7207794189453
    float_data: 10.248188018798828
    float_data: 28.455034255981445
    float_data: 204.34381103515625
    float_data: 335.6215515136719
    float_data: 306.99566650390625
    float_data: 478.4080810546875
    float_data: 422.0386657714844
    float_data: 589.2225341796875
    float_data: 748.5557861328125
    float_data: 517.7197265625
    float_data: 58.01386260986328
    float_data: 8.366384506225586
    float_data: 66.97259521484375
    float_data: 571.56884765625
    float_data: 90.50965881347656
    float_data: 193.5743408203125
    float_data: 251.49107360839844
    float_data: 28.96285057067871
    float_data: 159.864990234375
    float_data: 53.2175178527832
    float_data: 173.66188049316406
    float_data: 380.66290283203125
    float_data: 346.9718933105469
    float_data: 15.350275993347168
    float_data: 146.767333984375
    float_data: 58.1252326965332
    float_data: 229.94126892089844
    float_data: 162.97256469726562
    float_data: 1.1130183935165405
    float_data: 5.376823902130127
    float_data: 45.0933837890625
    float_data: 81.29531860351562
    float_data: 109.74919128417969
    float_data: 309.95574951171875
    float_data: 22.18880844116211
    float_data: 221.75303649902344
    float_data: 466.8460388183594
    float_data: 324.31005859375
    float_data: 74.13851165771484
    float_data: 164.61831665039062
    float_data: 156.40139770507812
    float_data: 18.565710067749023
    float_data: 66.40308380126953
    float_data: 60.95832443237305
    float_data: 26.80561637878418
    float_data: 209.1079559326172
    float_data: 502.22955322265625
    float_data: 467.9651184082031
    float_data: 65.79273986816406
    float_data: 53.55958938598633
    float_data: 90.09210205078125
    float_data: 3.4073147773742676
    float_data: 130.7532196044922
    float_data: 189.71875
    float_data: 176.53826904296875
    float_data: 121.4273452758789
    float_data: 369.94757080078125
    float_data: 371.03375244140625
    float_data: 6.504734516143799
    float_data: 345.366943359375
    float_data: 120.73506164550781
    float_data: 341.3482666015625
    float_data: 872.0931396484375
    float_data: 704.5145263671875
    float_data: 155.17245483398438
    float_data: 13.03481674194336
    float_data: 34.16822814941406
    float_data: 23.814180374145508
    float_data: 185.40940856933594
    float_data: 575.4266357421875
    float_data: 238.08445739746094
    float_data: 7.097851276397705
    float_data: 103.48355102539062
    float_data: 119.62037658691406
    float_data: 4.584441661834717
    float_data: 71.37882232666016
    float_data: 21.35452651977539
    float_data: 2.4673070907592773
    float_data: 30.78550910949707
    float_data: 139.1937713623047
    float_data: 646.7620849609375
    float_data: 220.2981414794922
    float_data: 5.430073261260986
    float_data: 52.36765670776367
    float_data: 122.12315368652344
    float_data: 22.20079231262207
    float_data: 95.92235565185547
    float_data: 32.866668701171875
    float_data: 19.361675262451172
    float_data: 531.7157592773438
    float_data: 1082.738525390625
    float_data: 322.8038635253906
    float_data: 59.274627685546875
    float_data: 517.9342651367188
    float_data: 538.478515625
    float_data: 100.91079711914062
    float_data: 141.7471160888672
    float_data: 589.7864379882812
    float_data: 149.69541931152344
    float_data: 2.654719829559326
    float_data: 62.33797836303711
    float_data: 163.35157775878906
    float_data: 55.78692626953125
    float_data: 21.24466896057129
    float_data: 94.34097290039062
    float_data: 48.850921630859375
    float_data: 42.06698226928711
    float_data: 110.63284301757812
    float_data: 370.7017517089844
    float_data: 93.104736328125
    float_data: 240.37869262695312
    float_data: 41.51668930053711
    float_data: 37.773887634277344
    float_data: 5.214127540588379
    float_data: 14.272138595581055
    float_data: 68.19133758544922
    float_data: 111.06007385253906
    float_data: 520.4327392578125
    float_data: 632.1122436523438
    float_data: 247.96881103515625
    float_data: 200.75091552734375
    float_data: 534.0093383789062
    float_data: 95.41282653808594
    float_data: 124.18062591552734
    float_data: 184.0880126953125
    float_data: 57.222843170166016
    float_data: 102.79505920410156
    float_data: 148.4183349609375
    float_data: 9.277685165405273
    float_data: 13.580111503601074
    float_data: 4.998417854309082
    float_data: 3.670875072479248
    float_data: 117.48333740234375
    float_data: 112.17354583740234
    float_data: 486.26605224609375
    float_data: 780.3505859375
    float_data: 632.8171997070312
    float_data: 165.29579162597656
    float_data: 48.89741897583008
    float_data: 90.51631164550781
    float_data: 330.9564208984375
    float_data: 158.8513946533203
    float_data: 118.60995483398438
    float_data: 320.0821533203125
    float_data: 174.46176147460938
    float_data: 244.94992065429688
    float_data: 330.6347351074219
    float_data: 17.378097534179688
    float_data: 32.17837905883789
    float_data: 68.78765869140625
    float_data: 260.1751403808594
    float_data: 310.96112060546875
    float_data: 141.3246307373047
    float_data: 66.16730499267578
    float_data: 127.3302230834961
    float_data: 107.31639099121094
    float_data: 58.382347106933594
    float_data: 89.52847290039062
    float_data: 23.649635314941406
    float_data: 96.10792541503906
    float_data: 54.014827728271484
    float_data: 3.912651300430298
    float_data: 47.98860168457031
    float_data: 164.2640838623047
    float_data: 338.821044921875
    float_data: 496.9837341308594
    float_data: 154.1223907470703
    float_data: 82.35592651367188
    float_data: 176.4787139892578
    float_data: 25.15738296508789
    float_data: 6.24758768081665
    float_data: 85.38160705566406
    float_data: 318.698486328125
    float_data: 421.072998046875
    float_data: 424.20343017578125
    float_data: 517.0223999023438
    float_data: 419.1878356933594
    float_data: 96.72284698486328
    float_data: 412.1192932128906
    float_data: 419.1099548339844
    float_data: 496.8949890136719
    float_data: 229.9004669189453
    float_data: 24.314420700073242
    float_data: 179.64126586914062
    float_data: 135.9409637451172
    float_data: 65.05912017822266
    float_data: 69.97644805908203
    float_data: 7.275372505187988
    float_data: 53.34953689575195
    float_data: 194.36973571777344
    float_data: 47.704673767089844
    float_data: 112.36699676513672
    float_data: 142.97569274902344
    float_data: 89.12200927734375
    float_data: 152.0368194580078
    float_data: 188.974609375
    float_data: 109.84529113769531
    float_data: 114.71574401855469
    float_data: 257.7016296386719
    float_data: 218.66836547851562
    float_data: 38.772281646728516
    float_data: 29.85761260986328
    float_data: 151.60009765625
    float_data: 163.49696350097656
    float_data: 51.63842010498047
    float_data: 140.682861328125
    float_data: 42.616580963134766
    float_data: 270.236572265625
    float_data: 566.8960571289062
    float_data: 142.1210174560547
    float_data: 113.61253356933594
    float_data: 58.274654388427734
    float_data: 20.22877311706543
    float_data: 138.53001403808594
    float_data: 130.02651977539062
    float_data: 211.53826904296875
    float_data: 283.97344970703125
    float_data: 31.230846405029297
    float_data: 70.1052017211914
    float_data: 464.84783935546875
    float_data: 733.5162963867188
    float_data: 1109.7047119140625
    float_data: 409.8064880371094
    float_data: 565.7935791015625
    float_data: 189.70912170410156
    float_data: 181.89637756347656
    float_data: 662.3262329101562
    float_data: 239.97808837890625
    float_data: 103.4462890625
    float_data: 56.21318817138672
    float_data: 146.49681091308594
    float_data: 49.54173278808594
    float_data: 106.53923034667969
    float_data: 244.3455352783203
    float_data: 56.49469757080078
    float_data: 66.64816284179688
    float_data: 362.87982177734375
    name: "spectrogram"
  }
  initializer {
    dims: 2
    dims: 10
    data_type: 1
    float_data: 30.945241928100586
    float_data: -3.961271286010742
    float_data: -0.8451730608940125
    float_data: -0.9314228892326355
    float_data: -0.7758215665817261
    float_data: -0.2495320439338684
    float_data: 0.012925037182867527
    float_data: -0.09606502205133438
    float_data: 0.14134137332439423
    float_data: 0.4560374617576599
    float_data: 31.032426834106445
    float_data: -3.2733616828918457
    float_data: -0.6033440828323364
    float_data: -1.4316822290420532
    float_data: -0.9232624769210815
    float_data: -0.5927470326423645
    float_data: -0.8066161870956421
    float_data: -0.9964189529418945
    float_data: -0.1123187318444252
    float_data: -0.014560696668922901
    name: "coefficients_ref"
  }
  input {
    name: "spectrogram"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 257
          }
        }
      }
    }
  }
  input {
    name: "coefficients_ref"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "coefficients_err"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
