ir_version: 5
producer_name: "onnx-mfcc"
graph {
  node {
    input: "spectrogram"
    output: "coefficients"
    name: "mfcc"
    op_type: "MFCC"
    attribute {
      name: "dct_coefficient_count"
      i: 10
      type: INT
    }
    attribute {
      name: "filterbank_channel_count"
      i: 40
      type: INT
    }
    attribute {
      name: "lower_frequency_limit"
      f: 20.0
      type: FLOAT
    }
    attribute {
      name: "sample_rate"
      f: 16000.0
      type: FLOAT
    }
    attribute {
      name: "upper_frequency_limit"
      f: 4000.0
      type: FLOAT
    }
  }
  node {
    input: "coefficients"
    input: "coefficients_ref"
    output: "coefficients_err"
    name: "error"
    op_type: "Sub"
  }
  name: "mfcc_test"
  initializer {
    dims: 1
    dims: 513
    data_type: 1
    float_data: 228.12217712402344
    float_data: 98.74253845214844
    float_data: 43.9660758972168
    float_data: 131.36288452148438
    float_data: 123.28512573242188
    float_data: 66.76091766357422
    float_data: 83.51780700683594
    float_data: 256.563232421875
    float_data: 389.5627746582031
    float_data: 233.09637451171875
    float_data: 46.915916442871094
    float_data: 22.182668685913086
    float_data: 53.282527923583984
    float_data: 80.7946548461914
    float_data: 75.9373550415039
    float_data: 105.70638275146484
    float_data: 158.71401977539062
    float_data: 120.67053985595703
    float_data: 123.67533111572266
    float_data: 240.12034606933594
    float_data: 413.99432373046875
    float_data: 378.8135986328125
    float_data: 134.98756408691406
    float_data: 391.6688232421875
    float_data: 829.0283203125
    float_data: 476.7172546386719
    float_data: 31.41482925415039
    float_data: 47.71803665161133
    float_data: 93.85150146484375
    float_data: 43.901710510253906
    float_data: 112.205810546875
    float_data: 118.55303955078125
    float_data: 82.35372924804688
    float_data: 308.5594787597656
    float_data: 498.3323059082031
    float_data: 404.61065673828125
    float_data: 163.5823211669922
    float_data: 65.3780288696289
    float_data: 337.9584655761719
    float_data: 664.321044921875
    float_data: 574.3831176757812
    float_data: 265.3609313964844
    float_data: 83.3087387084961
    float_data: 0.44479605555534363
    float_data: 174.7661590576172
    float_data: 639.4141235351562
    float_data: 662.5100708007812
    float_data: 216.06398010253906
    float_data: 27.876285552978516
    float_data: 42.07247543334961
    float_data: 302.295654296875
    float_data: 627.1822509765625
    float_data: 737.6956787109375
    float_data: 697.14306640625
    float_data: 306.76177978515625
    float_data: 4.936967372894287
    float_data: 97.6834487915039
    float_data: 225.42800903320312
    float_data: 341.9017639160156
    float_data: 371.8906555175781
    float_data: 261.89056396484375
    float_data: 165.277099609375
    float_data: 155.17164611816406
    float_data: 281.9003601074219
    float_data: 616.0946655273438
    float_data: 858.8711547851562
    float_data: 653.3173828125
    float_data: 330.6766662597656
    float_data: 217.00653076171875
    float_data: 206.5823211669922
    float_data: 181.348388671875
    float_data: 185.349365234375
    float_data: 273.4098815917969
    float_data: 352.19378662109375
    float_data: 340.5096130371094
    float_data: 246.72320556640625
    float_data: 113.5112533569336
    float_data: 13.054924964904785
    float_data: 28.713830947875977
    float_data: 153.71527099609375
    float_data: 275.6476745605469
    float_data: 221.55262756347656
    float_data: 69.02622985839844
    float_data: 21.14299964904785
    float_data: 152.11036682128906
    float_data: 408.83740234375
    float_data: 540.620849609375
    float_data: 452.5021057128906
    float_data: 244.62440490722656
    float_data: 65.21076965332031
    float_data: 7.030208587646484
    float_data: 107.57604217529297
    float_data: 412.63299560546875
    float_data: 591.8163452148438
    float_data: 293.312255859375
    float_data: 27.784076690673828
    float_data: 2.710466146469116
    float_data: 6.033628463745117
    float_data: 0.766595184803009
    float_data: 1.1432546377182007
    float_data: 32.993202209472656
    float_data: 166.45950317382812
    float_data: 336.29608154296875
    float_data: 423.6654968261719
    float_data: 348.9083557128906
    float_data: 195.43553161621094
    float_data: 358.5988464355469
    float_data: 701.6820068359375
    float_data: 728.436279296875
    float_data: 496.0850830078125
    float_data: 139.49366760253906
    float_data: 14.932474136352539
    float_data: 232.1593017578125
    float_data: 153.1789093017578
    float_data: 8.17006778717041
    float_data: 279.74163818359375
    float_data: 448.0658874511719
    float_data: 439.5281066894531
    float_data: 477.130859375
    float_data: 517.884765625
    float_data: 482.0737609863281
    float_data: 413.1641540527344
    float_data: 297.9853210449219
    float_data: 178.26258850097656
    float_data: 133.04351806640625
    float_data: 134.39015197753906
    float_data: 133.78756713867188
    float_data: 144.43675231933594
    float_data: 238.07196044921875
    float_data: 337.8219909667969
    float_data: 238.78213500976562
    float_data: 143.42958068847656
    float_data: 289.6211853027344
    float_data: 395.28106689453125
    float_data: 186.20858764648438
    float_data: 22.889732360839844
    float_data: 146.83921813964844
    float_data: 236.75393676757812
    float_data: 292.3660583496094
    float_data: 389.3636779785156
    float_data: 445.03509521484375
    float_data: 360.1713562011719
    float_data: 182.66615295410156
    float_data: 63.542476654052734
    float_data: 74.43680572509766
    float_data: 131.496337890625
    float_data: 225.74607849121094
    float_data: 424.2431945800781
    float_data: 558.9996948242188
    float_data: 441.3138122558594
    float_data: 192.72988891601562
    float_data: 39.96232223510742
    float_data: 50.794803619384766
    float_data: 249.43785095214844
    float_data: 475.124755859375
    float_data: 408.4870300292969
    float_data: 156.56838989257812
    float_data: 8.056432723999023
    float_data: 28.754838943481445
    float_data: 97.70096588134766
    float_data: 199.69625854492188
    float_data: 406.694091796875
    float_data: 781.356689453125
    float_data: 942.9173583984375
    float_data: 424.2950744628906
    float_data: 7.987887382507324
    float_data: 245.92356872558594
    float_data: 265.8584289550781
    float_data: 42.70096969604492
    float_data: 8.624307632446289
    float_data: 25.313655853271484
    float_data: 50.48338317871094
    float_data: 147.01055908203125
    float_data: 153.13697814941406
    float_data: 71.19857025146484
    float_data: 180.55325317382812
    float_data: 450.3936462402344
    float_data: 496.7793273925781
    float_data: 675.53271484375
    float_data: 926.1714477539062
    float_data: 556.3390502929688
    float_data: 165.72586059570312
    float_data: 92.067138671875
    float_data: 57.23976516723633
    float_data: 4.901918888092041
    float_data: 54.476768493652344
    float_data: 213.77830505371094
    float_data: 167.5142059326172
    float_data: 15.570980072021484
    float_data: 83.34889221191406
    float_data: 327.8160400390625
    float_data: 402.3284606933594
    float_data: 268.04925537109375
    float_data: 150.41943359375
    float_data: 103.29478454589844
    float_data: 73.35572814941406
    float_data: 97.85369873046875
    float_data: 167.63259887695312
    float_data: 157.7257537841797
    float_data: 245.5872802734375
    float_data: 580.4822387695312
    float_data: 763.4104614257812
    float_data: 494.11993408203125
    float_data: 182.61732482910156
    float_data: 82.89795684814453
    float_data: 6.7782135009765625
    float_data: 134.00038146972656
    float_data: 596.63720703125
    float_data: 869.5111083984375
    float_data: 599.8818969726562
    float_data: 199.43603515625
    float_data: 39.532413482666016
    float_data: 109.29383850097656
    float_data: 155.14288330078125
    float_data: 104.18006896972656
    float_data: 121.71762084960938
    float_data: 81.47053527832031
    float_data: 161.5874481201172
    float_data: 439.9573059082031
    float_data: 632.6967163085938
    float_data: 872.4172973632812
    float_data: 956.202880859375
    float_data: 562.015625
    float_data: 144.8708038330078
    float_data: 18.526960372924805
    float_data: 186.12600708007812
    float_data: 362.4660949707031
    float_data: 127.59780883789062
    float_data: 92.00678253173828
    float_data: 400.71356201171875
    float_data: 388.3240966796875
    float_data: 140.88035583496094
    float_data: 40.40855407714844
    float_data: 75.61663055419922
    float_data: 165.1356201171875
    float_data: 288.9697265625
    float_data: 282.8144836425781
    float_data: 187.228271484375
    float_data: 129.34451293945312
    float_data: 127.55338287353516
    float_data: 143.11734008789062
    float_data: 114.60187530517578
    float_data: 24.829439163208008
    float_data: 38.48536682128906
    float_data: 130.3576202392578
    float_data: 180.9893035888672
    float_data: 226.839111328125
    float_data: 170.43067932128906
    float_data: 32.8005485534668
    float_data: 80.591064453125
    float_data: 226.7704315185547
    float_data: 171.56561279296875
    float_data: 40.04621887207031
    float_data: 3.1011087894439697
    float_data: 2.770641565322876
    float_data: 8.596858978271484
    float_data: 74.97547912597656
    float_data: 357.1989440917969
    float_data: 529.771240234375
    float_data: 286.7103271484375
    float_data: 96.34632110595703
    float_data: 116.23672485351562
    float_data: 85.62574005126953
    float_data: 79.64370727539062
    float_data: 186.7071533203125
    float_data: 265.500732421875
    float_data: 263.6443176269531
    float_data: 205.1275177001953
    float_data: 67.6155014038086
    float_data: 25.665149688720703
    float_data: 264.46875
    float_data: 512.22265625
    float_data: 427.9509582519531
    float_data: 223.27708435058594
    float_data: 485.627197265625
    float_data: 770.3558349609375
    float_data: 352.42474365234375
    float_data: 10.173479080200195
    float_data: 174.1124725341797
    float_data: 277.0405578613281
    float_data: 282.2008361816406
    float_data: 212.70074462890625
    float_data: 209.07351684570312
    float_data: 245.86224365234375
    float_data: 210.62942504882812
    float_data: 199.3154754638672
    float_data: 180.26502990722656
    float_data: 59.768619537353516
    float_data: 58.109336853027344
    float_data: 136.82980346679688
    float_data: 63.503841400146484
    float_data: 61.22495651245117
    float_data: 70.170166015625
    float_data: 82.88612365722656
    float_data: 209.01834106445312
    float_data: 172.41632080078125
    float_data: 52.26995086669922
    float_data: 16.144882202148438
    float_data: 10.631113052368164
    float_data: 84.71729278564453
    float_data: 149.47283935546875
    float_data: 134.4976806640625
    float_data: 158.64761352539062
    float_data: 327.2347412109375
    float_data: 543.3087768554688
    float_data: 491.9231262207031
    float_data: 292.64776611328125
    float_data: 87.52135467529297
    float_data: 35.56456756591797
    float_data: 407.90911865234375
    float_data: 405.3804931640625
    float_data: 46.597774505615234
    float_data: 58.03566360473633
    float_data: 117.06646728515625
    float_data: 147.73638916015625
    float_data: 165.09890747070312
    float_data: 107.97329711914062
    float_data: 182.51272583007812
    float_data: 607.5589599609375
    float_data: 1079.434326171875
    float_data: 964.6256103515625
    float_data: 429.6517333984375
    float_data: 89.86583709716797
    float_data: 16.69977569580078
    float_data: 49.27396774291992
    float_data: 107.42539978027344
    float_data: 32.82302474975586
    float_data: 125.02877807617188
    float_data: 530.6941528320312
    float_data: 633.1612548828125
    float_data: 323.92266845703125
    float_data: 71.21684265136719
    float_data: 85.79896545410156
    float_data: 169.22866821289062
    float_data: 104.54692077636719
    float_data: 31.23023796081543
    float_data: 68.108154296875
    float_data: 153.19017028808594
    float_data: 175.03363037109375
    float_data: 123.28983306884766
    float_data: 21.435691833496094
    float_data: 40.73525619506836
    float_data: 262.7544860839844
    float_data: 369.1979064941406
    float_data: 167.29188537597656
    float_data: 28.86431121826172
    float_data: 275.48046875
    float_data: 416.7221984863281
    float_data: 228.75277709960938
    float_data: 151.90541076660156
    float_data: 258.3518981933594
    float_data: 353.6648254394531
    float_data: 308.9364318847656
    float_data: 402.2857666015625
    float_data: 685.1155395507812
    float_data: 749.1245727539062
    float_data: 674.37158203125
    float_data: 690.6472778320312
    float_data: 683.1240234375
    float_data: 477.55096435546875
    float_data: 218.49449157714844
    float_data: 95.61853790283203
    float_data: 73.80201721191406
    float_data: 97.92669677734375
    float_data: 143.3872833251953
    float_data: 88.68669128417969
    float_data: 29.40987205505371
    float_data: 240.5066680908203
    float_data: 335.0789489746094
    float_data: 108.99958038330078
    float_data: 220.4580535888672
    float_data: 662.6838989257812
    float_data: 872.3662109375
    float_data: 769.8610229492188
    float_data: 449.16864013671875
    float_data: 139.3592529296875
    float_data: 118.11588287353516
    float_data: 134.83567810058594
    float_data: 26.682737350463867
    float_data: 4.068309307098389
    float_data: 27.678686141967773
    float_data: 58.78117370605469
    float_data: 32.056678771972656
    float_data: 19.452213287353516
    float_data: 101.2599868774414
    float_data: 210.40737915039062
    float_data: 295.67218017578125
    float_data: 192.7914581298828
    float_data: 29.15861701965332
    float_data: 13.302973747253418
    float_data: 47.38011932373047
    float_data: 232.73129272460938
    float_data: 697.5474243164062
    float_data: 802.1223754882812
    float_data: 318.7947082519531
    float_data: 16.134069442749023
    float_data: 278.74285888671875
    float_data: 494.4566345214844
    float_data: 336.0831298828125
    float_data: 358.6041564941406
    float_data: 691.2091674804688
    float_data: 768.1175537109375
    float_data: 541.0699462890625
    float_data: 333.28900146484375
    float_data: 210.05609130859375
    float_data: 142.66346740722656
    float_data: 106.12708282470703
    float_data: 57.82343673706055
    float_data: 18.641372680664062
    float_data: 4.664466381072998
    float_data: 18.333980560302734
    float_data: 32.97307205200195
    float_data: 163.3223876953125
    float_data: 350.1302490234375
    float_data: 333.0862121582031
    float_data: 271.56121826171875
    float_data: 320.11431884765625
    float_data: 413.04681396484375
    float_data: 372.0442199707031
    float_data: 201.66766357421875
    float_data: 100.17244720458984
    float_data: 102.89250183105469
    float_data: 136.4676971435547
    float_data: 175.2777862548828
    float_data: 247.982666015625
    float_data: 154.75563049316406
    float_data: 5.959268093109131
    float_data: 89.51602172851562
    float_data: 177.07456970214844
    float_data: 184.62437438964844
    float_data: 309.1590270996094
    float_data: 524.8485717773438
    float_data: 555.4755249023438
    float_data: 488.2162780761719
    float_data: 457.5521240234375
    float_data: 286.65667724609375
    float_data: 62.70054244995117
    float_data: 104.54173278808594
    float_data: 270.21563720703125
    float_data: 160.6713104248047
    float_data: 21.65363121032715
    float_data: 29.3732967376709
    float_data: 49.9132194519043
    float_data: 32.189266204833984
    float_data: 7.220250606536865
    float_data: 15.43414306640625
    float_data: 117.79141998291016
    float_data: 225.24484252929688
    float_data: 156.38754272460938
    float_data: 47.837764739990234
    float_data: 82.78754425048828
    float_data: 129.518798828125
    float_data: 130.2508087158203
    float_data: 206.2678680419922
    float_data: 419.16412353515625
    float_data: 489.82379150390625
    float_data: 196.7716827392578
    float_data: 9.111942291259766
    float_data: 31.02434539794922
    float_data: 92.07891845703125
    float_data: 281.2633056640625
    float_data: 244.00469970703125
    float_data: 37.589988708496094
    float_data: 9.560036659240723
    float_data: 59.62614822387695
    float_data: 125.1905517578125
    float_data: 112.03128814697266
    float_data: 39.73769760131836
    float_data: 54.05396270751953
    float_data: 421.4419250488281
    float_data: 711.9564819335938
    float_data: 424.77069091796875
    float_data: 398.73651123046875
    float_data: 585.7630615234375
    float_data: 333.18988037109375
    float_data: 98.78761291503906
    float_data: 274.8031005859375
    float_data: 611.9898071289062
    float_data: 543.5985717773438
    float_data: 204.16033935546875
    float_data: 65.78382873535156
    float_data: 114.17442321777344
    float_data: 117.17503356933594
    float_data: 40.760704040527344
    float_data: 121.52007293701172
    float_data: 286.8945617675781
    float_data: 466.9102478027344
    float_data: 531.9296875
    float_data: 403.4849548339844
    float_data: 132.70034790039062
    float_data: 15.371849060058594
    float_data: 421.2624816894531
    float_data: 1006.5873413085938
    float_data: 1184.90234375
    float_data: 1208.168212890625
    float_data: 1198.3603515625
    float_data: 978.2479248046875
    float_data: 626.0909423828125
    float_data: 239.5974578857422
    float_data: 7.525265216827393
    float_data: 78.2335205078125
    float_data: 159.06008911132812
    float_data: 69.41132354736328
    float_data: 0.2951586842536926
    float_data: 104.67282104492188
    float_data: 434.93646240234375
    float_data: 563.9044189453125
    float_data: 242.4544219970703
    float_data: 38.62791061401367
    float_data: 157.44882202148438
    float_data: 284.0079345703125
    float_data: 198.1713409423828
    float_data: 92.35475158691406
    name: "spectrogram"
  }
  initializer {
    dims: 1
    dims: 10
    data_type: 1
    float_data: 38.553466796875
    float_data: -3.644548177719116
    float_data: -0.4620838463306427
    float_data: -0.7643672823905945
    float_data: -0.2563273310661316
    float_data: 0.08429577201604843
    float_data: 0.012138832360506058
    float_data: -0.33537763357162476
    float_data: 0.02417086623609066
    float_data: 0.3336983919143677
    name: "coefficients_ref"
  }
  input {
    name: "spectrogram"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 513
          }
        }
      }
    }
  }
  input {
    name: "coefficients_ref"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "coefficients_err"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
