ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
graph {
  node {
    input: "input"
    input: "base.conv.weight"
    input: "base.conv.bias"
    output: "8"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "8"
    input: "base.bn.weight"
    input: "base.bn.bias"
    input: "base.bn.running_mean"
    input: "base.bn.running_var"
    output: "9"
    name: "BatchNormalization_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "9"
    output: "10"
    name: "Relu_2"
    op_type: "Relu"
  }
  name: "torch-jit-export"
  initializer {
    dims: 16
    data_type: 1
    name: "base.bn.bias"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "base.bn.running_mean"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "base.bn.running_var"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "base.bn.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "base.conv.bias"
    raw_data: "\252\256=\276\016B\342=\241\3724>\206\377\325=N\017\350=\235<\">\260\355\201\275(\332\226\274\327\325:>\350j%\275{\325;>\340u\227;T\3048\276\300<(=\375\361?>/\373\006\276"
  }
  initializer {
    dims: 16
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "base.conv.weight"
    raw_data: "x\021\325\274\271:@\276@(\371\273\257\245\342\275(S\274<\321\243\037\276\267\323\240\275\240B3\276N1\343\275\022\003\254=\266\277\233=:\354\213=\204`\020\275\n\217\035\276th\345\2753\2545>8\345\016\275\000\222\364;\364\215<=&\024\206\275\300)\020\276^$\334=\004\257i=k\027D>^\304\251\275)C\010\276R\232\355=\203\200\013\276*_\"\276\320\350\025=h\301\245\274X\313\242\274\215\333\035>%\301\377\275\314\3777\276\240.\317\274\346\211A\276\3502\221<M\275!>\240\311&=\340T\345\274\307#\245\275\000y9\275\3105\323\275\253\354$\276\250j\'=~\215\267=\360\342;=\246v\312\275\226\235\357=\354\307v\275\212\032\326=e\365\001>t/A\276\200`\356\2720\022L=\nW\340=\236[\245=N\267\223=\341\304\001>Z\277\262=\030c\020\276.\037\272\275>\340\302=h\263Q\275~\357\354\275\024\311\371\275\3507/\275\201\233\017>\246\365\266\275:,\230=\232\017\352=+\3753>.\271\230=#/\022>\036\206+\276\030\325m\27518\275\275\366\204\206\275\356\327\275=\247\177\310\275\024\302#\276(\236b=\000\210E=x\355\260\274\340K\010\275\252y\202= T\334<>\234\334=Z\345\205=\350\003\235<5\2020>\032\320$\276\036\360\347=%D\001>)\370\014>`\374\323;~\r\374=F\023\353=\306\010\231=o\372\036>\007\224\224\275\341\234+>\265O\213\275P&g=P\227\010\275z\267\217\275\350\363\241\274\227\"B\276\233\'8>\313\376\020\276\264\335\r\276\255X\247\275\307\2359>},\002>\314\332L=(C?=0\020\215<\030\000\353\2745h+\276\000D\234\275\353\200\001> ps\275\271\335*\276\021D8>\275\016\007>\000mH\274\301\216\037>\240\'\242\274D8Y\275(\r\273\274\010H\003\276>\217\241=P\253P\274k\022$\276\272Z\375=f\342+\276\222\231\375=\374\375W\275\262\252\013\276\244\244W\275\374\334>\275@\214\'\276$rG=\na\335\275\014\316\271\275\341g&>\037\275\'>6C\336=\332\237\310=\252z\234=hT\303<\004\363p=\320\013w<\033]5>\210\343\r=.\033\333\275\350\001\241\274(\321\212<X(\210\275\331\215\026\276\010\271]\275\256^\261=\014)p\275eO\213\2752F\233=_\242\022\276\205\236=>\327\245;>2\263\323\275\352\340\034\276\206]\371=\\\022L=\366\247\216=\336\211\370=\010i\336\274\240\031\032\275\225\232\255\275\200\213\021<@\320x\273\000\262\376<\243\237\270\275\273`\343\275H\033\237\274\365\213\231\275\210\326\353\274\324\'k=0\251 \276<\263x==\331 >\347\315\030>\230\321\030\276z\332\217=\334\201\t\276\250q\245\274\360\214\214\274\0109H\2750\327W=\027@9>\340\371K=\242Q\214=r,\310\275\205\034\n>\252\370\357=\270F\252<\367\227>>\331\360\022\276\314/\231\275\177s\374\275@2!=\200\347$;*\273\230=\354\203\022=\010q\203<\370\205\247\274\204\375\014=y\361\333\275\03337\276(X-=\364\362:\275i\345@>@\230?\276\374l\024=\240/q\275`\207\262;\260\2524=\017\267\343\275\010\333\367\274\252\200\345=\000e\220\274\304\021c=\346\001\205=loq=\037W#>.D\026\2768\271[=+{$>x\020\030\275\320\237\021\274\325r\306\275`>\321<,\235K\275\240\350!\275\325\345\007>\254\304#=`\246\215<X\241N=|\2578\276EE\363\275^f\353=\300\357\362\273F(\n\276>\243\376=`\355*\275\324\034}=r\\\266=\274J%\276\3758\337\275\303i7\276\210\374\t\275-\022\025>J\335\263=\340\n\032=\270\273%=#\316\226\2751`\334\275\240\357\261;\023\217\025\276\300\212\026\275F\361\"\276+\035\">p\351D\274\356\360\321=\036\264\021\276\270\037\026\276\240~<\275\013\031\354\275\024\365?=[\302\216\275\207r0>M\3763>:\021\020\276=\2722\276T[\037\275\206@D\276\300(\253\274\307\376\037>P\231\026\274\224t\t\276\000\2361\274\000\362\005\276\354b%\276\272%\241=\275\254\026>PA\341\274+N\026>k\372\001>\235\373\033>\300\367\325;\204\240-\276H\235$=\322\004\325=\240Z\341\273\022b\005\276\370\317\323\275\337\232\021\276\345.\005>\034\377(\276\247\375+>,\327\027=f\006\265=7\306*>\316\007\344=\000\326\216\274V~\300\2754H\003=\270\212\250<\2079A>\3600\364\274\026\231\364=\300\313\315<8\274*\276\364\320\016=\333\251A\276~D\225=\313\300\022>@\014\300\273\305x\002>\n\272\216=p\333\030\274\202C!\276\004Y!=s\372<>\216\261;\2765\320\001>\317\302\'\276\216c\217=\245\312\031>\230L\206\274\214Q5\275\325|\036>\345\357)>\nW\336=\253\2563\276*\341\377\275\206\215\236=\324\266:=$Z\001\276]\0107\276U\210 >@\377\213\274-\323\017>\021}\324\275\353\\A\276\270p==\374cj\275\313\003\340\275\302G\330=\352\345\201=\331D(>\236G\376= 1\004=\351\371B>\212(\273=7\200\216\275\030\035\003\276\377\311\027\276B\331\224=\2143X\275\256L\351= \252\310\273\256\250\213=\200 \351\272\375\033\r\276\264\271X\275t\256\030\276\256\374\241=\253\235(>\300q\202\275\t,\272\275/k?\276\235q\362\275\323|.>s18>\360t\233\274\n\017\357=\034\241D\276\302Z\362=\270M\036\276\025/\032>\275\361!\276\316\351\366=\261\316\017>\223\243\022\276\356z\321=x\205\344\274\226B\"\276\031\006\374\275\177m/\276\320\331\240<\032\351\353=\325>\335\275\rSB>1\237\r>\220\030:<q\006\251\275y\212,\276\341\227\244\275 \223\330\273\374m\016=\324LR\275\000\333 < [\221\273Q\314\260\275\273\206\030>\312\211\225\275\262\242\323\275\276\230\266\275@\377J;\370c`\275B\340\361=O\034<>\340g\346<\302\244\035\276|\031\010\275hR\027\275\310\204B\276\026L\264=Zi\204=\000\240O\275\267\360\251\275\235\032$>"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 28
          }
          dim {
            dim_value: 28
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 26
          }
          dim {
            dim_value: 26
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
