ir_version: 6
producer_name: "pytorch"
producer_version: "1.6"
graph {
  node {
    input: "x"
    input: "0.weight"
    input: "0.bias"
    output: "Gemm_0_out"
    name: "Gemm_0"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    input: "Gemm_0_out"
    output: "CustomRelu_1_out"
    name: "CustomRelu_1"
    op_type: "CustomRelu"
    attribute {
      name: "alpha"
      f: 0.5
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 0.20000000298023224
      type: FLOAT
    }
    domain: "ONNXImporterTest"
  }
  name: "torch-jit-export"
  initializer {
    dims: 3
    data_type: 1
    name: "0.bias"
    raw_data: "\357\'\307>\316\220\353>\353\017\251>"
  }
  initializer {
    dims: 3
    dims: 3
    data_type: 1
    name: "0.weight"
    raw_data: "\236w\272\276%\252\003\277\265(5\276\335lv>c\323\350>\005\245\002\277\261\360\242>\330\025\016\277\213}\355\276"
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "CustomRelu_1_out"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
opset_import {
  domain: "ONNXImporterTest"
  version: 1
}
