ir_version: 5
domain: "onnx"
# ONNX TensorProto.DataType:
#    UNDEFINED = 0;
#    FLOAT = 1;
#    UINT8 = 2;
#    INT8 = 3;
#    UINT16 = 4;
#    INT16 = 5;
#    INT32 = 6;
#    INT64 = 7;
#    STRING = 8;
#    BOOL = 9;
#    FLOAT16 = 10;
#    DOUBLE = 11;
#    UINT32 = 12;
#    UINT64 = 13;
#    COMPLEX64 = 14;
#    COMPLEX128 = 15;
graph {
   initializer {
       data_type: 7
       name: "max_output_size"
       raw_data: "\003\000\000\000\000\000\000\000"
   }
   initializer {
       data_type: 1
       name: "iou_threshold"
       raw_data: "\000\000\000?"
   }
   initializer {
       data_type: 1
       name: "layer.score_threshold"
       raw_data: "\232\231\031?"
   }
   input {
    name: "boxes"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "scores"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
   node {
       input: "boxes"
       input: "scores"
       input: "max_output_size"
       input: "iou_threshold"
       input: "layer.score_threshold"
       output: "indices"
       output: "numSelected"
       name: "NonMaxSuppressionV4"
       op_type: "NonMaxSuppressionV4"
       attribute {
        name: "pad_to_max_output_size"
        i: 1
        type: INT
      }
       domain: "ai.onnx.converters.tensorflow"
   }

output {
    name: "indices"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
output {
    name: "numSelected"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
