ir_version: 6
producer_name: "onnx-ex"
graph {
  node {
    input: "data"
    input: "pads"
    output: "out"
    op_type: "Pad"
  }

  name: "graph"
  initializer {
    dims: 8
    data_type: 7
    int64_data: 1
    int64_data: 2
    int64_data: -2
    int64_data: 0
    int64_data: 0
    int64_data: -2
    int64_data: 1
    int64_data: 2
    name: "pads"
  }

  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
  output {
    name: "out"
  }
}
opset_import {
  version: 11
}
