ir_version: 7
producer_name: "QuantizeLinear and DequantizeLinear Onnx Example"
graph {
  node {
    input: "x"
    input: "y_scale"
    input: "y_zero_point"
    output: "y"
    op_type: "QuantizeLinear"
  }
  node {
    input: "y"
    input: "y_scale"
    input: "y_zero_point"
    output: "z"
    op_type: "DequantizeLinear"
  }
  name: "unit_test_QuantizedDequantizeLinear"
  initializer {
    dims: 1
    data_type: 1
    float_data: 0.01961481384932995
    name: "y_scale"
  }
  initializer {
    dims: 1
    data_type: 3
    name: "y_zero_point"
    raw_data: "\000"
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "y_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "y_zero_point"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "z"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 10
}
