ir_version: 6
producer_name: "Range-onnx-example"
graph {
  node {
    output: "start"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 6
        int32_data: 10
        name: "const_tensor_1"
      }
      type: TENSOR
    }
  }
  node {
    output: "limit"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 6
        int32_data: 6
        name: "const_tensor_2"
      }
      type: TENSOR
    }
  }
  node {
    output: "delta"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 6
        int32_data: -3
        name: "const_tensor_3"
      }
      type: TENSOR
    }
  }
  node {
    input: "start"
    input: "limit"
    input: "delta"
    output: "Y"
    op_type: "Range"
  }
  name: "Range-node"
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 11
}
