ir_version: 6
producer_name: "ReduceL2-onnx-example"
graph {
  node {
    input: "input"
    output: "Y"
    op_type: "ReduceL2"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "ReduceL2-node"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 11
}
