ir_version: 3
producer_name: "backend-test"
graph {
  node {
    input: "in"
    input: "roi"     # using empty tensor ("")
    input: "scales"
    output: "out"
    name: "resizeNearest"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
  }
  name: "test-model"
  initializer {
    dims: 4
    data_type: 1
    float_data: 1.0
    float_data: 1.0
    float_data: 2.0
    float_data: 2.0
   name: "scales"
  }
  initializer {
    dims: 0
    data_type: 1
    name: "roi"
    raw_data: ""
  }
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 1
        shape {
         dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "out"
    type {
      tensor_type {
        elem_type: 1
        shape {
         dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
