ir_version: 5
domain: "onnx"
graph {
  node {
    input: "in"
    input: "roi"  # using empty tensor ("")
    input: "roi"  # using empty tensor ("")
    input: "sizes"
    output: "out"
    name: "resizeNearest"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
  }
  name: "test-model"
  initializer {
    dims: 4
    data_type: 7
    int64_data: 2
    int64_data: 2
    int64_data: 4
    int64_data: 4
   name: "sizes"
  }
  initializer {
    dims: 0
    data_type: 1
    name: "roi"
    raw_data: ""
  }
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 1
        shape {
         dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "out"
    type {
      tensor_type {
        elem_type: 1
        shape {
         dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
