ir_version: 5
producer_name: "onnx-rnn"
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: ""
    input: "initial_h"
    output: "Y"
    output: "Y_h"
    name: "rnn"
    op_type: "RNN"
    attribute {
      name: "direction"
      s: "bidirectional"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 4
      type: INT
    }
  }
  node {
    input: "Y"
    input: "Y_ref"
    output: "Y_err"
    name: "error"
    op_type: "Sub"
  }
  name: "rnn_test"
  initializer {
    dims: 2
    dims: 5
    dims: 3
    data_type: 1
    float_data: 1.6243454217910767
    float_data: -0.6117563843727112
    float_data: -0.5281717777252197
    float_data: -1.072968602180481
    float_data: 0.8654076457023621
    float_data: -2.3015387058258057
    float_data: 1.744811773300171
    float_data: -0.7612069249153137
    float_data: 0.31903910636901855
    float_data: -0.24937038123607635
    float_data: 1.4621078968048096
    float_data: -2.060140609741211
    float_data: -0.3224171996116638
    float_data: -0.38405436277389526
    float_data: 1.1337693929672241
    float_data: -1.0998913049697876
    float_data: -0.1724282056093216
    float_data: -0.8778584003448486
    float_data: 0.042213745415210724
    float_data: 0.5828152298927307
    float_data: -1.1006191968917847
    float_data: 1.144723653793335
    float_data: 0.9015907049179077
    float_data: 0.5024943351745605
    float_data: 0.9008559584617615
    float_data: -0.6837278604507446
    float_data: -0.12289022654294968
    float_data: -0.9357694387435913
    float_data: -0.26788806915283203
    float_data: 0.5303554534912109
    name: "X"
  }
  initializer {
    dims: 2
    dims: 4
    dims: 3
    data_type: 1
    float_data: -0.6916607618331909
    float_data: -0.3967535197734833
    float_data: -0.6871727108955383
    float_data: -0.8452056646347046
    float_data: -0.6712461113929749
    float_data: -0.01266459934413433
    float_data: -1.1173104047775269
    float_data: 0.2344156950712204
    float_data: 1.6598021984100342
    float_data: 0.7420441508293152
    float_data: -0.19183555245399475
    float_data: -0.887628972530365
    float_data: -0.7471582889556885
    float_data: 1.6924545764923096
    float_data: 0.050807755440473557
    float_data: -0.6369956731796265
    float_data: 0.19091548025608063
    float_data: 2.100255250930786
    float_data: 0.12015895545482635
    float_data: 0.6172031164169312
    float_data: 0.30017033219337463
    float_data: -0.3522498607635498
    float_data: -1.142518162727356
    float_data: -0.3493427336215973
    name: "W"
  }
  initializer {
    dims: 2
    dims: 4
    dims: 4
    data_type: 1
    float_data: -0.20889423787593842
    float_data: 0.5866231918334961
    float_data: 0.838983416557312
    float_data: 0.9311020970344543
    float_data: 0.2855873107910156
    float_data: 0.8851411938667297
    float_data: -0.7543979287147522
    float_data: 1.2528681755065918
    float_data: 0.5129297971725464
    float_data: -0.2980928421020508
    float_data: 0.4885181486606598
    float_data: -0.07557171583175659
    float_data: 1.1316293478012085
    float_data: 1.5198168754577637
    float_data: 2.185575485229492
    float_data: -1.396496295928955
    float_data: -1.444113850593567
    float_data: -0.5044658780097961
    float_data: 0.1600370705127716
    float_data: 0.8761689066886902
    float_data: 0.31563493609428406
    float_data: -2.0222012996673584
    float_data: -0.30620402097702026
    float_data: 0.8279746174812317
    float_data: 0.23009473085403442
    float_data: 0.7620111703872681
    float_data: -0.22232814133167267
    float_data: -0.20075806975364685
    float_data: 0.18656139075756073
    float_data: 0.4100516438484192
    float_data: 0.19829972088336945
    float_data: 0.11900864541530609
    name: "R"
  }
  initializer {
    dims: 2
    dims: 8
    data_type: 1
    float_data: -0.6706622838973999
    float_data: 0.3775637745857239
    float_data: 0.12182126939296722
    float_data: 1.129483938217163
    float_data: 1.1989178657531738
    float_data: 0.1851564198732376
    float_data: -0.37528494000434875
    float_data: -0.6387304067611694
    float_data: 0.4234943687915802
    float_data: 0.07734006643295288
    float_data: -0.3438536822795868
    float_data: 0.04359685629606247
    float_data: -0.6200008392333984
    float_data: 0.698032021522522
    float_data: -0.447128564119339
    float_data: 1.2245076894760132
    name: "B"
  }
  initializer {
    dims: 2
    dims: 5
    dims: 4
    data_type: 1
    float_data: 0.40349164605140686
    float_data: 0.5935785174369812
    float_data: -1.094911813735962
    float_data: 0.16938243806362152
    float_data: 0.7405564785003662
    float_data: -0.953700602054596
    float_data: -0.26621851325035095
    float_data: 0.03261454775929451
    float_data: -1.3731173276901245
    float_data: 0.3151593804359436
    float_data: 0.8461606502532959
    float_data: -0.8595159649848938
    float_data: 0.3505459725856781
    float_data: -1.3122833967208862
    float_data: -0.03869551047682762
    float_data: -1.6157723665237427
    float_data: 1.121417760848999
    float_data: 0.40890052914619446
    float_data: -0.02461695671081543
    float_data: -0.775161623954773
    float_data: 1.2737559080123901
    float_data: 1.9671016931533813
    float_data: -1.8579819202423096
    float_data: 1.2361639738082886
    float_data: 1.6276507377624512
    float_data: 0.3380116820335388
    float_data: -1.1992679834365845
    float_data: 0.8633453249931335
    float_data: -0.1809203028678894
    float_data: -0.6039206385612488
    float_data: -1.230058193206787
    float_data: 0.5505374670028687
    float_data: 0.79280686378479
    float_data: -0.6235307455062866
    float_data: 0.5205763578414917
    float_data: -1.1443413496017456
    float_data: 0.801861047744751
    float_data: 0.04656729847192764
    float_data: -0.18656976521015167
    float_data: -0.10174587368965149
    name: "initial_h"
  }
  initializer {
    dims: 2
    dims: 2
    dims: 5
    dims: 4
    data_type: 1
    float_data: -0.45148125290870667
    float_data: 0.8580722808837891
    float_data: -0.9985259771347046
    float_data: 0.7663594484329224
    float_data: 0.9218851327896118
    float_data: 0.482989639043808
    float_data: -0.9727051258087158
    float_data: 0.32090744376182556
    float_data: -0.211223766207695
    float_data: -0.9772961139678955
    float_data: -0.9743536114692688
    float_data: 0.9985752701759338
    float_data: -0.6877351999282837
    float_data: -0.9969276189804077
    float_data: -0.982924222946167
    float_data: 0.9845561981201172
    float_data: -0.5457136631011963
    float_data: 0.6686283349990845
    float_data: 0.9836246967315674
    float_data: 0.9774985909461975
    float_data: 0.335388720035553
    float_data: 0.6916792392730713
    float_data: -0.9845194220542908
    float_data: 0.8437544107437134
    float_data: 0.9995257258415222
    float_data: -0.9428508281707764
    float_data: -0.9480809569358826
    float_data: 0.8326057195663452
    float_data: -0.9999346137046814
    float_data: -0.9651963710784912
    float_data: 0.19803036749362946
    float_data: 0.9517099857330322
    float_data: 0.9996784329414368
    float_data: -0.9930374622344971
    float_data: -0.5350282192230225
    float_data: 0.24005824327468872
    float_data: 0.7219301462173462
    float_data: 0.9627499580383301
    float_data: -0.2298121303319931
    float_data: 0.9322798252105713
    float_data: 0.9847443699836731
    float_data: 0.9992781281471252
    float_data: -0.9146249294281006
    float_data: -0.9620317816734314
    float_data: 0.5353466868400574
    float_data: 0.9623233079910278
    float_data: -0.973820149898529
    float_data: 0.5302093625068665
    float_data: -0.8817073702812195
    float_data: 0.04437653347849846
    float_data: -0.6939622759819031
    float_data: -0.9997662305831909
    float_data: -0.08797658979892731
    float_data: 0.8203943967819214
    float_data: -0.9773381948471069
    float_data: -0.9997087121009827
    float_data: 0.9963991045951843
    float_data: 0.9850799441337585
    float_data: 0.9116132855415344
    float_data: 0.5082464814186096
    float_data: -0.9421876668930054
    float_data: -0.983150064945221
    float_data: 0.5809367299079895
    float_data: 0.9948753714561462
    float_data: -0.8494287133216858
    float_data: -0.4926595985889435
    float_data: -0.031167631968855858
    float_data: 0.8562292456626892
    float_data: 0.8743059635162354
    float_data: 0.9971169829368591
    float_data: -0.277532160282135
    float_data: -0.6643405556678772
    float_data: -0.9989643692970276
    float_data: 0.21379974484443665
    float_data: -0.8668692111968994
    float_data: 0.9266505241394043
    float_data: -0.8409050703048706
    float_data: 0.9882599115371704
    float_data: -0.5564477443695068
    float_data: 0.9506130218505859
    name: "Y_ref"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "Y_ref"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y_err"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
