ir_version: 5
producer_name: "onnx-rnn"
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: ""
    input: "initial_h"
    output: "Y"
    output: "Y_h"
    name: "rnn"
    op_type: "RNN"
    attribute {
      name: "direction"
      s: "forward"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 4
      type: INT
    }
  }
  node {
    input: "Y"
    input: "Y_ref"
    output: "Y_err"
    name: "error"
    op_type: "Sub"
  }
  name: "rnn_test"
  initializer {
    dims: 2
    dims: 5
    dims: 3
    data_type: 1
    float_data: 1.6243454217910767
    float_data: -0.6117563843727112
    float_data: -0.5281717777252197
    float_data: -1.072968602180481
    float_data: 0.8654076457023621
    float_data: -2.3015387058258057
    float_data: 1.744811773300171
    float_data: -0.7612069249153137
    float_data: 0.31903910636901855
    float_data: -0.24937038123607635
    float_data: 1.4621078968048096
    float_data: -2.060140609741211
    float_data: -0.3224171996116638
    float_data: -0.38405436277389526
    float_data: 1.1337693929672241
    float_data: -1.0998913049697876
    float_data: -0.1724282056093216
    float_data: -0.8778584003448486
    float_data: 0.042213745415210724
    float_data: 0.5828152298927307
    float_data: -1.1006191968917847
    float_data: 1.144723653793335
    float_data: 0.9015907049179077
    float_data: 0.5024943351745605
    float_data: 0.9008559584617615
    float_data: -0.6837278604507446
    float_data: -0.12289022654294968
    float_data: -0.9357694387435913
    float_data: -0.26788806915283203
    float_data: 0.5303554534912109
    name: "X"
  }
  initializer {
    dims: 1
    dims: 4
    dims: 3
    data_type: 1
    float_data: -0.6916607618331909
    float_data: -0.3967535197734833
    float_data: -0.6871727108955383
    float_data: -0.8452056646347046
    float_data: -0.6712461113929749
    float_data: -0.01266459934413433
    float_data: -1.1173104047775269
    float_data: 0.2344156950712204
    float_data: 1.6598021984100342
    float_data: 0.7420441508293152
    float_data: -0.19183555245399475
    float_data: -0.887628972530365
    name: "W"
  }
  initializer {
    dims: 1
    dims: 4
    dims: 4
    data_type: 1
    float_data: -0.7471582889556885
    float_data: 1.6924545764923096
    float_data: 0.050807755440473557
    float_data: -0.6369956731796265
    float_data: 0.19091548025608063
    float_data: 2.100255250930786
    float_data: 0.12015895545482635
    float_data: 0.6172031164169312
    float_data: 0.30017033219337463
    float_data: -0.3522498607635498
    float_data: -1.142518162727356
    float_data: -0.3493427336215973
    float_data: -0.20889423787593842
    float_data: 0.5866231918334961
    float_data: 0.838983416557312
    float_data: 0.9311020970344543
    name: "R"
  }
  initializer {
    dims: 1
    dims: 8
    data_type: 1
    float_data: 0.2855873107910156
    float_data: 0.8851411938667297
    float_data: -0.7543979287147522
    float_data: 1.2528681755065918
    float_data: 0.5129297971725464
    float_data: -0.2980928421020508
    float_data: 0.4885181486606598
    float_data: -0.07557171583175659
    name: "B"
  }
  initializer {
    dims: 1
    dims: 5
    dims: 4
    data_type: 1
    float_data: 1.1316293478012085
    float_data: 1.5198168754577637
    float_data: 2.185575485229492
    float_data: -1.396496295928955
    float_data: -1.444113850593567
    float_data: -0.5044658780097961
    float_data: 0.1600370705127716
    float_data: 0.8761689066886902
    float_data: 0.31563493609428406
    float_data: -2.0222012996673584
    float_data: -0.30620402097702026
    float_data: 0.8279746174812317
    float_data: 0.23009473085403442
    float_data: 0.7620111703872681
    float_data: -0.22232814133167267
    float_data: -0.20075806975364685
    float_data: 0.18656139075756073
    float_data: 0.4100516438484192
    float_data: 0.19829972088336945
    float_data: 0.11900864541530609
    name: "initial_h"
  }
  initializer {
    dims: 2
    dims: 1
    dims: 5
    dims: 4
    data_type: 1
    float_data: 0.995133101940155
    float_data: 0.9849269390106201
    float_data: -0.9999507069587708
    float_data: 0.9995103478431702
    float_data: 0.9853355884552002
    float_data: 0.16543281078338623
    float_data: -0.997900128364563
    float_data: 0.9967726469039917
    float_data: -0.9997661113739014
    float_data: -0.999443531036377
    float_data: -0.76016765832901
    float_data: 0.9211682081222534
    float_data: 0.9954423904418945
    float_data: 0.8707559108734131
    float_data: -0.9944164752960205
    float_data: 0.9882575273513794
    float_data: 0.7082530856132507
    float_data: 0.9702828526496887
    float_data: 0.9103541970252991
    float_data: 0.44952985644340515
    float_data: 0.9857034087181091
    float_data: 0.9996979236602783
    float_data: 0.20754873752593994
    float_data: 0.9267740845680237
    float_data: 0.15137363970279694
    float_data: 0.835163414478302
    float_data: -0.7503851652145386
    float_data: 0.9677680730819702
    float_data: -0.9787185788154602
    float_data: -0.9927014112472534
    float_data: 0.09882879257202148
    float_data: 0.8483477234840393
    float_data: 0.5234431624412537
    float_data: 0.9925646781921387
    float_data: -0.6929914951324463
    float_data: 0.9859257936477661
    float_data: 0.9680604338645935
    float_data: 0.9994627237319946
    float_data: 0.26439833641052246
    float_data: 0.9311693906784058
    name: "Y_ref"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "Y_ref"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y_err"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
