ir_version: 3
producer_name: "test4glow"
opset_import {
  version: 7
}

graph {
  node {
    input: "input"
    output: "shape_out"
    name: "s1"
    op_type: "Shape"
  }
  node {
    input: "shape_out"
    output: "output"
    name: "s2"
    op_type: "Shape"
  }
  name: "test-model"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
