ir_version: 3
producer_name: "test4glow"
opset_import { 
  version: 7
}

graph {
  name: "test-model"
  node {
    input: "data"
    output: "out"
    name: "slice"
    op_type: "Slice"
    attribute {
      name: "starts"
      ints: 0
      ints: 1
      ints: -2
      ints: 1
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 2
      ints: 2
      ints: 50
      ints: 3
      type: INTS
    }
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "out"
  }
}
