ir_version: 3
producer_name: "caffe2"
graph {
  node {
    input: "data"
    input: "indices"
    input: "lengths"
    output: "out"
    name: ""
    op_type: "SparseLengthsSum"
  }
  input {
    name: "weights"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "indices"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "lengths"
    type {
      tensor_type {
        elem_type: INT32
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "out"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 7
}
