ir_version: 3
producer_name: "backend-test"
graph {
  node {
    input: "x"
    output: "y"
    op_type: "Sum"
  }
  name: "test_sum_with_1_input"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
