ir_version: 3
producer_name: "backend-test"
graph {
  node {
    input: "i0"
    input: "i1"
    input: "i2"
    output: "y"
    op_type: "Sum"
  }
  name: "test_sum_with_3_input"
  input {
    name: "i0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "i1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "i2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
