ir_version: 5
producer_name: "onnx-example"
graph {
  node {
    output: "indices"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        int64_data: 1
        int64_data: 2
        int64_data: 2
        int64_data: 3
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    input: "indices"
    output: "result"
    op_type: "Tile"
  }
  name: "test-model"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "result"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}

