ir_version: 6
producer_name: "onnx-ex"
graph {
  node {
    input: "X1"
    output: "output0"
    op_type: "Transpose"
  }
  name: "graph"
  input {
    name: "X1"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "output0"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
