ir_version: 6
producer_name: "upsample-onnx-example"
graph {
  node {
    input: "input"
    output: "Y"
    op_type: "Upsample"
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "scales"
      floats: 1.0
      floats: 1.0
      floats: 2.0
      floats: 3.0
      type: FLOATS
    }
  }
  name: "upsample-node"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 7
}
