ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "X"
    output: "quantizeQ"
    name: "quantizeQ"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.00784313772
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "quantizeQ"
    output: "Acos"
    name: "Acos"
    op_type: "Glow_Acos"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.00784313772
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.0123137264
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: -128
      type: INT
    }
  }
  node {
    input: "Acos"
    output: "dequantize"
    name: "dequantize"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.0123137264
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: -128
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 6
      type: INTS
    }
  }
  node {
    input: "dequantize"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 6
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
