ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "prod"
    name: "prod"
    op_type: "Glow_BatchedPairwiseDotProduct"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "Inputs"
      strings: "X"
      strings: "X__1"
      strings: "Y"
      strings: "Z"
      type: STRINGS
    }
    attribute {
      name: "Inputs_i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "Inputs_i0_shape"
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "Inputs_i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "Inputs_i1_shape"
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "Inputs_i2_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "Inputs_i2_shape"
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "Inputs_i3_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "Inputs_i3_shape"
      ints: 2
      ints: 6
      type: INTS
    }
  }
  node {
    input: "prod"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 6
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "Z"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "X__1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
