ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "batch"
    output: "batched_reduce_add"
    name: "batched_reduce_add"
    op_type: "Glow_BatchedReduceAdd"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      ints: 4
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.5
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 3
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 2
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: -1
      type: INT
    }
    attribute {
      name: "Axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "batched_reduce_add"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 2
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: -1
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o1_qScale"
      f: 2
      type: FLOAT
    }
    attribute {
      name: "o1_qOffset"
      i: -1
      type: INT
    }
  }
  name: "glow"
  input {
    name: "batch"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:0.500000000000000000000000000000$qOffset:3"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:2.000000000000000000000000000000$qOffset:-1$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
