ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "batch"
    output: "reduce_add"
    name: "reduce_add"
    op_type: "Glow_BatchedReduceAdd"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      type: INTS
    }
    attribute {
      name: "Axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "reduce_mean_splat"
    name: "reduce_mean_splat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      type: INTS
    }
    attribute {
      name: "Value"
      f: 4
      type: FLOAT
    }
  }
  node {
    input: "reduce_add"
    input: "reduce_mean_splat"
    output: "reduce_mean_div"
    name: "reduce_mean_div"
    op_type: "Glow_Div"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      type: INTS
    }
  }
  node {
    input: "reduce_mean_div"
    output: "saveRM"
    name: "saveRM_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      type: INTS
    }
  }
  node {
    input: "reduce_add"
    output: "saveRA"
    name: "saveRA_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "batch"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:N$elemKind:float"
  }
  output {
    name: "saveRA"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveRA_save"
  }
  output {
    name: "saveRM"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveRM_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
