ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "batch"
    output: "reduce_add_axis_2"
    name: "reduce_add_axis_2"
    op_type: "Glow_BatchedReduceAdd"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "Axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "reduce_add_axis_2"
    output: "save2"
    name: "save2_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "batch"
    output: "reduce_add_axis_1"
    name: "reduce_add_axis_1"
    op_type: "Glow_BatchedReduceAdd"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "Axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "reduce_add_axis_1"
    output: "save1"
    name: "save1_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "batch"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  output {
    name: "save1"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save1_save"
  }
  output {
    name: "save2"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save2_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
