ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "data"
    input: "lengths"
    input: "values"
    output: "BOH"
    name: "BOH"
    op_type: "Glow_BatchOneHot"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 6
      type: INTS
    }
  }
  node {
    input: "BOH"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 6
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      ints: 6
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "values"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:N$elemKind:index64"
  }
  input {
    name: "lengths"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:N$elemKind:index32"
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
