ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "A"
    output: "tr"
    name: "tr"
    op_type: "Glow_Transpose"
    attribute {
      name: "i0_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 20
      ints: 13
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 13
      ints: 20
      type: INTS
    }
    attribute {
      name: "Shuffle"
      ints: 1
      ints: 0
      type: INTS
    }
    attribute {
      name: "Layout"
      s: "*"
      type: STRING
    }
  }
  node {
    input: "tr"
    output: "saveTranspose"
    name: "saveTranspose_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 13
      ints: 20
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 13
      ints: 20
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bool"
  }
  output {
    name: "saveTranspose"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 20
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bool$saveName:saveTranspose_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
