ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "zero__3"
    name: "zero__3"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "Value"
      f: 0
      type: FLOAT
    }
  }
  node {
    output: "zero__2"
    name: "zero__2"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "Value"
      f: 0
      type: FLOAT
    }
  }
  node {
    input: "zero__2"
    input: "QB"
    output: "broadcastedQ_tile1__1"
    name: "broadcastedQ_tile1__1"
    op_type: "Glow_InsertTensor"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Count"
      i: 4
      type: INT
    }
    attribute {
      name: "Axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "zero__3"
    input: "broadcastedQ_tile1__1"
    output: "broadcastedQ_tile2__1"
    name: "broadcastedQ_tile2__1"
    op_type: "Glow_InsertTensor"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Count"
      i: 2
      type: INT
    }
    attribute {
      name: "Axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "broadcastedQ_tile2__1"
    output: "saveQ"
    name: "saveQ_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "o1_qOffset"
      i: -2
      type: INT
    }
  }
  node {
    output: "zero__1"
    name: "zero__1"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0
      type: FLOAT
    }
  }
  node {
    output: "zero"
    name: "zero"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0
      type: FLOAT
    }
  }
  node {
    input: "zero"
    input: "B"
    output: "broadcasted_tile1__1"
    name: "broadcasted_tile1__1"
    op_type: "Glow_InsertTensor"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Count"
      i: 4
      type: INT
    }
    attribute {
      name: "Axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "zero__1"
    input: "broadcasted_tile1__1"
    output: "broadcasted_tile2__1"
    name: "broadcasted_tile2__1"
    op_type: "Glow_InsertTensor"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Count"
      i: 2
      type: INT
    }
    attribute {
      name: "Axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "broadcasted_tile2__1"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 4
      ints: 2
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "QB"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:1.100000023841857910156250000000$qOffset:-2"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
  output {
    name: "saveQ"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:1.100000023841857910156250000000$qOffset:-2$saveName:saveQ_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
