ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input2"
    output: "bucketize2"
    name: "bucketize2"
    op_type: "Glow_Bucketize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "Boundaries"
      floats: 0.1
      floats: 2.5
      type: FLOATS
    }
  }
  node {
    input: "bucketize2"
    output: "save2"
    name: "save2_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      ints: 2
      type: INTS
    }
  }
  node {
    input: "input1"
    output: "bucketize1"
    name: "bucketize1"
    op_type: "Glow_Bucketize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "Boundaries"
      floats: 0.1
      floats: 2.5
      type: FLOATS
    }
  }
  node {
    input: "bucketize1"
    output: "save1"
    name: "save1_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "input1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "input2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save1"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32$saveName:save1_save"
  }
  output {
    name: "save2"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32$saveName:save2_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
