ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "clip_minSplat"
    name: "clip_minSplat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "Value"
      f: 20
      type: FLOAT
    }
  }
  node {
    input: "X"
    input: "clip_minSplat"
    output: "clip_minClip"
    name: "clip_minClip"
    op_type: "Glow_Max"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 5
      ints: 5
      type: INTS
    }
  }
  node {
    output: "clip_maxSplat"
    name: "clip_maxSplat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "Value"
      f: 60
      type: FLOAT
    }
  }
  node {
    input: "clip_minClip"
    input: "clip_maxSplat"
    output: "clip__1"
    name: "clip__1"
    op_type: "Glow_Min"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 5
      ints: 5
      type: INTS
    }
  }
  node {
    input: "clip__1"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 5
      ints: 5
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
