ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "RHS"
    input: "LHS"
    output: "cmpGTE"
    name: "cmpGTE"
    op_type: "Glow_CmpLTE"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
  }
  node {
    input: "cmpGTE"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "LHS"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  input {
    name: "RHS"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bool$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
