ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    input: "filterD__1"
    input: "bias__1"
    output: "ConvTranspose"
    name: "ConvTranspose"
    op_type: "Glow_ConvTranspose"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 1
      ints: 6
      ints: 6
      ints: 1
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 7
      ints: 7
      ints: 1
      type: INTS
    }
    attribute {
      name: "Kernels"
      ints: 6
      ints: 6
      type: INTS
    }
    attribute {
      name: "Strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Group"
      i: 1
      type: INT
    }
    attribute {
      name: "Dilation"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "ConvTranspose"
    output: "saveD"
    name: "saveD_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 7
      ints: 7
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 7
      ints: 7
      ints: 1
      type: INTS
    }
  }
  node {
    input: "input"
    input: "filterC__1"
    input: "bias__1"
    output: "conv"
    name: "conv"
    op_type: "Glow_Convolution"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 1
      ints: 6
      ints: 6
      ints: 1
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 7
      ints: 7
      ints: 1
      type: INTS
    }
    attribute {
      name: "Kernels"
      ints: 6
      ints: 6
      type: INTS
    }
    attribute {
      name: "Strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Pads"
      ints: 4
      ints: 4
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "Group"
      i: 1
      type: INT
    }
    attribute {
      name: "Dilation"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Layout"
      s: "NHWC"
      type: STRING
    }
    attribute {
      name: "FusedActivation"
      s: "NONE"
      type: STRING
    }
    attribute {
      name: "FusedActivationArgs"
      type: FLOATS
    }
  }
  node {
    input: "conv"
    output: "saveC"
    name: "saveC_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 7
      ints: 7
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 7
      ints: 7
      ints: 1
      type: INTS
    }
  }
  name: "glow"
  initializer {
    dims: 1
    dims: 6
    dims: 6
    dims: 1
    data_type: 1
    name: "filterC__1"
    doc_string: "$elemKind:float$layout:*"
  }
  initializer {
    dims: 1
    dims: 6
    dims: 6
    dims: 1
    data_type: 1
    name: "filterD__1"
    doc_string: "$elemKind:float$layout:*"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "bias__1"
    doc_string: "$elemKind:float$layout:*"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "saveC"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveC_save"
  }
  output {
    name: "saveD"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveD_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
