ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "data"
    output: "convert"
    name: "convert"
    op_type: "Glow_ConvertTo"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 5
      ints: 3
      ints: 20
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 5
      ints: 3
      ints: 20
      type: INTS
    }
  }
  node {
    input: "convert"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 5
      ints: 3
      ints: 20
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 5
      ints: 3
      ints: 20
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 20
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 20
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
