ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    input: "filter"
    input: "bias"
    output: "Conv"
    name: "Conv"
    op_type: "Glow_Convolution"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 1
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "Kernels"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "Strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Group"
      i: 1
      type: INT
    }
    attribute {
      name: "Dilation"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Layout"
      s: "NHWC"
      type: STRING
    }
    attribute {
      name: "FusedActivation"
      s: "NONE"
      type: STRING
    }
    attribute {
      name: "FusedActivationArgs"
      type: FLOATS
    }
  }
  node {
    input: "Conv"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  input {
    name: "filter"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
