ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    output: "inputQ"
    name: "inputQ"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 4
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      ints: 4
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.00784313772
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "inputQ"
    input: "filter__2"
    input: "bias__2"
    output: "Conv3DQ"
    name: "Conv3DQ"
    op_type: "Glow_Convolution3D"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 4
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.00784313772
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 1
      ints: 1
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.00784313772
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i2_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "i2_qScale"
      f: 0.00784313772
      type: FLOAT
    }
    attribute {
      name: "i2_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.0313725509
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "Kernels"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "Strides"
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Group"
      i: 1
      type: INT
    }
  }
  node {
    input: "Conv3DQ"
    output: "deQ"
    name: "deQ"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.0313725509
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
  }
  node {
    input: "deQ"
    output: "saveQ"
    name: "saveQ_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
  }
  node {
    input: "input"
    input: "filter__1"
    input: "bias__1"
    output: "Conv3D"
    name: "Conv3D"
    op_type: "Glow_Convolution3D"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 4
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 1
      ints: 1
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
    attribute {
      name: "Kernels"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "Strides"
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Group"
      i: 1
      type: INT
    }
  }
  node {
    input: "Conv3D"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 4
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
  }
  name: "glow"
  initializer {
    dims: 1
    dims: 1
    dims: 2
    dims: 3
    dims: 1
    data_type: 1
    name: "filter__1"
    doc_string: "$elemKind:float$layout:*"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "bias__1"
    doc_string: "$elemKind:float$layout:*"
  }
  initializer {
    dims: 1
    dims: 1
    dims: 2
    dims: 3
    dims: 1
    data_type: 3
    name: "filter__2"
    doc_string: "$elemKind:i8$qScale:0.007843137718737125396728515625$qOffset:0$layout:*"
  }
  initializer {
    dims: 1
    data_type: 3
    name: "bias__2"
    doc_string: "$elemKind:i8$qScale:0.007843137718737125396728515625$qOffset:0$layout:*"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
  output {
    name: "saveQ"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveQ_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
