ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    output: "dequantize"
    name: "dequantize"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "ui8fused"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      ints: 28
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      ints: 20
      type: INTS
    }
  }
  node {
    input: "dequantize"
    output: "ret"
    name: "ret_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      ints: 20
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 10
      ints: 20
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 28
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:ui8fused$qScale:1.000000000000000000000000000000$qOffset:0"
  }
  output {
    name: "ret"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 20
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:ret_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
