ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "X"
    input: "Y"
    output: "prod_mul"
    name: "prod_mul"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      ints: 14
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      ints: 14
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      ints: 14
      type: INTS
    }
  }
  node {
    input: "prod_mul"
    output: "prod_bra"
    name: "prod_bra"
    op_type: "Glow_BatchedReduceAdd"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      ints: 14
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "Axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "prod_bra"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 10
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "Y"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 14
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 14
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
