ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "data"
    input: "weights__1"
    input: "indices"
    input: "offsets"
    output: "EBBRO"
    name: "EBBRO"
    op_type: "Glow_EmbeddingBagByteRowwiseOffsets"
    attribute {
      name: "i0_elemKind"
      s: "ui8fusedfp16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 5
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "i3_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i3_shape"
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "UseFP16Accumulation"
      i: 1
      type: INT
    }
    attribute {
      name: "HasEndOffset"
      i: 1
      type: INT
    }
    attribute {
      name: "LengthsMode"
      s: "Variable"
      type: STRING
    }
    attribute {
      name: "AvgLength"
      f: nan
      type: FLOAT
    }
  }
  node {
    input: "EBBRO"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 4
      ints: 1
      type: INTS
    }
  }
  name: "glow"
  initializer {
    dims: 3
    dims: 5
    data_type: 2
    name: "data"
    doc_string: "$elemKind:ui8fusedfp16$qScale:0.000000000000000000000000000000$qOffset:0$layout:*"
  }
  initializer {
    dims: 8
    data_type: 10
    name: "weights__1"
    doc_string: "$elemKind:float16$layout:*"
  }
  input {
    name: "offsets"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  input {
    name: "indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
