ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    output: "flip"
    name: "flip"
    op_type: "Glow_Flip"
    attribute {
      name: "i0_elemKind"
      s: "i32"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 4
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i32"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "Axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "flip"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "i32"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 4
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "i32"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 4
      type: INTS
    }
    attribute {
      name: "o1_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "o1_qOffset"
      i: 0
      type: INT
    }
  }
  name: "glow"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i32$qScale:1.000000000000000000000000000000$qOffset:0"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i32$qScale:1.000000000000000000000000000000$qOffset:0$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
