ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "A"
    output: "floordiv_lhs_convert"
    name: "floordiv_lhs_convert"
    op_type: "Glow_ConvertTo"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
  }
  node {
    input: "B"
    output: "floordiv_rhs_convert"
    name: "floordiv_rhs_convert"
    op_type: "Glow_ConvertTo"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
  }
  node {
    input: "floordiv_lhs_convert"
    input: "floordiv_rhs_convert"
    output: "floorDiv_lhs_rhs"
    name: "floorDiv_lhs_rhs"
    op_type: "Glow_Div"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 1
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
  }
  node {
    input: "floorDiv_lhs_rhs"
    output: "floorDiv_floor"
    name: "floorDiv_floor"
    op_type: "Glow_Floor"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
  }
  node {
    input: "floorDiv_floor"
    output: "floordiv_result_convert"
    name: "floordiv_result_convert"
    op_type: "Glow_ConvertTo"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
  }
  node {
    input: "floordiv_result_convert"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 4
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 4
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
