ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "splat"
    name: "splat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "Value"
      f: 10
      type: FLOAT
    }
  }
  node {
    input: "in"
    input: "splat"
    output: "add"
    name: "add"
    op_type: "Glow_Add"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
  }
  node {
    input: "add"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
