ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    input: "batchnorm_weights"
    input: "batchnorm_bias"
    input: "running_mean"
    input: "running_var"
    output: "fp16_batch_norm1d"
    name: "fp16_batch_norm1d"
    op_type: "Glow_BatchNormalization"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i3_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i3_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i4_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i4_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "ChannelIdx"
      i: 1
      type: INT
    }
    attribute {
      name: "Epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "Momentum"
      f: 0.1
      type: FLOAT
    }
  }
  node {
    input: "fp16_batch_norm1d"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  name: "glow"
  initializer {
    dims: 2
    data_type: 10
    name: "batchnorm_bias"
    doc_string: "$elemKind:float16$layout:*"
  }
  initializer {
    dims: 2
    data_type: 10
    name: "batchnorm_weights"
    doc_string: "$elemKind:float16$layout:*"
  }
  initializer {
    dims: 2
    data_type: 10
    name: "running_mean"
    doc_string: "$elemKind:float16$layout:*"
  }
  initializer {
    dims: 2
    data_type: 10
    name: "running_var"
    doc_string: "$elemKind:float16$layout:*"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
