ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "data"
    input: "ranges"
    output: "gatherranges"
    output: "gatherranges:1"
    name: "gatherranges"
    op_type: "Glow_GatherRanges"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "gatherranges:1"
    output: "lengths"
    name: "lengths_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "gatherranges"
    output: "output"
    name: "output_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 5
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 5
      type: INTS
    }
    attribute {
      name: "o1_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "o1_qOffset"
      i: 0
      type: INT
    }
  }
  name: "glow"
  input {
    name: "ranges"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32"
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:N$elemKind:i8$qScale:1.000000000000000000000000000000$qOffset:0"
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:1.000000000000000000000000000000$qOffset:0$saveName:output_save"
  }
  output {
    name: "lengths"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32$saveName:lengths_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
