ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "in"
    input: "in"
    output: "gelu_pow"
    name: "gelu_pow"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    input: "in"
    input: "gelu_pow"
    output: "gelu_pow__1"
    name: "gelu_pow__1"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    output: "gelu_splat"
    name: "gelu_splat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0.044715
      type: FLOAT
    }
  }
  node {
    input: "gelu_pow__1"
    input: "gelu_splat"
    output: "gelu_mul"
    name: "gelu_mul"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    input: "in"
    input: "gelu_mul"
    output: "gelu_add"
    name: "gelu_add"
    op_type: "Glow_Add"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    output: "gelu_alpha"
    name: "gelu_alpha"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0.797884583
      type: FLOAT
    }
  }
  node {
    input: "gelu_add"
    input: "gelu_alpha"
    output: "gelu_mul2"
    name: "gelu_mul2"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    input: "gelu_mul2"
    output: "gelu_tanh"
    name: "gelu_tanh"
    op_type: "Glow_Tanh"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    output: "gelu_splat1"
    name: "gelu_splat1"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "Value"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "gelu_tanh"
    input: "gelu_splat1"
    output: "gelu_add2"
    name: "gelu_add2"
    op_type: "Glow_Add"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    output: "gelu_splatHalf"
    name: "gelu_splatHalf"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0.5
      type: FLOAT
    }
  }
  node {
    input: "gelu_add2"
    input: "gelu_splatHalf"
    output: "gelu_mul3__1"
    name: "gelu_mul3__1"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    input: "gelu_mul3__1"
    input: "in"
    output: "gelu_mul4"
    name: "gelu_mul4"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    input: "gelu_mul4"
    output: "gelu__1"
    name: "gelu_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 7
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "gelu__1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:gelu_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
