ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    input: "batchnorm_weights"
    input: "batchnorm_bias"
    input: "running_mean"
    input: "running_var"
    output: "int8_batch_norm2d"
    name: "int8_batch_norm2d"
    op_type: "Glow_BatchNormalization"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.01
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: -5
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i3_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i3_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i4_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i4_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 3
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.023
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 15
      type: INT
    }
    attribute {
      name: "ChannelIdx"
      i: 3
      type: INT
    }
    attribute {
      name: "Epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "Momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "int8_batch_norm2d"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.023
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 15
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 3
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_qScale"
      f: 0.023
      type: FLOAT
    }
    attribute {
      name: "o1_qOffset"
      i: 15
      type: INT
    }
  }
  name: "glow"
  initializer {
    dims: 2
    data_type: 1
    name: "batchnorm_bias"
    doc_string: "$elemKind:float$layout:*"
  }
  initializer {
    dims: 2
    data_type: 1
    name: "batchnorm_weights"
    doc_string: "$elemKind:float$layout:*"
  }
  initializer {
    dims: 2
    data_type: 1
    name: "running_mean"
    doc_string: "$elemKind:float$layout:*"
  }
  initializer {
    dims: 2
    data_type: 1
    name: "running_var"
    doc_string: "$elemKind:float$layout:*"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:0.009999999776482582092285156250$qOffset:-5"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:0.023000000044703483581542968750$qOffset:15$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
