ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "lhs"
    output: "lhs_q"
    name: "lhs_q"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.075
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: -2
      type: INT
    }
  }
  node {
    input: "rhs"
    output: "rhs_q"
    name: "rhs_q"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.075
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 2
      type: INT
    }
  }
  node {
    input: "lhs_q"
    input: "rhs_q"
    output: "matmul_q"
    name: "matmul_q"
    op_type: "Glow_MatMul"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.075
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: -2
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.075
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 2
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.6
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 4
      type: INT
    }
  }
  node {
    input: "matmul_q"
    output: "dequant"
    name: "dequant"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.6
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 4
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "dequant"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "rhs"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "lhs"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
