ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "logitDiff_onesSplat"
    name: "logitDiff_onesSplat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "Value"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "logitDiff_onesSplat"
    input: "input"
    output: "sub"
    name: "sub"
    op_type: "Glow_Sub"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    output: "logitDiff_clip_minSplat"
    name: "logitDiff_clip_minSplat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "Value"
      f: 1e-06
      type: FLOAT
    }
  }
  node {
    input: "input"
    input: "logitDiff_clip_minSplat"
    output: "logitDiff_clip_minClip"
    name: "logitDiff_clip_minClip"
    op_type: "Glow_Max"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "sub"
    input: "logitDiff_clip_minSplat"
    output: "logitCompl_clip_minClip"
    name: "logitCompl_clip_minClip"
    op_type: "Glow_Max"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    output: "logitDiff_clip_maxSplat"
    name: "logitDiff_clip_maxSplat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0.999999
      type: FLOAT
    }
  }
  node {
    input: "logitCompl_clip_minClip"
    input: "logitDiff_clip_maxSplat"
    output: "logitCompl_clip__1"
    name: "logitCompl_clip__1"
    op_type: "Glow_Min"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitDiff_onesSplat"
    input: "logitCompl_clip__1"
    output: "logitCompl_sub"
    name: "logitCompl_sub"
    op_type: "Glow_Sub"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitCompl_clip__1"
    input: "logitCompl_sub"
    output: "logitCompl_div"
    name: "logitCompl_div"
    op_type: "Glow_Div"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitCompl_div"
    output: "logitCompl_log"
    name: "logitCompl_log"
    op_type: "Glow_Log"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitCompl_log"
    output: "saveCompl"
    name: "saveCompl_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitDiff_clip_minClip"
    input: "logitDiff_clip_maxSplat"
    output: "logitDiff_clip__1"
    name: "logitDiff_clip__1"
    op_type: "Glow_Min"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitDiff_onesSplat"
    input: "logitDiff_clip__1"
    output: "logitDiff_sub"
    name: "logitDiff_sub"
    op_type: "Glow_Sub"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitDiff_clip__1"
    input: "logitDiff_sub"
    output: "logitDiff_div"
    name: "logitDiff_div"
    op_type: "Glow_Div"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitDiff_div"
    output: "logitDiff_log"
    name: "logitDiff_log"
    op_type: "Glow_Log"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 10
      type: INTS
    }
  }
  node {
    input: "logitDiff_log"
    output: "saveDiff"
    name: "saveDiff_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 10
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 10
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "saveDiff"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveDiff_save"
  }
  output {
    name: "saveCompl"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveCompl_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
