ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "Input"
    output: "lstm_unit_sliceO"
    name: "lstm_unit_sliceO"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 16
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 12
      type: INTS
    }
  }
  node {
    input: "lstm_unit_sliceO"
    output: "lstm_unit_sigmoid3"
    name: "lstm_unit_sigmoid3"
    op_type: "Glow_Sigmoid"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "Input"
    output: "lstm_unit_sliceF"
    name: "lstm_unit_sliceF"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 16
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_sliceF"
    output: "lstm_unit_sigmoid1"
    name: "lstm_unit_sigmoid1"
    op_type: "Glow_Sigmoid"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_sigmoid1"
    input: "C"
    output: "lstm_unit_mul1"
    name: "lstm_unit_mul1"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "Input"
    output: "lstm_unit_sliceI"
    name: "lstm_unit_sliceI"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 16
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "lstm_unit_sliceI"
    output: "lstm_unit_sigmoid2"
    name: "lstm_unit_sigmoid2"
    op_type: "Glow_Sigmoid"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "Input"
    output: "lstm_unit_sliceG"
    name: "lstm_unit_sliceG"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 16
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 8
      type: INTS
    }
  }
  node {
    input: "lstm_unit_sliceG"
    output: "lstm_unit_tanh1"
    name: "lstm_unit_tanh1"
    op_type: "Glow_Tanh"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_sigmoid2"
    input: "lstm_unit_tanh1"
    output: "lstm_unit_mul2"
    name: "lstm_unit_mul2"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_mul1"
    input: "lstm_unit_mul2"
    output: "lstm_unit_addC"
    name: "lstm_unit_addC"
    op_type: "Glow_Add"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_addC"
    output: "saveC"
    name: "saveC_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_addC"
    output: "lstm_unit_tanh2"
    name: "lstm_unit_tanh2"
    op_type: "Glow_Tanh"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_sigmoid3"
    input: "lstm_unit_tanh2"
    output: "lstm_unit_mulH"
    name: "lstm_unit_mulH"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "lstm_unit_mulH"
    output: "saveH"
    name: "saveH_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 4
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "Input"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  input {
    name: "C"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  output {
    name: "saveH"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:saveH_save"
  }
  output {
    name: "saveC"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:saveC_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
