ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "src"
    output: "mod"
    name: "mod"
    op_type: "Glow_Modulo"
    attribute {
      name: "i0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 5
      type: INTS
    }
    attribute {
      name: "Divisor"
      i: 3
      type: INT
    }
    attribute {
      name: "SignFollowDivisor"
      i: 0
      type: INT
    }
  }
  node {
    input: "mod"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 5
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      ints: 5
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "src"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
