ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "Y"
    output: "Y_quant"
    name: "Y_quant"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.05
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "Exp"
    output: "exp_quant"
    name: "exp_quant"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "Y_quant"
    input: "exp_quant"
    output: "Pow4"
    name: "Pow4"
    op_type: "Glow_Pow"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.05
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.05
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "Pow4"
    output: "save__3"
    name: "save_save__3"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.05
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_qScale"
      f: 0.05
      type: FLOAT
    }
    attribute {
      name: "o1_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "Y"
    input: "Exp"
    output: "Pow3"
    name: "Pow3"
    op_type: "Glow_Pow"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Pow3"
    output: "save__2"
    name: "save_save__2"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      type: INTS
    }
  }
  node {
    output: "Pow2"
    name: "Pow2"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0.5
      type: FLOAT
    }
  }
  node {
    input: "Y"
    input: "Pow2"
    output: "Pow2__1"
    name: "Pow2__1"
    op_type: "Glow_Pow"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Pow2__1"
    output: "save__1"
    name: "save_save__1"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      type: INTS
    }
  }
  node {
    output: "Pow1"
    name: "Pow1"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "Value"
      f: 2
      type: FLOAT
    }
  }
  node {
    input: "X"
    input: "Pow1"
    output: "Pow1__1"
    name: "Pow1__1"
    op_type: "Glow_Pow"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 1
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "Pow1__1"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 1
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "Exp"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
  output {
    name: "save__1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save__1"
  }
  output {
    name: "save__2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save__2"
  }
  output {
    name: "save__3"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:0.050000000745058059692382812500$qOffset:0$saveName:save_save__3"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
