ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "A"
    output: "QA"
    name: "QA"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.2
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "B"
    output: "QB"
    name: "QB"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "QA"
    input: "QB"
    output: "min"
    name: "min"
    op_type: "Glow_Min"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.2
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.8
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "min"
    output: "minDQ__1"
    name: "minDQ__1"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.8
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "minDQ__1"
    output: "saveMin"
    name: "saveMin_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "QA"
    input: "QB"
    output: "add"
    name: "add"
    op_type: "Glow_Add"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.2
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "add"
    output: "addDQ__1"
    name: "addDQ__1"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "addDQ__1"
    output: "saveAdd"
    name: "saveAdd_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "QA"
    input: "QB"
    output: "sub"
    name: "sub"
    op_type: "Glow_Sub"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.2
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "sub"
    output: "subDQ__1"
    name: "subDQ__1"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "subDQ__1"
    output: "saveSub"
    name: "saveSub_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "QA"
    input: "QB"
    output: "mul"
    name: "mul"
    op_type: "Glow_Mul"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.2
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1.2
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "mul"
    output: "mulDQ__1"
    name: "mulDQ__1"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1.2
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "mulDQ__1"
    output: "saveMul"
    name: "saveMul_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "C"
    output: "QC"
    name: "QC"
    op_type: "Glow_Quantize"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.3
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "QB"
    input: "QC"
    output: "div"
    name: "div"
    op_type: "Glow_Div"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.3
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.7
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "div"
    output: "divDQ__1"
    name: "divDQ__1"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.7
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "divDQ__1"
    output: "saveDiv"
    name: "saveDiv_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "QA"
    input: "QB"
    output: "max"
    name: "max"
    op_type: "Glow_Max"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.2
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i1_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i1_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 0
      type: INT
    }
  }
  node {
    input: "max"
    output: "maxDQ__1"
    name: "maxDQ__1"
    op_type: "Glow_Dequantize"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 1.1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 0
      type: INT
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 100
      type: INTS
    }
  }
  node {
    input: "maxDQ__1"
    output: "saveMax"
    name: "saveMax_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 100
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 100
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "C"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "saveMax"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveMax_save"
  }
  output {
    name: "saveDiv"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveDiv_save"
  }
  output {
    name: "saveMul"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveMul_save"
  }
  output {
    name: "saveSub"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveSub_save"
  }
  output {
    name: "saveAdd"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveAdd_save"
  }
  output {
    name: "saveMin"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 100
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:saveMin_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
