ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "zero"
    name: "zero"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0
      type: FLOAT
    }
  }
  node {
    input: "in"
    input: "zero"
    output: "relu_max__1"
    name: "relu_max__1"
    op_type: "Glow_Max"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 7
      type: INTS
    }
  }
  node {
    input: "relu_max__1"
    output: "relu__1"
    name: "relu_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 7
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 7
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "relu__1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:relu_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
