ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "X"
    output: "replaceNaN_isNaN"
    name: "replaceNaN_isNaN"
    op_type: "Glow_IsNaN"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 6
      type: INTS
    }
  }
  node {
    output: "replaceNaN_splat"
    name: "replaceNaN_splat"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "Value"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "replaceNaN_isNaN"
    input: "replaceNaN_splat"
    input: "X"
    output: "replaceNaN_select"
    name: "replaceNaN_select"
    op_type: "Glow_Select"
    attribute {
      name: "i0_elemKind"
      s: "bool"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 6
      type: INTS
    }
  }
  node {
    input: "replaceNaN_select"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 6
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
