ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "featureMap"
    input: "boxes"
    input: "batchIndices"
    output: "ROIAlign"
    name: "ROIAlign"
    op_type: "Glow_ROIAlign"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 5
      ints: 5
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 5
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "Mode"
      i: 0
      type: INT
    }
    attribute {
      name: "OutputHeight"
      i: 3
      type: INT
    }
    attribute {
      name: "OutputWidth"
      i: 3
      type: INT
    }
    attribute {
      name: "SamplingRatio"
      i: 2
      type: INT
    }
    attribute {
      name: "SpatialScale"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "Aligned"
      i: 1
      type: INT
    }
    attribute {
      name: "Rotated"
      i: 0
      type: INT
    }
  }
  node {
    input: "ROIAlign"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 3
      ints: 3
      ints: 1
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "batchIndices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  input {
    name: "boxes"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "featureMap"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
