ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "X"
    output: "sliceX"
    name: "sliceX"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 2
      ints: 0
      type: INTS
    }
  }
  node {
    input: "sliceX"
    output: "reshapeSX"
    name: "reshapeSX"
    op_type: "Glow_Reshape"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "Dims"
      ints: 3
      type: INTS
    }
    attribute {
      name: "Layout"
      s: "*"
      type: STRING
    }
  }
  node {
    input: "reshapeSX"
    output: "saveRSX"
    name: "saveRSX_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      type: INTS
    }
  }
  node {
    input: "sliceX"
    output: "sliceSliceX"
    name: "sliceSliceX"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 2
      type: INTS
    }
  }
  node {
    input: "sliceSliceX"
    output: "reshapeSliceSliceX"
    name: "reshapeSliceSliceX"
    op_type: "Glow_Reshape"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "Dims"
      ints: 1
      type: INTS
    }
    attribute {
      name: "Layout"
      s: "*"
      type: STRING
    }
  }
  node {
    input: "reshapeSliceSliceX"
    output: "saveRSSX"
    name: "saveRSSX_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "sliceSliceX"
    output: "saveSSX"
    name: "saveSSX_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "sliceX"
    output: "saveSX"
    name: "saveSX_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16"
  }
  output {
    name: "saveSX"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:saveSX_save"
  }
  output {
    name: "saveSSX"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:saveSSX_save"
  }
  output {
    name: "saveRSSX"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:saveRSSX_save"
  }
  output {
    name: "saveRSX"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:saveRSX_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
