ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "in"
    output: "sptdTransposeIn"
    name: "sptdTransposeIn"
    op_type: "Glow_Transpose"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 2
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 4
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "Shuffle"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "Layout"
      s: "NHWC"
      type: STRING
    }
  }
  node {
    input: "sptdTransposeIn"
    output: "spacetodepth"
    name: "spacetodepth"
    op_type: "Glow_SpaceToDepth"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 4
      ints: 4
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 2
      ints: 2
      ints: 8
      type: INTS
    }
    attribute {
      name: "BlockSize"
      i: 2
      type: INT
    }
  }
  node {
    input: "spacetodepth"
    output: "sptdTransposeOut"
    name: "sptdTransposeOut"
    op_type: "Glow_Transpose"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 2
      ints: 2
      ints: 8
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 8
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "Shuffle"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
    attribute {
      name: "Layout"
      s: "NCHW"
      type: STRING
    }
  }
  node {
    input: "sptdTransposeOut"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 8
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 8
      ints: 2
      ints: 2
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:NHWC$elemKind:float"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
