ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "data"
    input: "weights"
    input: "indices"
    input: "lengths"
    output: "SLWS"
    name: "SLWS"
    op_type: "Glow_SparseLengthsWeightedSum"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 1
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "i3_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i3_shape"
      ints: 4
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "LengthsMode"
      s: "Variable"
      type: STRING
    }
    attribute {
      name: "AvgLength"
      f: nan
      type: FLOAT
    }
  }
  node {
    input: "SLWS"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 4
      ints: 1
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 4
      ints: 1
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "lengths"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32"
  }
  input {
    name: "indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  input {
    name: "weights"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16"
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
