ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "data"
    input: "indices"
    input: "lengths"
    output: "SLS"
    name: "SLS"
    op_type: "Glow_SparseLengthsSum"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 1
      type: INT
    }
    attribute {
      name: "i1_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 5
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "o0_qOffset"
      i: 1
      type: INT
    }
    attribute {
      name: "LengthsMode"
      s: "Variable"
      type: STRING
    }
    attribute {
      name: "AvgLength"
      f: nan
      type: FLOAT
    }
  }
  node {
    input: "SLS"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 5
      ints: 2
      type: INTS
    }
    attribute {
      name: "i0_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "i0_qOffset"
      i: 1
      type: INT
    }
    attribute {
      name: "o1_elemKind"
      s: "i8"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 5
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_qScale"
      f: 0.1
      type: FLOAT
    }
    attribute {
      name: "o1_qOffset"
      i: 1
      type: INT
    }
  }
  name: "glow"
  input {
    name: "lengths"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32"
  }
  input {
    name: "indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:0.100000001490116119384765625000$qOffset:1"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:i8$qScale:0.100000001490116119384765625000$qOffset:1$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
