ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "indices"
    input: "values"
    input: "default_value"
    input: "lengths"
    output: "STDM"
    name: "STDM"
    op_type: "Glow_SparseToDenseMask"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 6
      type: INTS
    }
    attribute {
      name: "i2_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i2_shape"
      type: INTS
    }
    attribute {
      name: "i3_elemKind"
      s: "index32"
      type: STRING
    }
    attribute {
      name: "i3_shape"
      ints: 2
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "Mask"
      ints: 2
      ints: 1
      ints: 0
      ints: 13
      ints: 42
      ints: 43
      type: INTS
    }
  }
  node {
    input: "STDM"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 2
      ints: 6
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "lengths"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index32"
  }
  input {
    name: "default_value"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "values"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  input {
    name: "indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
