ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "inputs"
    output: "Split2_out1"
    name: "Split2_out1"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Split2_out1"
    output: "save4"
    name: "save4_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 4
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 2
      ints: 4
      type: INTS
    }
  }
  node {
    input: "inputs"
    output: "Split2_out0"
    name: "Split2_out0"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "Split2_out0"
    output: "save3"
    name: "save3_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "inputs"
    output: "Split1_out1"
    name: "Split1_out1"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 3
      type: INTS
    }
  }
  node {
    input: "Split1_out1"
    output: "save2"
    name: "save2_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "inputs"
    output: "Split1_out0"
    name: "Split1_out0"
    op_type: "Glow_Slice"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 6
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "Split1_out0"
    output: "save1"
    name: "save1_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "inputs"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16"
  }
  output {
    name: "save1"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:save1_save"
  }
  output {
    name: "save2"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:save2_save"
  }
  output {
    name: "save3"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:save3_save"
  }
  output {
    name: "save4"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:save4_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
