ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "zero__1"
    name: "zero__1"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 4
      ints: 15
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0
      type: FLOAT
    }
  }
  node {
    input: "zero__1"
    input: "V"
    output: "tile1__1"
    name: "tile1__1"
    op_type: "Glow_InsertTensor"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 4
      ints: 15
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 4
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 4
      ints: 15
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Count"
      i: 3
      type: INT
    }
    attribute {
      name: "Axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "tile1__1"
    output: "res1"
    name: "res1_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 4
      ints: 15
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 4
      ints: 15
      type: INTS
    }
  }
  node {
    output: "zero"
    name: "zero"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 12
      ints: 5
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0
      type: FLOAT
    }
  }
  node {
    input: "zero"
    input: "V"
    output: "tile0__1"
    name: "tile0__1"
    op_type: "Glow_InsertTensor"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 12
      ints: 5
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 4
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 12
      ints: 5
      type: INTS
    }
    attribute {
      name: "Start"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "Count"
      i: 3
      type: INT
    }
    attribute {
      name: "Axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "tile0__1"
    output: "res0"
    name: "res0_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 12
      ints: 5
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 12
      ints: 5
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "V"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "res0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:res0_save"
  }
  output {
    name: "res1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:res1_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
