ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    input: "input"
    output: "TopK"
    output: "TopK:1"
    name: "TopK"
    op_type: "Glow_TopK"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 1
      ints: 5
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "K"
      i: 3
      type: INT
    }
  }
  node {
    input: "TopK:1"
    output: "indices"
    name: "save_indices_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "index64"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "TopK"
    output: "values"
    name: "save_values_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      ints: 1
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "float"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      ints: 1
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float"
  }
  output {
    name: "values"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:float$saveName:save_values_save"
  }
  output {
    name: "indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:index64$saveName:save_indices_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
