ir_version: 7
producer_name: "GlowONNXModelWriter"
graph {
  node {
    output: "vector_norm_pow_2"
    name: "vector_norm_pow_2"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "Value"
      f: 2
      type: FLOAT
    }
  }
  node {
    input: "norm"
    input: "vector_norm_pow_2"
    output: "vector_norm_pow_2__1"
    name: "vector_norm_pow_2__1"
    op_type: "Glow_Pow"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "vector_norm_pow_2__1"
    output: "vector_norm_reduceAdd"
    name: "vector_norm_reduceAdd"
    op_type: "Glow_BatchedReduceAdd"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 2
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "Axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "vector_norm_exp"
    name: "vector_norm_exp"
    op_type: "Glow_Splat"
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "Value"
      f: 0.5
      type: FLOAT
    }
  }
  node {
    input: "vector_norm_reduceAdd"
    input: "vector_norm_exp"
    output: "vector_norm_sqrt"
    name: "vector_norm_sqrt"
    op_type: "Glow_Pow"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "i1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i1_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o0_shape"
      ints: 3
      type: INTS
    }
  }
  node {
    input: "vector_norm_sqrt"
    output: "save"
    name: "save_save"
    op_type: "Identity"
    attribute {
      name: "i0_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "i0_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "o1_elemKind"
      s: "bfloat16"
      type: STRING
    }
    attribute {
      name: "o1_shape"
      ints: 3
      type: INTS
    }
  }
  name: "glow"
  input {
    name: "norm"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16"
  }
  output {
    name: "save"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
    doc_string: "$offline:0$trainable:0$layout:*$elemKind:bfloat16$saveName:save_save"
  }
}
opset_import {
  version: 9
}
metadata_props {
  key: "GlowRevisionHash"
  value: "89723734922965ce36f05a24cbec87c6d8ba3f46"
}
